{
  "models": {
    "took": 70,
    "total": 3,
    "data": [
      {
        "slugifiedPrimary": "article-extraction-response",
        "headers": {
          "took": 20,
          "total": 0,
          "data": []
        },
        "name": "Article Extraction Response",
        "format": "JSON",
        "description": "Simple JSON output containing extracted article title, content, and more from the following input URL: http://chomsky.info/articles/20131105.htm",
        "links": {
          "headers": {
            "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/models/53aa6087e4b0a705fcc32cf7/headers/"
          },
          "self": {
            "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/models/53aa6087e4b0a705fcc32cf7"
          },
          "version": {
            "parent": true,
            "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942"
          }
        },
        "id": "53aa6087e4b0a705fcc32cf7",
        "body": "{\n  \"title\": \"De-Americanizing the World\",\n  \"excerpt\": \"During the latest episode of the Washington farce that has astonished a bemused world, a Chinese commentator wrote that if the United States cannot be a responsible member of the world system, perhaps the world should become \\\"de-Americanized\\\" -- and separate itself from the rogue state that is the reigning military power but is losing&hellip;\",\n  \"date\": null,\n  \"author\": \"Noam Chomsky\",\n  \"language\": \"en\",\n  \"url\": \"http://chomsky.info/articles/20131105.htm\",\n  \"effective_url\": \"http://chomsky.info/articles/20131105.htm\",\n  \"content\": \"<p>During the latest episode of the Washington farce that has astonished a bemused world, a Chinese commentator wrote that if the United States cannot be a responsible member of the world system, perhaps the world should become \\\"de-Americanized\\\" -- and separate itself from the rogue state that is the reigning military power but is losing credibility in other domains.</p>\\n<p>The Washington debacle's immediate source was the sharp shift to the right among the political class. In the past, the U.S. has sometimes been described sardonically -- but not inaccurately -- as a one-party state: the business party, with two factions called Democrats and Republicans.</p>\\n<p>That is no longer true. The U.S. is still a one-party state, the business party. But it only has one faction: moderate Republicans, now called New Democrats (as the U.S. Congressional coalition styles itself).</p>\\n<p>There is still a Republican organization, but it long ago abandoned any pretense of being a normal parliamentary party. Conservative commentator Norman Ornstein of the American Enterprise Institute describes today's Republicans as \\\"a radical insurgency -- ideologically extreme, scornful of facts and compromise, dismissive of the legitimacy of its political opposition\\\": a serious danger to the society.</p>\\n<p>The party is in lock-step service to the very rich and the corporate sector. Since votes cannot be obtained on that platform, the party has been compelled to mobilize sectors of the society that are extremist by world standards. Crazy is the new norm among Tea Party members and a host of others beyond the mainstream.</p>\\n<p>The Republican establishment and its business sponsors had expected to use them as a battering ram in the neoliberal assault against the population -- to privatize, to deregulate and to limit government, while retaining those parts that serve wealth and power, like the military.</p>\\n<p>The Republican establishment has had some success, but now finds that it can no longer control its base, much to its dismay. The impact on American society thus becomes even more severe. A case in point: the virulent reaction against the Affordable Care Act and the near-shutdown of the government.</p>\\n<p>The Chinese commentator's observation is not entirely novel. In 1999, political analyst Samuel P. Huntington warned that for much of the world, the U.S. is \\\"becoming the rogue superpower,\\\" seen as \\\"the single greatest external threat to their societies.\\\"</p>\\n<p>A few months into the Bush term, Robert Jervis, president of the American Political Science Association, warned that \\\"In the eyes of much of the world, in fact, the prime rogue state today is the United States.\\\" Both Huntington and Jervis warned that such a course is unwise. The consequences for the U.S. could be harmful.</p>\\n<p>In the latest issue of Foreign Affairs, the leading establishment journal, David Kaye reviews one aspect of Washington's departure from the world: rejection of multilateral treaties \\\"as if it were sport.\\\"</p>\\n<p>He explains that some treaties are rejected outright, as when the U.S. Senate \\\"voted against the Convention on the Rights of Persons with Disabilities in 2012 and the Comprehensive Nuclear-Test-Ban Treaty (CTBT) in 1999.\\\"</p>\\n<p>Others are dismissed by inaction, including \\\"such subjects as labor, economic and cultural rights, endangered species, pollution, armed conflict, peacekeeping, nuclear weapons, the law of the sea, and discrimination against women.\\\"</p>\\n<p>Rejection of international obligations \\\"has grown so entrenched,\\\" Kaye writes, \\\"that foreign governments no longer expect Washington's ratification or its full participation in the institutions treaties create. The world is moving on; laws get made elsewhere, with limited (if any) American involvement.\\\"</p>\\n<p>While not new, the practice has indeed become more entrenched in recent years, along with quiet acceptance at home of the doctrine that the U.S. has every right to act as a rogue state.</p>\\n<p>To take a typical example, a few weeks ago U.S. special operations forces snatched a suspect, Abu Anas al-Libi, from the streets of the Libyan capital Tripoli, bringing him to a naval vessel for interrogation without counsel or rights. U.S. Secretary of State John Kerry informed the press that the actions are legal because they comply with American law, eliciting no particular comment.</p>\\n<p>Principles are valid only if they are universal. Reactions would be a bit different, needless to say, if Cuban special forces kidnapped the prominent terrorist Luis Posada Carriles in Miami, bringing him to Cuba for interrogation and trial in accordance with Cuban law.</p>\\n<p>Such actions are restricted to rogue states. More accurately, to the one rogue state that is powerful enough to act with impunity: in recent years, to carry out aggression at will, to terrorize large regions of the world with drone attacks, and much else.</p>\\n<p>And to defy the world in other ways, for example by persisting in its embargo against Cuba despite the long-term opposition of the entire world, apart from Israel, which voted with its protector when the United Nations again condemned the embargo (188-2) in October.</p>\\n<p>Whatever the world may think, U.S. actions are legitimate because we say so. The principle was enunciated by the eminent statesman Dean Acheson in 1962, when he instructed the American Society of International Law that no legal issue arises when the United States responds to a challenge to its \\\"power, position, and prestige.\\\"</p>\\n<p>Cuba committed that crime when it beat back a U.S. invasion and then had the audacity to survive an assault designed to bring \\\"the terrors of the earth\\\" to Cuba, in the words of Kennedy adviser and historian Arthur Schlesinger.</p>\\n<p>When the U.S. gained independence, it sought to join the international community of the day. That is why the Declaration of Independence opens by expressing concern for the \\\"decent respect to the opinions of mankind.\\\"</p>\\n<p>A crucial element was evolution from a disorderly confederacy to a unified \\\"treaty-worthy nation,\\\" in diplomatic historian Eliga H. Gould's phrase, that observed the conventions of the European order. By achieving this status, the new nation also gained the right to act as it wished internally.</p>\\n<p>It could thus proceed to rid itself of the indigenous population and to expand slavery, an institution so \\\"odious\\\" that it could not be tolerated in England, as the distinguished jurist William Murray, Earl of Mansfield, ruled in 1772. Evolving English law was a factor impelling the slave-owning society to escape its reach.</p>\\n<p>Becoming a treaty-worthy nation thus conferred multiple advantages: foreign recognition, and the freedom to act at home without interference. Hegemonic power offers the opportunity to become a rogue state, freely defying international law and norms, while facing increased resistance abroad and contributing to its own decline through self-inflicted wounds.</p>\\n\"\n}",
        "creationDate": 1403674759273,
        "status": "ACTIVE"
      },
      {
        "slugifiedPrimary": "feed-conversion-response",
        "headers": {
          "took": 7,
          "total": 0,
          "data": []
        },
        "name": "Feed Conversion Response",
        "format": "JSON",
        "description": "This is the output produced when the input URL is the BBC feed http://feeds.bbci.co.uk/news/rss.xml. You can request regular RSS or JSON (the output shown here)",
        "links": {
          "headers": {
            "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/models/53aa6087e4b051a76d241c66/headers/"
          },
          "self": {
            "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/models/53aa6087e4b051a76d241c66"
          },
          "version": {
            "parent": true,
            "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942"
          }
        },
        "id": "53aa6087e4b051a76d241c66",
        "body": "{\n  \"rss\": {\n    \"@attributes\": {\n      \"version\": \"2.0\"\n    },\n    \"channel\": {\n      \"title\": \"BBC News - Home\",\n      \"link\": \"http://www.bbc.co.uk/news/#sa-ns_mchannel=rss&amp;ns_source=PublicRSS20-sa\",\n      \"description\": \"The latest stories from the Home section of the BBC News web site.\",\n      \"ttl\": 15,\n      \"image\": {\n        \"title\": \"BBC News - Home\",\n        \"link\": \"http://www.bbc.co.uk/news/#sa-ns_mchannel=rss&amp;ns_source=PublicRSS20-sa\",\n        \"url\": \"http://news.bbcimg.co.uk/nol/shared/img/bbc_news_120x60.gif\"\n      },\n      \"item\": [\n        {\n          \"title\": \"Russia's Putin visits annexed Crimea\",\n          \"link\": \"http://www.bbc.co.uk/news/world-europe-27344029#sa-ns_mchannel=rss&ns_source=PublicRSS20-sa\",\n          \"guid\": \"http://www.bbc.co.uk/news/world-europe-27344029#sa-ns_mchannel=rss&amp;ns_source=PublicRSS20-sa\",\n          \"description\": \"President Putin: \\\"[Crimeans have] proved their loyalty to a historic truth\\\" President Vladimir Putin is making his first visit to Crimea since Russia annexed it from Ukraine in March. He told crowds marking the 1945 Soviet victory over the Nazis that Crimea had shown loyalty to a \\\"historical truth\\\" in choosing to be part of&hellip;\",\n          \"content_encoded\": \"<!-- Adding hypertab -->&#13;\\n&#13;\\n&#13;\\n<!-- end of hypertab --><!--  Embedding the video player --><!--  This is the embedded player component --><!-- wwrights check --><!-- Empty country is used on test environment --><div class=\\\"videoInStoryB\\\">&#13;\\n    <div id=\\\"emp-27339833-111184\\\" class=\\\"emp\\\">&#13;\\n                    &#13;\\n\\t\\t&#13;\\n        <div>&#13;\\n            <div class=\\\"warning\\\">&#13;\\n                                <img class=\\\"holding\\\" src=\\\"http://news.bbcimg.co.uk/media/images/74742000/jpg/_74742312_74742311.jpg\\\" alt=\\\"President Vladimir Putin\\\"/>&#13;\\n            </div>&#13;\\n        </div>&#13;\\n        &#13;\\n        <!-- embedding script -->&#13;\\n        &#13;\\n        </div>&#13;\\n            <!-- companion banner --> &#13;\\n         &#13;\\n        <!-- END - companion banner --> &#13;\\n    \\t&#13;\\n        \\t\\t<!-- caption -->&#13;\\n\\t\\t<p class=\\\"caption\\\">President Putin: \\\"[Crimeans have] proved their loyalty to a historic truth\\\"</p>&#13;\\n\\t\\t<!-- END - caption -->&#13;\\n    &#13;\\n\\t\\t&#13;\\n&#13;\\n</div>&#13;\\n<!-- end of the embedded player component -->&#13;\\n&#13;\\n<!-- Player embedded -->                      <p class=\\\"introduction\\\" id=\\\"story_continues_1\\\">President Vladimir Putin is making his first visit to Crimea since Russia annexed it from Ukraine in March.</p>&#13;\\n        <p>He told crowds marking the 1945 Soviet victory over the Nazis that Crimea had shown loyalty to a \\\"historical truth\\\" in choosing to be part of Russia. </p>&#13;\\n        <p>The Kiev government protested at the visit, calling it a \\\"gross violation of Ukraine's sovereignty\\\".</p>&#13;\\n        <p>Kiev also reported that more than 20 people had died in a security operation against separatists in Mariupol.</p>&#13;\\n  <!--  Embedding the video player -->&#13;\\n<!--  This is the embedded player component -->&#13;\\n&#13;\\n &#13;\\n&#13;\\n&#13;\\n&#13;\\n<!-- wwrights check -->&#13;\\n<!-- Empty country is used on test environment -->&#13;\\n&#13;\\n&#13;\\n&#13;\\n<div class=\\\"videoInStoryB\\\">&#13;\\n    <div id=\\\"emp-27342458-111185\\\" class=\\\"emp\\\">&#13;\\n                    &#13;\\n\\t\\t&#13;\\n        <div>&#13;\\n            <div class=\\\"warning\\\">&#13;\\n                                <img class=\\\"holding\\\" src=\\\"http://news.bbcimg.co.uk/media/images/74748000/jpg/_74748282_74748280.jpg\\\" alt=\\\"Troops fire shots \\\"/>&#13;\\n            </div>&#13;\\n        </div>&#13;\\n        &#13;\\n        <!-- embedding script -->&#13;\\n        &#13;\\n        </div>&#13;\\n            <!-- companion banner --> &#13;\\n         &#13;\\n        <!-- END - companion banner --> &#13;\\n    \\t&#13;\\n        \\t\\t<!-- caption -->&#13;\\n\\t\\t<p class=\\\"caption\\\">Footage showed a gun battle unfold on the streets of Mariupol</p>&#13;\\n\\t\\t<!-- END - caption -->&#13;\\n    &#13;\\n\\t\\t&#13;\\n&#13;\\n</div>&#13;\\n<!-- end of the embedded player component -->&#13;\\n&#13;\\n<!-- Player embedded -->      <p>Ukrainian Interior Minister Arsen Avakov said that about 20 pro-Russian protesters and one Ukrainian security officer had been killed in the southern port.</p>&#13;\\n        <p id=\\\"story_continues_2\\\">Ukrainian forces and pro-Russian separatists had clashed at the police HQ, which was set on fire.</p>&#13;\\n  <span class=\\\"cross-head\\\">Soviet 'iron will'</span>&#13;\\n\\t      <p>In the Crimean port of Sevastopol, Mr Putin thanked the armed forces for their role in World War Two and hailed the incorporation of the peninsula into the Russian Federation.</p>&#13;\\n        <p>He watched a fly-by of Russian aircraft and addressed seamen on naval vessels, as crowds gathered on cliffs overlooking the harbour.</p>&#13;\\n        <p>He said: \\\"I am sure that 2014 will go into the annals of our whole country as the year when the nations living here firmly decided to be together with Russia, affirming fidelity to the historical truth and the memory of our ancestors.\\\"</p>&#13;\\n        <p>The BBC's Daniel Sandford in Sevastopol says Mr Putin was treated as a conquering hero as he walked through the main square and shook hands with Crimeans.</p>&#13;\\n        <p>Mr Putin earlier addressed thousands during a huge, hour-long military parade in Moscow's Red Square, vowing to defend the \\\"motherland\\\".</p>&#13;\\n        <p>He told the crowd that 9 May, known as Victory Day in Russia, was a \\\"day of grief and eternal memory\\\" and stressed how the \\\"iron will of the Soviet people\\\" had saved Europe from slavery.</p>&#13;\\n  <div class=\\\"caption full-width\\\">&#13;\\n  <img src=\\\"http://news.bbcimg.co.uk/media/images/74746000/jpg/_74746461_c355428e-d9cc-41a0-828f-ec92ef9ce291.jpg\\\" width=\\\"624\\\" height=\\\"351\\\" alt=\\\"A former Soviet serviceman marches with a Soviet navy flag to mark Victory Day in the Crimean port of Sevastopol May 9\\\"/><span style=\\\"width:624px;\\\">Thousands of veterans celebrated the Soviet victory over the Nazis</span>&#13;\\n  </div>&#13;\\n<div class=\\\"caption full-width\\\">&#13;\\n  <img src=\\\"http://news.bbcimg.co.uk/media/images/74746000/jpg/_74746463_27d193a3-5c7f-46e3-919c-92aa26b00a77.jpg\\\" width=\\\"624\\\" height=\\\"401\\\" alt=\\\"Vladimir Putin speaks during a Victory Day Parade in Moscow, May 9\\\"/><span style=\\\"width:624px;\\\">Vladimir Putin was cheered as he paid tribute to the sacrifice of the Soviet people</span>&#13;\\n  </div>&#13;\\n<div class=\\\"caption full-width\\\">&#13;\\n  <img src=\\\"http://news.bbcimg.co.uk/media/images/74746000/jpg/_74746898_c899656c-bddf-41b6-bf0e-75e452262e14.jpg\\\" width=\\\"624\\\" height=\\\"401\\\" alt=\\\"Russian soldiers march at the Red Square in Moscow, on May 9\\\"/><span style=\\\"width:624px;\\\">Russia paraded much more hardware than on previous years, and the celebrations lasted longer</span>&#13;\\n  </div>&#13;\\n<div class=\\\"caption full-width\\\">&#13;\\n  <img src=\\\"http://news.bbcimg.co.uk/media/images/74751000/jpg/_74751313_31y0jlcv.jpg\\\" width=\\\"624\\\" height=\\\"351\\\" alt=\\\"A pro-Russia activist marks the anniversary in the eastern city of Donetsk, 9 May\\\"/><span style=\\\"width:624px;\\\">A pro-Russia activist marks the anniversary in the eastern Ukrainian city of Donetsk</span>&#13;\\n  </div>&#13;\\n<div class=\\\"caption full-width\\\">&#13;\\n  <img src=\\\"http://news.bbcimg.co.uk/media/images/74751000/jpg/_74751316_9hmyxt3w.jpg\\\" width=\\\"624\\\" height=\\\"351\\\" alt=\\\"Police HQ in Mariupol set ablaze, 9 May\\\"/><span style=\\\"width:624px;\\\">Violence continues in south Ukraine - the police HQ in Mariupol was set ablaze</span>&#13;\\n  </div>&#13;\\n<div class=\\\"caption full-width\\\">&#13;\\n  <img src=\\\"http://news.bbcimg.co.uk/media/images/74751000/jpg/_74751318_tank.jpg\\\" width=\\\"624\\\" height=\\\"351\\\" alt=\\\"Television footage of an armoured vehicle in Mariupol, 9 May\\\"/><span style=\\\"width:624px;\\\">Television footage showed civilians trying to stop the progress of an armoured vehicle there</span>&#13;\\n  </div>&#13;\\n      <p>\\\"It is a holiday when an overwhelming force of patriotism triumphs, when all of us feel particularly acutely what it means to be loyal to the motherland and how important it is to defend its interests,\\\" he said.</p>&#13;\\n        <p id=\\\"story_continues_3\\\">Nato's Secretary General Anders Fogh Rasmussen said Mr Putin's visit to Crimea was \\\"inappropriate\\\", adding: \\\"We consider the Russian annexation of Crimea to be illegal, illegitimate and we don't recognise it.\\\"</p>&#13;\\n        <p>US National Security Council spokesperson Laura Magnuson said: \\\"We do not accept Russia's illegal annexation of Crimea. Such a visit will only serve to fuel tensions.\\\"</p>&#13;\\n        <p>Ukraine's interim authorities held subdued memorials to mark the Soviet victory.</p>&#13;\\n        <p>A brief veterans' ceremony was held in Kiev's main park, in front of PM Arseniy Yatsenyuk and several former presidents.</p>&#13;\\n        <p>The authorities feared pro-Russian activists would try to stoke violence if there were any higher profile celebrations.</p>&#13;\\n        <p id=\\\"story_continues_4\\\">Nazi Germany invaded the USSR - which included Ukraine - in June 1941 and advanced almost as far as Moscow before being driven back to Berlin.</p>&#13;\\n        <p>Crimea was put under Ukrainian administration in 1954.</p>&#13;\\n        <p>After the collapse of the USSR, Russia maintained a large military presence on the peninsula, and more than half of the region's population identified themselves as ethnic Russian.</p>&#13;\\n        <p>In the chaos that followed the ousting of pro-Russian President Viktor Yanukovych in February this year, Russian forces took over most of the peninsula.</p>&#13;\\n        <p>Crimeans then held a referendum and voted to join Russia, though the vote was widely criticised as offering no real choice.</p>&#13;\\n        <p>Pro-Russian separatists in Ukraine's eastern Donetsk and Luhansk regions are to hold secession referendums on Sunday.</p>&#13;\\n        <p>However, the Interfax-Ukraine news agency reported that the Kharkiv region would not now hold the referendum, as it could not agree a common wording.</p>&#13;\\n        <p>Activists remain in control of many official buildings across the south and east despite a military operation by Kiev to remove them. Dozens have been killed in the unrest.</p>&#13;\\n  <div class=\\\"caption full-width\\\">&#13;\\n  <img src=\\\"http://news.bbcimg.co.uk/media/images/74727000/gif/_74727052_ukraine_donetsk_luhansk_referendum_624.gif\\\" width=\\\"624\\\" height=\\\"387\\\" alt=\\\"Map\\\"/></div>&#13;\\n      <p><strong>Are you in Crimea? Or are you in Mariupol? Do you have any information you would like to share? Please send us your comments. You can email us at </strong><a href=\\\"mailto:haveyoursay@bbc.co.uk\\\">haveyoursay@bbc.co.uk</a><strong> using the subject line 'Mariupol'.</strong></p>&#13;\\n  &#13;\\n\\t&#13;\\n&#13;\\n<p><i>Send your pictures and videos to <b>yourpics@bbc.co.uk</b>  or text them to <b>61124</b> (UK) or <b>+44 7624 800 100</b> (International). If you have a large file you can</i> <a class=\\\"inlineText\\\" href=\\\"http://bbcnewsupload.streamuk.com/\\\">upload here</a><i>.</i></p>&#13;\\n<p><a href=\\\"http://news.bbc.co.uk/1/hi/talking_point/2780295.stm#yourpics\\\">Read the terms and conditions</a></p>&#13;\\n&#13;\\n\\t&#13;\\n    &#13;\\n      &#13;\\n\\n\\n\\t\",\n          \"pubDate\": \"Fri, 09 May 2014 15:02:04 +0000\",\n          \"dc_language\": \"en-gb\",\n          \"dc_format\": \"text/html\",\n          \"dc_identifier\": \"http://www.bbc.co.uk/news/world-europe-27344029\",\n          \"media_thumbnail\": [\n            {\n              \"@attributes\": {\n                \"url\": \"http://news.bbcimg.co.uk/media/images/74751000/jpg/_74751301_ycst2i4p.jpg\"\n              }\n            },\n            {\n              \"@attributes\": {\n                \"url\": \"http://news.bbcimg.co.uk/media/images/74751000/jpg/_74751302_ycst2i4p.jpg\"\n              }\n            }\n          ]\n        },\n        {\n          \"title\": \"Harris 'assaulted daughter's friend'\",\n          \"link\": \"http://www.bbc.co.uk/news/uk-27340134#sa-ns_mchannel=rss&ns_source=PublicRSS20-sa\",\n          \"guid\": \"http://www.bbc.co.uk/news/uk-27340134#sa-ns_mchannel=rss&amp;ns_source=PublicRSS20-sa\",\n          \"description\": \"Rolf Harris arrives at court flanked by his wife and daughter Rolf Harris groomed and molested a friend of his daughter from the age of 13 onwards, a court has heard. The children's entertainer denies 12 counts of indecently assaulting her and three other girls from 1968-86.\",\n          \"content_encoded\": \"<!--  Embedding the video player -->&#13;\\n<!--  This is the embedded player component -->&#13;\\n&#13;\\n &#13;\\n&#13;\\n&#13;\\n&#13;\\n<!-- wwrights check -->&#13;\\n<!-- Empty country is used on test environment -->&#13;\\n&#13;\\n&#13;\\n&#13;\\n<div class=\\\"videoInStoryB\\\">&#13;\\n    <div id=\\\"emp-27342450-102120\\\" class=\\\"emp\\\">&#13;\\n                    &#13;\\n\\t\\t&#13;\\n        <div>&#13;\\n            <div class=\\\"warning\\\">&#13;\\n                                <img class=\\\"holding\\\" src=\\\"http://news.bbcimg.co.uk/media/images/74736000/jpg/_74736900_e4ed3bab-c360-45c1-80e9-0d8c974629c9.jpg\\\" alt=\\\"Rolf Harris with members of family\\\"/>&#13;\\n            </div>&#13;\\n        </div>&#13;\\n        &#13;\\n        <!-- embedding script -->&#13;\\n        &#13;\\n        </div>&#13;\\n            <!-- companion banner --> &#13;\\n         &#13;\\n        <!-- END - companion banner --> &#13;\\n    \\t&#13;\\n        \\t\\t<!-- caption -->&#13;\\n\\t\\t<p class=\\\"caption\\\">Rolf Harris arrives at court flanked by his wife and daughter</p>&#13;\\n\\t\\t<!-- END - caption -->&#13;\\n    &#13;\\n\\t\\t&#13;\\n&#13;\\n</div>&#13;\\n<!-- end of the embedded player component -->&#13;\\n&#13;\\n<!-- Player embedded -->\\t&#13;\\n                      <p class=\\\"introduction\\\" id=\\\"story_continues_1\\\">Rolf Harris groomed and molested a friend of his daughter from the age of 13 onwards, a court has heard.</p>&#13;\\n        <p>The children's entertainer denies 12 counts of indecently assaulting her and three other girls from 1968-86.</p>&#13;\\n        <p>The court heard she used alcohol to cope from the age of 14 and was abused by Mr Harris until she was 29.</p>&#13;\\n        <p>The prosecution told Southwark Crown Court Mr Harris, 84, was a \\\"Jekyll and Hyde\\\" character whose fame and reputation made him \\\"untouchable\\\".</p>&#13;\\n        <p>His alleged victims were aged between seven or eight and 19 when the offences are said to have taken place.</p>&#13;\\n        <p>Seven of the 12 counts are alleged to have been carried out on one victim - his daughter's friend - who lived near the Harris family in south London in the 1960s.</p>&#13;\\n  <div class=\\\"caption full-width\\\">&#13;\\n  <img src=\\\"http://news.bbcimg.co.uk/media/images/74750000/jpg/_74750522_022193022-1.jpg\\\" width=\\\"624\\\" height=\\\"351\\\" alt=\\\"A court sketch of Rolf Harris\\\"/><span style=\\\"width:624px;\\\">Sasha Wass QC, prosecuting, said there was a \\\"side\\\" of Mr Harris that was attracted to young girls</span>&#13;\\n  </div>&#13;\\n      <p>The court was read a letter Mr Harris is said to have written to the victim's father in 1997 asking for his forgiveness. </p>&#13;\\n        <p id=\\\"story_continues_2\\\">The jury was told that, in the letter, Mr Harris said the woman had confronted him about the alleged abuse.</p>&#13;\\n        <p>\\\"[She] told me she had been terrified of me,\\\" he is said to have written. \\\"I said why didn't you just say no? She said to me: 'How could I say no to the great television star Rolf Harris?'\\\"</p>&#13;\\n        <p>Prosecuting, Sasha Wass QC said the girl had been groomed like \\\"a young puppy who had been trained to obey\\\".</p>&#13;\\n        <p>The court heard how the girl was abused while on holiday with the family as well as in her home and his.</p>&#13;\\n        <p>Ms Wass said the assaults continued \\\"when the opportunity arose\\\" and that by the time she was 14 the girl was relying on alcohol to cope.</p>&#13;\\n        <p>The jury was shown a school report which said the alleged victim had become \\\"prone to tears and has been weeping about private/home matters\\\".</p>&#13;\\n  <div class=\\\"caption full-width\\\">&#13;\\n  <img src=\\\"http://news.bbcimg.co.uk/media/images/74741000/jpg/_74741049_cd274e83-cd76-41cb-94ca-037884f68272.jpg\\\" width=\\\"624\\\" height=\\\"351\\\" alt=\\\"Rolf Harris arriving at court\\\"/><span style=\\\"width:624px;\\\">Mr Harris and his family were greeted by photographers as they arrived at court</span>&#13;\\n  </div>&#13;\\n      <p>Ms Wass said that, on arrest, Mr Harris \\\"categorically\\\" denied having sexual contact with the girl while she was under 16, and said his letter to her father expressed regret because they had an affair later and he was a \\\"married man\\\".</p>&#13;\\n        <p>She added: \\\"The prosecution does not, for a minute, suggest that there is not a good, talented and kind side to Mr Harris. </p>&#13;\\n        <p>\\\"But concealed behind this charming and amicable children's entertainer lay a man who exploited the very children who were drawn to him.\\\"</p>&#13;\\n        <p>She added there was \\\"a side of him which is sexually attracted to children and under-age girls\\\".</p>&#13;\\n  <span class=\\\"cross-head\\\">'Fame and reputation'</span>&#13;\\n\\t      <p>She told the jury \\\"part of the excitement\\\" for Mr Harris was touching \\\"children and women alike in quite brazen circumstances\\\".</p>&#13;\\n        <p>Telling the jury about other alleged victims, Ms Wass said one was seven or eight years old when she queued to get an autograph from Mr Harris at a community centre in Portsmouth.</p>&#13;\\n        <p>She said he signed an autograph for her then touched her inappropriately, leaving her \\\"in shock\\\".</p>&#13;\\n        <p>In other alleged incidents, she said Mr Harris \\\"started rubbing himself\\\" against a 15-year-old girl at a pub in London, and touched a 24-year-old makeup artist in Australia, both in 1986.</p>&#13;\\n        <p>Completing her opening statement, she said the evidence showed a \\\"persistent pattern of sexual offending\\\" and demonstrated Mr Harris \\\"had a tendency to touch up females as if he was entitled\\\".</p>&#13;\\n        <p>Ms Wass said his fame meant that \\\"no-one suspected or challenged his behaviour\\\".</p>&#13;\\n        <p>\\\"Mr Harris was too famous, too powerful and his reputation made him untouchable,\\\" she added.</p>&#13;\\n        <p>He arrived at court accompanied by his daughter Bindi, and his wife, Alwen Hughes.</p>&#13;\\n        <p>He entered a not guilty plea at a hearing in January. </p>&#13;\\n        <p>The Australian found fame in 1953 on BBC children's TV, a year after arriving in the UK, and has remained a well-known entertainer, musician and artist since then.</p>&#13;\\n        <p>He had success with novelty pop hits and children's TV and variety shows as well as series about animals and art, and he painted a portrait of the Queen in 2005.</p>&#13;\\n  \\n\\n\\t\",\n          \"pubDate\": \"Fri, 09 May 2014 15:21:52 +0000\",\n          \"dc_language\": \"en-gb\",\n          \"dc_format\": \"text/html\",\n          \"dc_identifier\": \"http://www.bbc.co.uk/news/uk-27340134\",\n          \"media_thumbnail\": [\n            {\n              \"@attributes\": {\n                \"url\": \"http://news.bbcimg.co.uk/media/images/74740000/jpg/_74740642_hi022189961.jpg\"\n              }\n            },\n            {\n              \"@attributes\": {\n                \"url\": \"http://news.bbcimg.co.uk/media/images/74740000/jpg/_74740643_hi022189961.jpg\"\n              }\n            }\n          ]\n        },\n        {\n          \"title\": \"Nigeria 'ignored' school warning\",\n          \"link\": \"http://www.bbc.co.uk/news/world-africa-27344863#sa-ns_mchannel=rss&ns_source=PublicRSS20-sa\",\n          \"guid\": \"http://www.bbc.co.uk/news/world-africa-27344863#sa-ns_mchannel=rss&amp;ns_source=PublicRSS20-sa\",\n          \"description\": \"Nigeria's military had advance warning of the attack on a school at which some 270 girls were kidnapped but failed to act, Amnesty International says. The human rights group says it was told by credible sources that the military had more than four hours' warning of the raid by Boko Haram militants.\",\n          \"content_encoded\": \"<div class=\\\"caption full-width\\\">&#13;\\n  <img src=\\\"http://news.bbcimg.co.uk/media/images/74749000/jpg/_74749851_74749512.jpg\\\" width=\\\"624\\\" height=\\\"351\\\" alt=\\\"Police officers walk past the school in Chibok\\\"/><span style=\\\"width:624px;\\\">The girls were seized from their school at night more than three weeks ago</span>&#13;\\n  </div>&#13;\\n                      <p class=\\\"introduction\\\" id=\\\"story_continues_1\\\">Nigeria's military had advance warning of the attack on a school at which some 270 girls were kidnapped but failed to act, <a href=\\\"http://www.amnesty.org.uk/press-releases/nigeria-government-knew-planned-boko-haram-kidnapping-failed-act\\\">Amnesty International</a> says.</p>&#13;\\n        <p>The human rights group says it was told by credible sources that the military had more than four hours' warning of the raid by Boko Haram militants.</p>&#13;\\n        <p>Fifty-three of the girls escaped soon after being seized in Borno state on 14 April but more than 200 remain captive.</p>&#13;\\n        <p>Nigeria's authorities say they \\\"doubt the veracity\\\" of the Amnesty report.</p>&#13;\\n        <p>\\\"If the government was aware [beforehand] there would have been an intervention [against the militants],\\\" Nigerian Information Minister Labaran Maku said, speaking on BBC World TV.</p>&#13;\\n        <p id=\\\"story_continues_2\\\">However, he said the authorities would still investigate the claims.</p>&#13;\\n  <span class=\\\"cross-head\\\">'Gross dereliction of duty'</span>&#13;\\n\\t      <p>Amnesty says it was told by several people that the military in Maiduguri, capital of north-east Borno state, was informed of the impending attack soon after 19:00 local time.</p>&#13;\\n        <p>Despite the warning, reinforcements were not sent to help protect the school in the remote Chibok area, which was attacked at around midnight, Amnesty says.</p>&#13;\\n        <p>One reason, the rights group says, was a \\\"reported fear of engaging with the often better-equipped armed groups\\\".</p>&#13;\\n        <p>In its report, Amnesty International said the failure of the Nigerian security forces to stop the raid - despite knowing about it in advance - will \\\"amplify the national and international outcry at this horrific crime\\\".</p>&#13;\\n        <p>The organisation's Africa Director Netsanet Belay said it amounted to a \\\"gross dereliction of Nigeria's duty to protect civilians\\\" and called on the leadership to \\\"use all lawful means at their disposal to secure the girls' safe release and ensure nothing like this can happen again\\\".</p>&#13;\\n        <p>Boko Haram has admitted capturing the girls, saying they should not have been in school and should get married instead.</p>&#13;\\n        <p>In a video released earlier this week, leader Abubakar Shekau threatened to \\\"sell\\\" the students.</p>&#13;\\n  <div class=\\\"caption full-width\\\">&#13;\\n  <img src=\\\"http://news.bbcimg.co.uk/media/images/74735000/jpg/_74735387_022179208.jpg\\\" width=\\\"624\\\" height=\\\"351\\\" alt=\\\"Rally for abducted schoolgirls in Johannesburg, South Africa. 8 May 2014\\\"/><span style=\\\"width:624px;\\\">The abductions have sparked worldwide protests, like here in South Africa</span>&#13;\\n  </div>&#13;\\n      <p>It is believed the schoolgirls are being held somewhere in the vast forested areas that stretch from near Chibok into neighbouring Cameroon.</p>&#13;\\n        <p>Teams of experts from the US and UK - including military advisers, negotiators and counsellors - have arrived in Nigeria to help locate and rescue the abductees.</p>&#13;\\n        <p>US Secretary of State John Kerry said earlier that an inter-agency team will work with the Nigerian authorities to secure the girls' release and stressed: \\\"We are also going to do everything possible to counter the menace of Boko Haram\\\".</p>&#13;\\n        <p>Boko Haram, whose name means \\\"Western education is forbidden\\\" in the Hausa language, began its insurgency in Borno state in 2009.</p>&#13;\\n        <p>At least 1,200 people are estimated to have died in the violence this year alone.</p>&#13;\\n        <p>The Nigerian leadership has been widely criticised for its perceived slow response to the girls' kidnapping. </p>&#13;\\n        <p>More protests were held in the British capital, London, and Nigeria's main city, Lagos, on Friday.</p>&#13;\\n        <p>Speaking to the BBC's World Have Your Say programme, Mr Maku said it was important to remember that the army was not fighting an \\\"easy war\\\" against Boko Haram, which operates over a huge area in the remote north. </p>&#13;\\n  <div class=\\\"caption full-width\\\">&#13;\\n  <img src=\\\"http://news.bbcimg.co.uk/media/images/74750000/jpg/_74750377_nigeria_borno_624map_v2.jpg\\\" width=\\\"624\\\" height=\\\"365\\\" alt=\\\"Map\\\"/></div>&#13;\\n\\n\\n\\t\",\n          \"pubDate\": \"Fri, 09 May 2014 15:48:34 +0000\",\n          \"dc_language\": \"en-gb\",\n          \"dc_format\": \"text/html\",\n          \"dc_identifier\": \"http://www.bbc.co.uk/news/world-africa-27344863\",\n          \"media_thumbnail\": [\n            {\n              \"@attributes\": {\n                \"url\": \"http://news.bbcimg.co.uk/media/images/74749000/jpg/_74749855_74749512.jpg\"\n              }\n            },\n            {\n              \"@attributes\": {\n                \"url\": \"http://news.bbcimg.co.uk/media/images/74749000/jpg/_74749856_74749512.jpg\"\n              }\n            }\n          ]\n        }\n      ]\n    }\n  }\n}",
        "creationDate": 1403674759325,
        "status": "ACTIVE"
      },
      {
        "slugifiedPrimary": "rss-channel",
        "headers": {
          "took": 20,
          "total": 0,
          "data": []
        },
        "name": "RSS Channel",
        "format": "JSON",
        "description": "",
        "links": {
          "headers": {
            "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/models/53aa6087e4b0f2c975471669/headers/"
          },
          "self": {
            "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/models/53aa6087e4b0f2c975471669"
          },
          "version": {
            "parent": true,
            "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942"
          }
        },
        "id": "53aa6087e4b0f2c975471669",
        "body": "{\n  \"title\": \"BBC News - Home\",\n  \"link\": \"http://www.bbc.co.uk/news/#sa-ns_mchannel=rss&amp;ns_source=PublicRSS20-sa\",\n  \"description\": \"The latest stories from the Home section of the BBC News web site.\",\n  \"ttl\": 15,\n  \"image\": {\n    \"title\": \"BBC News - Home\",\n    \"link\": \"http://www.bbc.co.uk/news/#sa-ns_mchannel=rss&amp;ns_source=PublicRSS20-sa\",\n    \"url\": \"http://news.bbcimg.co.uk/nol/shared/img/bbc_news_120x60.gif\"\n  }\n}",
        "creationDate": 1403674759397,
        "status": "ACTIVE"
      }
    ]
  },
  "updateDate": "Thu Sep 18 19:40:20 UTC 2014",
  "website": "http://fivefilters.org/content-only/",
  "endpoints": {
    "took": 149,
    "total": 2,
    "data": [
      {
        "headers": {
          "took": 7,
          "total": 0,
          "data": []
        },
        "routeparameters": {
          "took": 54,
          "total": 11,
          "data": [
            {
              "updateDate": 1411660394144,
              "description": "Tell Full-Text RSS what it should expect when fetching the input URL. By default Full-Text RSS tries to guess whether the response is a feed or regular HTML page. It's a good idea to be explicit by passing the appropriate type in this parameter. This is useful if, for example, a feed stops working and begins to return HTML or redirecs to a HTML page as a result of site changes. In such a scenario, if you've been explicit about the URL being a feed, Full-Text RSS will not parse HTML returned in response. If you pass accept=html (previously html=1), Full-Text RSS will not attempt to parse the response as a feed. This increases performance slightly and should be used if you know that the URL is not a feed.  Note: If excluded, or set to auto, Full-Text RSS first tries to parse the server's response as a feed, and only if it fails to parse as a feed will it revert to HTML parsing. In the default parse-as-feed-first mode, Full-Text RSS will identify itself as PHP first and only if a valid feed is returned will it identify itself as a browser in subsequent requests to fetch the feed items. In parse-as-html mode, Full-Text RSS will identify itself as a browser from the very first request.",
              "querystring": true,
              "type": "STRING",
              "creationDate": 1403674760298,
              "slugifiedPrimary": "accept",
              "condition": "OPTIONAL",
              "array": false,
              "name": "accept",
              "links": {
                "endpoint": {
                  "parent": true,
                  "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/endpoints/53aa6087e4b008bb2ef87946"
                },
                "self": {
                  "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/endpoints/53aa6087e4b008bb2ef87946/routeparameters/53aa6088e4b0a705fcc32cfb"
                }
              },
              "id": "53aa6088e4b0a705fcc32cfb",
              "value": "auto",
              "status": "ACTIVE"
            },
            {
              "slugifiedPrimary": "content",
              "condition": "OPTIONAL",
              "array": false,
              "name": "content",
              "description": "If set to 0, the extracted content will not be included in the output.",
              "querystring": true,
              "links": {
                "endpoint": {
                  "parent": true,
                  "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/endpoints/53aa6087e4b008bb2ef87946"
                },
                "self": {
                  "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/endpoints/53aa6087e4b008bb2ef87946/routeparameters/53aa6088e4b008bb2ef8794a"
                }
              },
              "id": "53aa6088e4b008bb2ef8794a",
              "type": "NUMBER",
              "creationDate": 1403674760033,
              "value": "1",
              "status": "ACTIVE"
            },
            {
              "slugifiedPrimary": "format",
              "condition": "OPTIONAL",
              "array": false,
              "name": "format",
              "description": "The default output is RSS. The only other valid output format is JSON. To get JSON output, pass format=json in the querystring. Exclude it from the URL (or set it to ‘rss’) if you’d like RSS.",
              "querystring": true,
              "links": {
                "endpoint": {
                  "parent": true,
                  "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/endpoints/53aa6087e4b008bb2ef87946"
                },
                "self": {
                  "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/endpoints/53aa6087e4b008bb2ef87946/routeparameters/53aa6087e4b008bb2ef87948"
                }
              },
              "id": "53aa6087e4b008bb2ef87948",
              "type": "STRING",
              "creationDate": 1403674759784,
              "value": "json",
              "status": "ACTIVE"
            },
            {
              "slugifiedPrimary": "lang",
              "condition": "OPTIONAL",
              "array": false,
              "name": "lang",
              "description": "Language detection. If you'd like Full-Text RSS to find the language of the articles it processes, you can use one of the following values:  0 - Ignore language; 1 - Use article metadata (e.g. HTML lang attribute) or feed metadata (default value); 2 - As above, but guess the language if it's not specified; 3 - Always guess the language, whether it's specified or not. If language detection is enabled and a match is found, the language code will be returned in the <dc:language> element inside the <item> element.",
              "querystring": true,
              "links": {
                "endpoint": {
                  "parent": true,
                  "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/endpoints/53aa6087e4b008bb2ef87946"
                },
                "self": {
                  "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/endpoints/53aa6087e4b008bb2ef87946/routeparameters/53aa6088e4b008bb2ef8794c"
                }
              },
              "id": "53aa6088e4b008bb2ef8794c",
              "type": "NUMBER",
              "creationDate": 1403674760466,
              "value": "2",
              "status": "ACTIVE"
            },
            {
              "slugifiedPrimary": "links",
              "condition": "OPTIONAL",
              "array": false,
              "name": "links",
              "description": "Links can either be preserved (default), made into footnotes, or removed. None of these options affect the link text, only the hyperlink itself. Valid values: 'preserve', 'remove', 'footnotes'",
              "querystring": true,
              "links": {
                "endpoint": {
                  "parent": true,
                  "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/endpoints/53aa6087e4b008bb2ef87946"
                },
                "self": {
                  "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/endpoints/53aa6087e4b008bb2ef87946/routeparameters/53aa6088e4b00287471a2c2b"
                }
              },
              "id": "53aa6088e4b00287471a2c2b",
              "type": "STRING",
              "creationDate": 1403674760206,
              "value": "remove",
              "status": "ACTIVE"
            },
            {
              "slugifiedPrimary": "max",
              "condition": "OPTIONAL",
              "array": false,
              "name": "max",
              "description": "Feed input only - the maximum number of feed items to process.",
              "querystring": true,
              "links": {
                "endpoint": {
                  "parent": true,
                  "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/endpoints/53aa6087e4b008bb2ef87946"
                },
                "self": {
                  "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/endpoints/53aa6087e4b008bb2ef87946/routeparameters/53aa6087e4b0f2c97547166c"
                }
              },
              "id": "53aa6087e4b0f2c97547166c",
              "type": "NUMBER",
              "creationDate": 1403674759868,
              "value": "5",
              "status": "ACTIVE"
            },
            {
              "slugifiedPrimary": "parser",
              "condition": "OPTIONAL",
              "array": false,
              "name": "parser",
              "description": "The default parser is libxml as it's the fastest. HTML5-PHP is an HTML5 parser implemented in PHP. It's slower than libxml, but can often produce better results. Site-specific rules may invoke HTML5-PHP parsing to ensure all URLs for the site get parsed with it. Use this parameter to explicitly request HTML5-PHP or libxml parsing.",
              "querystring": true,
              "links": {
                "endpoint": {
                  "parent": true,
                  "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/endpoints/53aa6087e4b008bb2ef87946"
                },
                "self": {
                  "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/endpoints/53aa6087e4b008bb2ef87946/routeparameters/53aa6088e4b0f2c97547166e"
                }
              },
              "id": "53aa6088e4b0f2c97547166e",
              "type": "STRING",
              "creationDate": 1403674760551,
              "value": "html5php",
              "status": "ACTIVE"
            },
            {
              "slugifiedPrimary": "summary",
              "condition": "OPTIONAL",
              "array": false,
              "name": "summary",
              "description": "If set to 1, an excerpt will be included for each item in the output.",
              "querystring": true,
              "links": {
                "endpoint": {
                  "parent": true,
                  "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/endpoints/53aa6087e4b008bb2ef87946"
                },
                "self": {
                  "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/endpoints/53aa6087e4b008bb2ef87946/routeparameters/53aa6087e4b008bb2ef87949"
                }
              },
              "id": "53aa6087e4b008bb2ef87949",
              "type": "NUMBER",
              "creationDate": 1403674759950,
              "value": "1",
              "status": "ACTIVE"
            },
            {
              "slugifiedPrimary": "url",
              "condition": "REQUIRED",
              "array": false,
              "name": "url",
              "description": "URL to a partial feed or a standard HTML page. You can omit the 'http://' prefix if you like.",
              "querystring": true,
              "links": {
                "endpoint": {
                  "parent": true,
                  "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/endpoints/53aa6087e4b008bb2ef87946"
                },
                "self": {
                  "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/endpoints/53aa6087e4b008bb2ef87946/routeparameters/53aa6087e4b008bb2ef87947"
                }
              },
              "id": "53aa6087e4b008bb2ef87947",
              "type": "STRING",
              "creationDate": 1403674759686,
              "value": "feeds.bbci.co.uk/news/rss.xml",
              "status": "ACTIVE"
            },
            {
              "slugifiedPrimary": "use_extracted_title",
              "condition": "OPTIONAL",
              "array": false,
              "name": "use_extracted_title",
              "description": "Feed input only - item titles in the original feed do not get changed by default - we assume item titles in feeds are not truncated. If you'd like them to be replaced with titles Full-Text RSS extracts, use this parameter in the request (the value does not matter).",
              "querystring": true,
              "links": {
                "endpoint": {
                  "parent": true,
                  "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/endpoints/53aa6087e4b008bb2ef87946"
                },
                "self": {
                  "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/endpoints/53aa6087e4b008bb2ef87946/routeparameters/53aa6088e4b0a705fcc32cf9"
                }
              },
              "id": "53aa6088e4b0a705fcc32cf9",
              "type": "NUMBER",
              "creationDate": 1403674760121,
              "value": "1",
              "status": "ACTIVE"
            },
            {
              "slugifiedPrimary": "xss",
              "condition": "OPTIONAL",
              "array": false,
              "name": "xss",
              "description": "Use this to enable XSS filtering. We have not enabled this by default because we assume the majority of our users do not display the HTML retrieved by Full-Text RSS in a web page without further processing. If you subscribe to our generated feeds in your news reader application, it should, if it's good software, already filter the resulting HTML for XSS attacks, making it redundant for Full-Text RSS do the same. Similarly with frameworks/CMSs which display feed content - the content should be treated like any other user-submitted content.  If you are writing an application yourself which is processing feeds generated by Full-Text RSS, you can either filter the HTML yourself to remove potential XSS attacks or enable this option. This might be useful if you are processing our generated feeds with JavaScript on the client side - although there's client side xss filtering available too.  Note: if enabled this will also remove certain elements you may want to preserve, such as iframes.",
              "querystring": true,
              "links": {
                "endpoint": {
                  "parent": true,
                  "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/endpoints/53aa6087e4b008bb2ef87946"
                },
                "self": {
                  "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/endpoints/53aa6087e4b008bb2ef87946/routeparameters/53aa6088e4b008bb2ef8794b"
                }
              },
              "id": "53aa6088e4b008bb2ef8794b",
              "type": "NUMBER",
              "creationDate": 1403674760379,
              "value": "1",
              "status": "ACTIVE"
            }
          ]
        },
        "updateDate": 1403674760867,
        "code": 200,
        "method": "GET",
        "description": "Convert a partial feed to a full-text feed. Outputs an RSS 2.0 feed (XML or JSON) containing the full content extracted from the input URL. The input URL can be a partial feed or a web page.",
        "creationDate": 1403674759564,
        "slugifiedPrimary": "convert-feed",
        "routeregex": "/makefulltextfeed.php",
        "route": "/makefulltextfeed.php",
        "array": false,
        "response": {
          "slugifiedPrimary": "feed-conversion-response",
          "headers": {
            "took": 7,
            "total": 0,
            "data": []
          },
          "took": 40,
          "name": "Feed Conversion Response",
          "format": "JSON",
          "description": "This is the output produced when the input URL is the BBC feed http://feeds.bbci.co.uk/news/rss.xml. You can request regular RSS or JSON (the output shown here)",
          "links": {
            "headers": {
              "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/models/53aa6087e4b051a76d241c66/headers/"
            },
            "self": {
              "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/models/53aa6087e4b051a76d241c66"
            },
            "version": {
              "parent": true,
              "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942"
            }
          },
          "id": "53aa6087e4b051a76d241c66",
          "body": "{\n  \"rss\": {\n    \"@attributes\": {\n      \"version\": \"2.0\"\n    },\n    \"channel\": {\n      \"title\": \"BBC News - Home\",\n      \"link\": \"http://www.bbc.co.uk/news/#sa-ns_mchannel=rss&amp;ns_source=PublicRSS20-sa\",\n      \"description\": \"The latest stories from the Home section of the BBC News web site.\",\n      \"ttl\": 15,\n      \"image\": {\n        \"title\": \"BBC News - Home\",\n        \"link\": \"http://www.bbc.co.uk/news/#sa-ns_mchannel=rss&amp;ns_source=PublicRSS20-sa\",\n        \"url\": \"http://news.bbcimg.co.uk/nol/shared/img/bbc_news_120x60.gif\"\n      },\n      \"item\": [\n        {\n          \"title\": \"Russia's Putin visits annexed Crimea\",\n          \"link\": \"http://www.bbc.co.uk/news/world-europe-27344029#sa-ns_mchannel=rss&ns_source=PublicRSS20-sa\",\n          \"guid\": \"http://www.bbc.co.uk/news/world-europe-27344029#sa-ns_mchannel=rss&amp;ns_source=PublicRSS20-sa\",\n          \"description\": \"President Putin: \\\"[Crimeans have] proved their loyalty to a historic truth\\\" President Vladimir Putin is making his first visit to Crimea since Russia annexed it from Ukraine in March. He told crowds marking the 1945 Soviet victory over the Nazis that Crimea had shown loyalty to a \\\"historical truth\\\" in choosing to be part of&hellip;\",\n          \"content_encoded\": \"<!-- Adding hypertab -->&#13;\\n&#13;\\n&#13;\\n<!-- end of hypertab --><!--  Embedding the video player --><!--  This is the embedded player component --><!-- wwrights check --><!-- Empty country is used on test environment --><div class=\\\"videoInStoryB\\\">&#13;\\n    <div id=\\\"emp-27339833-111184\\\" class=\\\"emp\\\">&#13;\\n                    &#13;\\n\\t\\t&#13;\\n        <div>&#13;\\n            <div class=\\\"warning\\\">&#13;\\n                                <img class=\\\"holding\\\" src=\\\"http://news.bbcimg.co.uk/media/images/74742000/jpg/_74742312_74742311.jpg\\\" alt=\\\"President Vladimir Putin\\\"/>&#13;\\n            </div>&#13;\\n        </div>&#13;\\n        &#13;\\n        <!-- embedding script -->&#13;\\n        &#13;\\n        </div>&#13;\\n            <!-- companion banner --> &#13;\\n         &#13;\\n        <!-- END - companion banner --> &#13;\\n    \\t&#13;\\n        \\t\\t<!-- caption -->&#13;\\n\\t\\t<p class=\\\"caption\\\">President Putin: \\\"[Crimeans have] proved their loyalty to a historic truth\\\"</p>&#13;\\n\\t\\t<!-- END - caption -->&#13;\\n    &#13;\\n\\t\\t&#13;\\n&#13;\\n</div>&#13;\\n<!-- end of the embedded player component -->&#13;\\n&#13;\\n<!-- Player embedded -->                      <p class=\\\"introduction\\\" id=\\\"story_continues_1\\\">President Vladimir Putin is making his first visit to Crimea since Russia annexed it from Ukraine in March.</p>&#13;\\n        <p>He told crowds marking the 1945 Soviet victory over the Nazis that Crimea had shown loyalty to a \\\"historical truth\\\" in choosing to be part of Russia. </p>&#13;\\n        <p>The Kiev government protested at the visit, calling it a \\\"gross violation of Ukraine's sovereignty\\\".</p>&#13;\\n        <p>Kiev also reported that more than 20 people had died in a security operation against separatists in Mariupol.</p>&#13;\\n  <!--  Embedding the video player -->&#13;\\n<!--  This is the embedded player component -->&#13;\\n&#13;\\n &#13;\\n&#13;\\n&#13;\\n&#13;\\n<!-- wwrights check -->&#13;\\n<!-- Empty country is used on test environment -->&#13;\\n&#13;\\n&#13;\\n&#13;\\n<div class=\\\"videoInStoryB\\\">&#13;\\n    <div id=\\\"emp-27342458-111185\\\" class=\\\"emp\\\">&#13;\\n                    &#13;\\n\\t\\t&#13;\\n        <div>&#13;\\n            <div class=\\\"warning\\\">&#13;\\n                                <img class=\\\"holding\\\" src=\\\"http://news.bbcimg.co.uk/media/images/74748000/jpg/_74748282_74748280.jpg\\\" alt=\\\"Troops fire shots \\\"/>&#13;\\n            </div>&#13;\\n        </div>&#13;\\n        &#13;\\n        <!-- embedding script -->&#13;\\n        &#13;\\n        </div>&#13;\\n            <!-- companion banner --> &#13;\\n         &#13;\\n        <!-- END - companion banner --> &#13;\\n    \\t&#13;\\n        \\t\\t<!-- caption -->&#13;\\n\\t\\t<p class=\\\"caption\\\">Footage showed a gun battle unfold on the streets of Mariupol</p>&#13;\\n\\t\\t<!-- END - caption -->&#13;\\n    &#13;\\n\\t\\t&#13;\\n&#13;\\n</div>&#13;\\n<!-- end of the embedded player component -->&#13;\\n&#13;\\n<!-- Player embedded -->      <p>Ukrainian Interior Minister Arsen Avakov said that about 20 pro-Russian protesters and one Ukrainian security officer had been killed in the southern port.</p>&#13;\\n        <p id=\\\"story_continues_2\\\">Ukrainian forces and pro-Russian separatists had clashed at the police HQ, which was set on fire.</p>&#13;\\n  <span class=\\\"cross-head\\\">Soviet 'iron will'</span>&#13;\\n\\t      <p>In the Crimean port of Sevastopol, Mr Putin thanked the armed forces for their role in World War Two and hailed the incorporation of the peninsula into the Russian Federation.</p>&#13;\\n        <p>He watched a fly-by of Russian aircraft and addressed seamen on naval vessels, as crowds gathered on cliffs overlooking the harbour.</p>&#13;\\n        <p>He said: \\\"I am sure that 2014 will go into the annals of our whole country as the year when the nations living here firmly decided to be together with Russia, affirming fidelity to the historical truth and the memory of our ancestors.\\\"</p>&#13;\\n        <p>The BBC's Daniel Sandford in Sevastopol says Mr Putin was treated as a conquering hero as he walked through the main square and shook hands with Crimeans.</p>&#13;\\n        <p>Mr Putin earlier addressed thousands during a huge, hour-long military parade in Moscow's Red Square, vowing to defend the \\\"motherland\\\".</p>&#13;\\n        <p>He told the crowd that 9 May, known as Victory Day in Russia, was a \\\"day of grief and eternal memory\\\" and stressed how the \\\"iron will of the Soviet people\\\" had saved Europe from slavery.</p>&#13;\\n  <div class=\\\"caption full-width\\\">&#13;\\n  <img src=\\\"http://news.bbcimg.co.uk/media/images/74746000/jpg/_74746461_c355428e-d9cc-41a0-828f-ec92ef9ce291.jpg\\\" width=\\\"624\\\" height=\\\"351\\\" alt=\\\"A former Soviet serviceman marches with a Soviet navy flag to mark Victory Day in the Crimean port of Sevastopol May 9\\\"/><span style=\\\"width:624px;\\\">Thousands of veterans celebrated the Soviet victory over the Nazis</span>&#13;\\n  </div>&#13;\\n<div class=\\\"caption full-width\\\">&#13;\\n  <img src=\\\"http://news.bbcimg.co.uk/media/images/74746000/jpg/_74746463_27d193a3-5c7f-46e3-919c-92aa26b00a77.jpg\\\" width=\\\"624\\\" height=\\\"401\\\" alt=\\\"Vladimir Putin speaks during a Victory Day Parade in Moscow, May 9\\\"/><span style=\\\"width:624px;\\\">Vladimir Putin was cheered as he paid tribute to the sacrifice of the Soviet people</span>&#13;\\n  </div>&#13;\\n<div class=\\\"caption full-width\\\">&#13;\\n  <img src=\\\"http://news.bbcimg.co.uk/media/images/74746000/jpg/_74746898_c899656c-bddf-41b6-bf0e-75e452262e14.jpg\\\" width=\\\"624\\\" height=\\\"401\\\" alt=\\\"Russian soldiers march at the Red Square in Moscow, on May 9\\\"/><span style=\\\"width:624px;\\\">Russia paraded much more hardware than on previous years, and the celebrations lasted longer</span>&#13;\\n  </div>&#13;\\n<div class=\\\"caption full-width\\\">&#13;\\n  <img src=\\\"http://news.bbcimg.co.uk/media/images/74751000/jpg/_74751313_31y0jlcv.jpg\\\" width=\\\"624\\\" height=\\\"351\\\" alt=\\\"A pro-Russia activist marks the anniversary in the eastern city of Donetsk, 9 May\\\"/><span style=\\\"width:624px;\\\">A pro-Russia activist marks the anniversary in the eastern Ukrainian city of Donetsk</span>&#13;\\n  </div>&#13;\\n<div class=\\\"caption full-width\\\">&#13;\\n  <img src=\\\"http://news.bbcimg.co.uk/media/images/74751000/jpg/_74751316_9hmyxt3w.jpg\\\" width=\\\"624\\\" height=\\\"351\\\" alt=\\\"Police HQ in Mariupol set ablaze, 9 May\\\"/><span style=\\\"width:624px;\\\">Violence continues in south Ukraine - the police HQ in Mariupol was set ablaze</span>&#13;\\n  </div>&#13;\\n<div class=\\\"caption full-width\\\">&#13;\\n  <img src=\\\"http://news.bbcimg.co.uk/media/images/74751000/jpg/_74751318_tank.jpg\\\" width=\\\"624\\\" height=\\\"351\\\" alt=\\\"Television footage of an armoured vehicle in Mariupol, 9 May\\\"/><span style=\\\"width:624px;\\\">Television footage showed civilians trying to stop the progress of an armoured vehicle there</span>&#13;\\n  </div>&#13;\\n      <p>\\\"It is a holiday when an overwhelming force of patriotism triumphs, when all of us feel particularly acutely what it means to be loyal to the motherland and how important it is to defend its interests,\\\" he said.</p>&#13;\\n        <p id=\\\"story_continues_3\\\">Nato's Secretary General Anders Fogh Rasmussen said Mr Putin's visit to Crimea was \\\"inappropriate\\\", adding: \\\"We consider the Russian annexation of Crimea to be illegal, illegitimate and we don't recognise it.\\\"</p>&#13;\\n        <p>US National Security Council spokesperson Laura Magnuson said: \\\"We do not accept Russia's illegal annexation of Crimea. Such a visit will only serve to fuel tensions.\\\"</p>&#13;\\n        <p>Ukraine's interim authorities held subdued memorials to mark the Soviet victory.</p>&#13;\\n        <p>A brief veterans' ceremony was held in Kiev's main park, in front of PM Arseniy Yatsenyuk and several former presidents.</p>&#13;\\n        <p>The authorities feared pro-Russian activists would try to stoke violence if there were any higher profile celebrations.</p>&#13;\\n        <p id=\\\"story_continues_4\\\">Nazi Germany invaded the USSR - which included Ukraine - in June 1941 and advanced almost as far as Moscow before being driven back to Berlin.</p>&#13;\\n        <p>Crimea was put under Ukrainian administration in 1954.</p>&#13;\\n        <p>After the collapse of the USSR, Russia maintained a large military presence on the peninsula, and more than half of the region's population identified themselves as ethnic Russian.</p>&#13;\\n        <p>In the chaos that followed the ousting of pro-Russian President Viktor Yanukovych in February this year, Russian forces took over most of the peninsula.</p>&#13;\\n        <p>Crimeans then held a referendum and voted to join Russia, though the vote was widely criticised as offering no real choice.</p>&#13;\\n        <p>Pro-Russian separatists in Ukraine's eastern Donetsk and Luhansk regions are to hold secession referendums on Sunday.</p>&#13;\\n        <p>However, the Interfax-Ukraine news agency reported that the Kharkiv region would not now hold the referendum, as it could not agree a common wording.</p>&#13;\\n        <p>Activists remain in control of many official buildings across the south and east despite a military operation by Kiev to remove them. Dozens have been killed in the unrest.</p>&#13;\\n  <div class=\\\"caption full-width\\\">&#13;\\n  <img src=\\\"http://news.bbcimg.co.uk/media/images/74727000/gif/_74727052_ukraine_donetsk_luhansk_referendum_624.gif\\\" width=\\\"624\\\" height=\\\"387\\\" alt=\\\"Map\\\"/></div>&#13;\\n      <p><strong>Are you in Crimea? Or are you in Mariupol? Do you have any information you would like to share? Please send us your comments. You can email us at </strong><a href=\\\"mailto:haveyoursay@bbc.co.uk\\\">haveyoursay@bbc.co.uk</a><strong> using the subject line 'Mariupol'.</strong></p>&#13;\\n  &#13;\\n\\t&#13;\\n&#13;\\n<p><i>Send your pictures and videos to <b>yourpics@bbc.co.uk</b>  or text them to <b>61124</b> (UK) or <b>+44 7624 800 100</b> (International). If you have a large file you can</i> <a class=\\\"inlineText\\\" href=\\\"http://bbcnewsupload.streamuk.com/\\\">upload here</a><i>.</i></p>&#13;\\n<p><a href=\\\"http://news.bbc.co.uk/1/hi/talking_point/2780295.stm#yourpics\\\">Read the terms and conditions</a></p>&#13;\\n&#13;\\n\\t&#13;\\n    &#13;\\n      &#13;\\n\\n\\n\\t\",\n          \"pubDate\": \"Fri, 09 May 2014 15:02:04 +0000\",\n          \"dc_language\": \"en-gb\",\n          \"dc_format\": \"text/html\",\n          \"dc_identifier\": \"http://www.bbc.co.uk/news/world-europe-27344029\",\n          \"media_thumbnail\": [\n            {\n              \"@attributes\": {\n                \"url\": \"http://news.bbcimg.co.uk/media/images/74751000/jpg/_74751301_ycst2i4p.jpg\"\n              }\n            },\n            {\n              \"@attributes\": {\n                \"url\": \"http://news.bbcimg.co.uk/media/images/74751000/jpg/_74751302_ycst2i4p.jpg\"\n              }\n            }\n          ]\n        },\n        {\n          \"title\": \"Harris 'assaulted daughter's friend'\",\n          \"link\": \"http://www.bbc.co.uk/news/uk-27340134#sa-ns_mchannel=rss&ns_source=PublicRSS20-sa\",\n          \"guid\": \"http://www.bbc.co.uk/news/uk-27340134#sa-ns_mchannel=rss&amp;ns_source=PublicRSS20-sa\",\n          \"description\": \"Rolf Harris arrives at court flanked by his wife and daughter Rolf Harris groomed and molested a friend of his daughter from the age of 13 onwards, a court has heard. The children's entertainer denies 12 counts of indecently assaulting her and three other girls from 1968-86.\",\n          \"content_encoded\": \"<!--  Embedding the video player -->&#13;\\n<!--  This is the embedded player component -->&#13;\\n&#13;\\n &#13;\\n&#13;\\n&#13;\\n&#13;\\n<!-- wwrights check -->&#13;\\n<!-- Empty country is used on test environment -->&#13;\\n&#13;\\n&#13;\\n&#13;\\n<div class=\\\"videoInStoryB\\\">&#13;\\n    <div id=\\\"emp-27342450-102120\\\" class=\\\"emp\\\">&#13;\\n                    &#13;\\n\\t\\t&#13;\\n        <div>&#13;\\n            <div class=\\\"warning\\\">&#13;\\n                                <img class=\\\"holding\\\" src=\\\"http://news.bbcimg.co.uk/media/images/74736000/jpg/_74736900_e4ed3bab-c360-45c1-80e9-0d8c974629c9.jpg\\\" alt=\\\"Rolf Harris with members of family\\\"/>&#13;\\n            </div>&#13;\\n        </div>&#13;\\n        &#13;\\n        <!-- embedding script -->&#13;\\n        &#13;\\n        </div>&#13;\\n            <!-- companion banner --> &#13;\\n         &#13;\\n        <!-- END - companion banner --> &#13;\\n    \\t&#13;\\n        \\t\\t<!-- caption -->&#13;\\n\\t\\t<p class=\\\"caption\\\">Rolf Harris arrives at court flanked by his wife and daughter</p>&#13;\\n\\t\\t<!-- END - caption -->&#13;\\n    &#13;\\n\\t\\t&#13;\\n&#13;\\n</div>&#13;\\n<!-- end of the embedded player component -->&#13;\\n&#13;\\n<!-- Player embedded -->\\t&#13;\\n                      <p class=\\\"introduction\\\" id=\\\"story_continues_1\\\">Rolf Harris groomed and molested a friend of his daughter from the age of 13 onwards, a court has heard.</p>&#13;\\n        <p>The children's entertainer denies 12 counts of indecently assaulting her and three other girls from 1968-86.</p>&#13;\\n        <p>The court heard she used alcohol to cope from the age of 14 and was abused by Mr Harris until she was 29.</p>&#13;\\n        <p>The prosecution told Southwark Crown Court Mr Harris, 84, was a \\\"Jekyll and Hyde\\\" character whose fame and reputation made him \\\"untouchable\\\".</p>&#13;\\n        <p>His alleged victims were aged between seven or eight and 19 when the offences are said to have taken place.</p>&#13;\\n        <p>Seven of the 12 counts are alleged to have been carried out on one victim - his daughter's friend - who lived near the Harris family in south London in the 1960s.</p>&#13;\\n  <div class=\\\"caption full-width\\\">&#13;\\n  <img src=\\\"http://news.bbcimg.co.uk/media/images/74750000/jpg/_74750522_022193022-1.jpg\\\" width=\\\"624\\\" height=\\\"351\\\" alt=\\\"A court sketch of Rolf Harris\\\"/><span style=\\\"width:624px;\\\">Sasha Wass QC, prosecuting, said there was a \\\"side\\\" of Mr Harris that was attracted to young girls</span>&#13;\\n  </div>&#13;\\n      <p>The court was read a letter Mr Harris is said to have written to the victim's father in 1997 asking for his forgiveness. </p>&#13;\\n        <p id=\\\"story_continues_2\\\">The jury was told that, in the letter, Mr Harris said the woman had confronted him about the alleged abuse.</p>&#13;\\n        <p>\\\"[She] told me she had been terrified of me,\\\" he is said to have written. \\\"I said why didn't you just say no? She said to me: 'How could I say no to the great television star Rolf Harris?'\\\"</p>&#13;\\n        <p>Prosecuting, Sasha Wass QC said the girl had been groomed like \\\"a young puppy who had been trained to obey\\\".</p>&#13;\\n        <p>The court heard how the girl was abused while on holiday with the family as well as in her home and his.</p>&#13;\\n        <p>Ms Wass said the assaults continued \\\"when the opportunity arose\\\" and that by the time she was 14 the girl was relying on alcohol to cope.</p>&#13;\\n        <p>The jury was shown a school report which said the alleged victim had become \\\"prone to tears and has been weeping about private/home matters\\\".</p>&#13;\\n  <div class=\\\"caption full-width\\\">&#13;\\n  <img src=\\\"http://news.bbcimg.co.uk/media/images/74741000/jpg/_74741049_cd274e83-cd76-41cb-94ca-037884f68272.jpg\\\" width=\\\"624\\\" height=\\\"351\\\" alt=\\\"Rolf Harris arriving at court\\\"/><span style=\\\"width:624px;\\\">Mr Harris and his family were greeted by photographers as they arrived at court</span>&#13;\\n  </div>&#13;\\n      <p>Ms Wass said that, on arrest, Mr Harris \\\"categorically\\\" denied having sexual contact with the girl while she was under 16, and said his letter to her father expressed regret because they had an affair later and he was a \\\"married man\\\".</p>&#13;\\n        <p>She added: \\\"The prosecution does not, for a minute, suggest that there is not a good, talented and kind side to Mr Harris. </p>&#13;\\n        <p>\\\"But concealed behind this charming and amicable children's entertainer lay a man who exploited the very children who were drawn to him.\\\"</p>&#13;\\n        <p>She added there was \\\"a side of him which is sexually attracted to children and under-age girls\\\".</p>&#13;\\n  <span class=\\\"cross-head\\\">'Fame and reputation'</span>&#13;\\n\\t      <p>She told the jury \\\"part of the excitement\\\" for Mr Harris was touching \\\"children and women alike in quite brazen circumstances\\\".</p>&#13;\\n        <p>Telling the jury about other alleged victims, Ms Wass said one was seven or eight years old when she queued to get an autograph from Mr Harris at a community centre in Portsmouth.</p>&#13;\\n        <p>She said he signed an autograph for her then touched her inappropriately, leaving her \\\"in shock\\\".</p>&#13;\\n        <p>In other alleged incidents, she said Mr Harris \\\"started rubbing himself\\\" against a 15-year-old girl at a pub in London, and touched a 24-year-old makeup artist in Australia, both in 1986.</p>&#13;\\n        <p>Completing her opening statement, she said the evidence showed a \\\"persistent pattern of sexual offending\\\" and demonstrated Mr Harris \\\"had a tendency to touch up females as if he was entitled\\\".</p>&#13;\\n        <p>Ms Wass said his fame meant that \\\"no-one suspected or challenged his behaviour\\\".</p>&#13;\\n        <p>\\\"Mr Harris was too famous, too powerful and his reputation made him untouchable,\\\" she added.</p>&#13;\\n        <p>He arrived at court accompanied by his daughter Bindi, and his wife, Alwen Hughes.</p>&#13;\\n        <p>He entered a not guilty plea at a hearing in January. </p>&#13;\\n        <p>The Australian found fame in 1953 on BBC children's TV, a year after arriving in the UK, and has remained a well-known entertainer, musician and artist since then.</p>&#13;\\n        <p>He had success with novelty pop hits and children's TV and variety shows as well as series about animals and art, and he painted a portrait of the Queen in 2005.</p>&#13;\\n  \\n\\n\\t\",\n          \"pubDate\": \"Fri, 09 May 2014 15:21:52 +0000\",\n          \"dc_language\": \"en-gb\",\n          \"dc_format\": \"text/html\",\n          \"dc_identifier\": \"http://www.bbc.co.uk/news/uk-27340134\",\n          \"media_thumbnail\": [\n            {\n              \"@attributes\": {\n                \"url\": \"http://news.bbcimg.co.uk/media/images/74740000/jpg/_74740642_hi022189961.jpg\"\n              }\n            },\n            {\n              \"@attributes\": {\n                \"url\": \"http://news.bbcimg.co.uk/media/images/74740000/jpg/_74740643_hi022189961.jpg\"\n              }\n            }\n          ]\n        },\n        {\n          \"title\": \"Nigeria 'ignored' school warning\",\n          \"link\": \"http://www.bbc.co.uk/news/world-africa-27344863#sa-ns_mchannel=rss&ns_source=PublicRSS20-sa\",\n          \"guid\": \"http://www.bbc.co.uk/news/world-africa-27344863#sa-ns_mchannel=rss&amp;ns_source=PublicRSS20-sa\",\n          \"description\": \"Nigeria's military had advance warning of the attack on a school at which some 270 girls were kidnapped but failed to act, Amnesty International says. The human rights group says it was told by credible sources that the military had more than four hours' warning of the raid by Boko Haram militants.\",\n          \"content_encoded\": \"<div class=\\\"caption full-width\\\">&#13;\\n  <img src=\\\"http://news.bbcimg.co.uk/media/images/74749000/jpg/_74749851_74749512.jpg\\\" width=\\\"624\\\" height=\\\"351\\\" alt=\\\"Police officers walk past the school in Chibok\\\"/><span style=\\\"width:624px;\\\">The girls were seized from their school at night more than three weeks ago</span>&#13;\\n  </div>&#13;\\n                      <p class=\\\"introduction\\\" id=\\\"story_continues_1\\\">Nigeria's military had advance warning of the attack on a school at which some 270 girls were kidnapped but failed to act, <a href=\\\"http://www.amnesty.org.uk/press-releases/nigeria-government-knew-planned-boko-haram-kidnapping-failed-act\\\">Amnesty International</a> says.</p>&#13;\\n        <p>The human rights group says it was told by credible sources that the military had more than four hours' warning of the raid by Boko Haram militants.</p>&#13;\\n        <p>Fifty-three of the girls escaped soon after being seized in Borno state on 14 April but more than 200 remain captive.</p>&#13;\\n        <p>Nigeria's authorities say they \\\"doubt the veracity\\\" of the Amnesty report.</p>&#13;\\n        <p>\\\"If the government was aware [beforehand] there would have been an intervention [against the militants],\\\" Nigerian Information Minister Labaran Maku said, speaking on BBC World TV.</p>&#13;\\n        <p id=\\\"story_continues_2\\\">However, he said the authorities would still investigate the claims.</p>&#13;\\n  <span class=\\\"cross-head\\\">'Gross dereliction of duty'</span>&#13;\\n\\t      <p>Amnesty says it was told by several people that the military in Maiduguri, capital of north-east Borno state, was informed of the impending attack soon after 19:00 local time.</p>&#13;\\n        <p>Despite the warning, reinforcements were not sent to help protect the school in the remote Chibok area, which was attacked at around midnight, Amnesty says.</p>&#13;\\n        <p>One reason, the rights group says, was a \\\"reported fear of engaging with the often better-equipped armed groups\\\".</p>&#13;\\n        <p>In its report, Amnesty International said the failure of the Nigerian security forces to stop the raid - despite knowing about it in advance - will \\\"amplify the national and international outcry at this horrific crime\\\".</p>&#13;\\n        <p>The organisation's Africa Director Netsanet Belay said it amounted to a \\\"gross dereliction of Nigeria's duty to protect civilians\\\" and called on the leadership to \\\"use all lawful means at their disposal to secure the girls' safe release and ensure nothing like this can happen again\\\".</p>&#13;\\n        <p>Boko Haram has admitted capturing the girls, saying they should not have been in school and should get married instead.</p>&#13;\\n        <p>In a video released earlier this week, leader Abubakar Shekau threatened to \\\"sell\\\" the students.</p>&#13;\\n  <div class=\\\"caption full-width\\\">&#13;\\n  <img src=\\\"http://news.bbcimg.co.uk/media/images/74735000/jpg/_74735387_022179208.jpg\\\" width=\\\"624\\\" height=\\\"351\\\" alt=\\\"Rally for abducted schoolgirls in Johannesburg, South Africa. 8 May 2014\\\"/><span style=\\\"width:624px;\\\">The abductions have sparked worldwide protests, like here in South Africa</span>&#13;\\n  </div>&#13;\\n      <p>It is believed the schoolgirls are being held somewhere in the vast forested areas that stretch from near Chibok into neighbouring Cameroon.</p>&#13;\\n        <p>Teams of experts from the US and UK - including military advisers, negotiators and counsellors - have arrived in Nigeria to help locate and rescue the abductees.</p>&#13;\\n        <p>US Secretary of State John Kerry said earlier that an inter-agency team will work with the Nigerian authorities to secure the girls' release and stressed: \\\"We are also going to do everything possible to counter the menace of Boko Haram\\\".</p>&#13;\\n        <p>Boko Haram, whose name means \\\"Western education is forbidden\\\" in the Hausa language, began its insurgency in Borno state in 2009.</p>&#13;\\n        <p>At least 1,200 people are estimated to have died in the violence this year alone.</p>&#13;\\n        <p>The Nigerian leadership has been widely criticised for its perceived slow response to the girls' kidnapping. </p>&#13;\\n        <p>More protests were held in the British capital, London, and Nigeria's main city, Lagos, on Friday.</p>&#13;\\n        <p>Speaking to the BBC's World Have Your Say programme, Mr Maku said it was important to remember that the army was not fighting an \\\"easy war\\\" against Boko Haram, which operates over a huge area in the remote north. </p>&#13;\\n  <div class=\\\"caption full-width\\\">&#13;\\n  <img src=\\\"http://news.bbcimg.co.uk/media/images/74750000/jpg/_74750377_nigeria_borno_624map_v2.jpg\\\" width=\\\"624\\\" height=\\\"365\\\" alt=\\\"Map\\\"/></div>&#13;\\n\\n\\n\\t\",\n          \"pubDate\": \"Fri, 09 May 2014 15:48:34 +0000\",\n          \"dc_language\": \"en-gb\",\n          \"dc_format\": \"text/html\",\n          \"dc_identifier\": \"http://www.bbc.co.uk/news/world-africa-27344863\",\n          \"media_thumbnail\": [\n            {\n              \"@attributes\": {\n                \"url\": \"http://news.bbcimg.co.uk/media/images/74749000/jpg/_74749855_74749512.jpg\"\n              }\n            },\n            {\n              \"@attributes\": {\n                \"url\": \"http://news.bbcimg.co.uk/media/images/74749000/jpg/_74749856_74749512.jpg\"\n              }\n            }\n          ]\n        }\n      ]\n    }\n  }\n}",
          "creationDate": 1403674759325,
          "status": "ACTIVE"
        },
        "name": "Convert Feed",
        "routeindex": 0,
        "links": {
          "headers": {
            "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/endpoints/53aa6087e4b008bb2ef87946/headers/"
          },
          "routeparameters": {
            "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/endpoints/53aa6087e4b008bb2ef87946/routeparameters/"
          },
          "response": {
            "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/models/53aa6087e4b051a76d241c66"
          },
          "self": {
            "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/endpoints/53aa6087e4b008bb2ef87946"
          },
          "version": {
            "parent": true,
            "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942"
          },
          "parameters": {
            "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/endpoints/53aa6087e4b008bb2ef87946/parameters/"
          },
          "group": {
            "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/groups/53aa6087e4b0a705fcc32cf8"
          }
        },
        "id": "53aa6087e4b008bb2ef87946",
        "parameters": {
          "took": 7,
          "total": 0,
          "data": []
        },
        "status": "ACTIVE",
        "group": {
          "slugifiedPrimary": "2-feed-conversion",
          "took": 36,
          "name": "2. Feed Conversion",
          "index": 1,
          "links": {
            "self": {
              "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/groups/53aa6087e4b0a705fcc32cf8"
            },
            "version": {
              "parent": true,
              "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942"
            }
          },
          "id": "53aa6087e4b0a705fcc32cf8",
          "creationDate": 1403674759512,
          "status": "ACTIVE"
        }
      },
      {
        "headers": {
          "took": 20,
          "total": 0,
          "data": []
        },
        "routeparameters": {
          "took": 5,
          "total": 0,
          "data": []
        },
        "updateDate": 1403674760837,
        "code": 200,
        "method": "POST",
        "description": "Extract article from a web page. Outputs JSON containing the full content extracted from the input URL or the input HTML.",
        "creationDate": 1403674760602,
        "slugifiedPrimary": "extract-article",
        "routeregex": "/extract.php",
        "route": "/extract.php",
        "array": false,
        "response": {
          "slugifiedPrimary": "article-extraction-response",
          "headers": {
            "took": 20,
            "total": 0,
            "data": []
          },
          "took": 33,
          "name": "Article Extraction Response",
          "format": "JSON",
          "description": "Simple JSON output containing extracted article title, content, and more from the following input URL: http://chomsky.info/articles/20131105.htm",
          "links": {
            "headers": {
              "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/models/53aa6087e4b0a705fcc32cf7/headers/"
            },
            "self": {
              "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/models/53aa6087e4b0a705fcc32cf7"
            },
            "version": {
              "parent": true,
              "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942"
            }
          },
          "id": "53aa6087e4b0a705fcc32cf7",
          "body": "{\n  \"title\": \"De-Americanizing the World\",\n  \"excerpt\": \"During the latest episode of the Washington farce that has astonished a bemused world, a Chinese commentator wrote that if the United States cannot be a responsible member of the world system, perhaps the world should become \\\"de-Americanized\\\" -- and separate itself from the rogue state that is the reigning military power but is losing&hellip;\",\n  \"date\": null,\n  \"author\": \"Noam Chomsky\",\n  \"language\": \"en\",\n  \"url\": \"http://chomsky.info/articles/20131105.htm\",\n  \"effective_url\": \"http://chomsky.info/articles/20131105.htm\",\n  \"content\": \"<p>During the latest episode of the Washington farce that has astonished a bemused world, a Chinese commentator wrote that if the United States cannot be a responsible member of the world system, perhaps the world should become \\\"de-Americanized\\\" -- and separate itself from the rogue state that is the reigning military power but is losing credibility in other domains.</p>\\n<p>The Washington debacle's immediate source was the sharp shift to the right among the political class. In the past, the U.S. has sometimes been described sardonically -- but not inaccurately -- as a one-party state: the business party, with two factions called Democrats and Republicans.</p>\\n<p>That is no longer true. The U.S. is still a one-party state, the business party. But it only has one faction: moderate Republicans, now called New Democrats (as the U.S. Congressional coalition styles itself).</p>\\n<p>There is still a Republican organization, but it long ago abandoned any pretense of being a normal parliamentary party. Conservative commentator Norman Ornstein of the American Enterprise Institute describes today's Republicans as \\\"a radical insurgency -- ideologically extreme, scornful of facts and compromise, dismissive of the legitimacy of its political opposition\\\": a serious danger to the society.</p>\\n<p>The party is in lock-step service to the very rich and the corporate sector. Since votes cannot be obtained on that platform, the party has been compelled to mobilize sectors of the society that are extremist by world standards. Crazy is the new norm among Tea Party members and a host of others beyond the mainstream.</p>\\n<p>The Republican establishment and its business sponsors had expected to use them as a battering ram in the neoliberal assault against the population -- to privatize, to deregulate and to limit government, while retaining those parts that serve wealth and power, like the military.</p>\\n<p>The Republican establishment has had some success, but now finds that it can no longer control its base, much to its dismay. The impact on American society thus becomes even more severe. A case in point: the virulent reaction against the Affordable Care Act and the near-shutdown of the government.</p>\\n<p>The Chinese commentator's observation is not entirely novel. In 1999, political analyst Samuel P. Huntington warned that for much of the world, the U.S. is \\\"becoming the rogue superpower,\\\" seen as \\\"the single greatest external threat to their societies.\\\"</p>\\n<p>A few months into the Bush term, Robert Jervis, president of the American Political Science Association, warned that \\\"In the eyes of much of the world, in fact, the prime rogue state today is the United States.\\\" Both Huntington and Jervis warned that such a course is unwise. The consequences for the U.S. could be harmful.</p>\\n<p>In the latest issue of Foreign Affairs, the leading establishment journal, David Kaye reviews one aspect of Washington's departure from the world: rejection of multilateral treaties \\\"as if it were sport.\\\"</p>\\n<p>He explains that some treaties are rejected outright, as when the U.S. Senate \\\"voted against the Convention on the Rights of Persons with Disabilities in 2012 and the Comprehensive Nuclear-Test-Ban Treaty (CTBT) in 1999.\\\"</p>\\n<p>Others are dismissed by inaction, including \\\"such subjects as labor, economic and cultural rights, endangered species, pollution, armed conflict, peacekeeping, nuclear weapons, the law of the sea, and discrimination against women.\\\"</p>\\n<p>Rejection of international obligations \\\"has grown so entrenched,\\\" Kaye writes, \\\"that foreign governments no longer expect Washington's ratification or its full participation in the institutions treaties create. The world is moving on; laws get made elsewhere, with limited (if any) American involvement.\\\"</p>\\n<p>While not new, the practice has indeed become more entrenched in recent years, along with quiet acceptance at home of the doctrine that the U.S. has every right to act as a rogue state.</p>\\n<p>To take a typical example, a few weeks ago U.S. special operations forces snatched a suspect, Abu Anas al-Libi, from the streets of the Libyan capital Tripoli, bringing him to a naval vessel for interrogation without counsel or rights. U.S. Secretary of State John Kerry informed the press that the actions are legal because they comply with American law, eliciting no particular comment.</p>\\n<p>Principles are valid only if they are universal. Reactions would be a bit different, needless to say, if Cuban special forces kidnapped the prominent terrorist Luis Posada Carriles in Miami, bringing him to Cuba for interrogation and trial in accordance with Cuban law.</p>\\n<p>Such actions are restricted to rogue states. More accurately, to the one rogue state that is powerful enough to act with impunity: in recent years, to carry out aggression at will, to terrorize large regions of the world with drone attacks, and much else.</p>\\n<p>And to defy the world in other ways, for example by persisting in its embargo against Cuba despite the long-term opposition of the entire world, apart from Israel, which voted with its protector when the United Nations again condemned the embargo (188-2) in October.</p>\\n<p>Whatever the world may think, U.S. actions are legitimate because we say so. The principle was enunciated by the eminent statesman Dean Acheson in 1962, when he instructed the American Society of International Law that no legal issue arises when the United States responds to a challenge to its \\\"power, position, and prestige.\\\"</p>\\n<p>Cuba committed that crime when it beat back a U.S. invasion and then had the audacity to survive an assault designed to bring \\\"the terrors of the earth\\\" to Cuba, in the words of Kennedy adviser and historian Arthur Schlesinger.</p>\\n<p>When the U.S. gained independence, it sought to join the international community of the day. That is why the Declaration of Independence opens by expressing concern for the \\\"decent respect to the opinions of mankind.\\\"</p>\\n<p>A crucial element was evolution from a disorderly confederacy to a unified \\\"treaty-worthy nation,\\\" in diplomatic historian Eliga H. Gould's phrase, that observed the conventions of the European order. By achieving this status, the new nation also gained the right to act as it wished internally.</p>\\n<p>It could thus proceed to rid itself of the indigenous population and to expand slavery, an institution so \\\"odious\\\" that it could not be tolerated in England, as the distinguished jurist William Murray, Earl of Mansfield, ruled in 1772. Evolving English law was a factor impelling the slave-owning society to escape its reach.</p>\\n<p>Becoming a treaty-worthy nation thus conferred multiple advantages: foreign recognition, and the freedom to act at home without interference. Hegemonic power offers the opportunity to become a rogue state, freely defying international law and norms, while facing increased resistance abroad and contributing to its own decline through self-inflicted wounds.</p>\\n\"\n}",
          "creationDate": 1403674759273,
          "status": "ACTIVE"
        },
        "name": "Extract Article",
        "routeindex": 1,
        "links": {
          "headers": {
            "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/endpoints/53aa6088e4b051a76d241c6b/headers/"
          },
          "routeparameters": {
            "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/endpoints/53aa6088e4b051a76d241c6b/routeparameters/"
          },
          "response": {
            "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/models/53aa6087e4b0a705fcc32cf7"
          },
          "self": {
            "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/endpoints/53aa6088e4b051a76d241c6b"
          },
          "version": {
            "parent": true,
            "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942"
          },
          "parameters": {
            "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/endpoints/53aa6088e4b051a76d241c6b/parameters/"
          },
          "group": {
            "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/groups/53aa6087e4b0f2c97547166a"
          }
        },
        "id": "53aa6088e4b051a76d241c6b",
        "parameters": {
          "took": 30,
          "total": 7,
          "data": [
            {
              "slugifiedPrimary": "content",
              "condition": "OPTIONAL",
              "array": false,
              "name": "content",
              "description": "If set to 0, the extracted content will not be included in the output.",
              "links": {
                "endpoint": {
                  "parent": true,
                  "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/endpoints/53aa6088e4b051a76d241c6b"
                },
                "self": {
                  "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/endpoints/53aa6088e4b051a76d241c6b/parameters/53aa6089e4b051a76d241c6f"
                }
              },
              "id": "53aa6089e4b051a76d241c6f",
              "type": "STRING",
              "creationDate": 1403674761217,
              "value": "1",
              "status": "ACTIVE"
            },
            {
              "slugifiedPrimary": "inputhtml",
              "condition": "OPTIONAL",
              "array": false,
              "name": "inputhtml",
              "description": "If you already have the HTML, you can pass it here. We will not make any HTTP requests for the content if this parameter is used. Note: The input HTML should be UTF-8 encoded. And you will still need to give us the URL associated with the content (the URL may determine how the content is extracted, if we have extraction rules associated with it).",
              "links": {
                "endpoint": {
                  "parent": true,
                  "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/endpoints/53aa6088e4b051a76d241c6b"
                },
                "self": {
                  "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/endpoints/53aa6088e4b051a76d241c6b/parameters/53aa6088e4b051a76d241c6d"
                }
              },
              "id": "53aa6088e4b051a76d241c6d",
              "type": "STRING",
              "creationDate": 1403674760818,
              "value": "<html><head><title>Example</title><body><article itemprop=\"articleBody\"><p>Test</p></article></body></html>",
              "status": "ACTIVE"
            },
            {
              "slugifiedPrimary": "lang",
              "condition": "OPTIONAL",
              "array": false,
              "name": "lang",
              "description": "Language detection. If you'd like Full-Text RSS to find the language of the articles it processes, you can use one of the following values: 0 - Ignore language; 1 - Use article metadata (e.g. HTML lang attribute) (default value); 2 - As above, but guess the language if it's not specified; 3 - Always guess the language, whether it's specified or not.",
              "links": {
                "endpoint": {
                  "parent": true,
                  "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/endpoints/53aa6088e4b051a76d241c6b"
                },
                "self": {
                  "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/endpoints/53aa6088e4b051a76d241c6b/parameters/53aa6089e4b00287471a2c2c"
                }
              },
              "id": "53aa6089e4b00287471a2c2c",
              "type": "STRING",
              "creationDate": 1403674761032,
              "value": "2",
              "status": "ACTIVE"
            },
            {
              "slugifiedPrimary": "links",
              "condition": "OPTIONAL",
              "array": false,
              "name": "links",
              "description": "Links can either be preserved (default), made into footnotes, or removed. None of these options affect the link text, only the hyperlink itself. Valid values: 'preserve', 'remove', 'footnotes'.",
              "links": {
                "endpoint": {
                  "parent": true,
                  "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/endpoints/53aa6088e4b051a76d241c6b"
                },
                "self": {
                  "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/endpoints/53aa6088e4b051a76d241c6b/parameters/53aa6089e4b0a705fcc32cfd"
                }
              },
              "id": "53aa6089e4b0a705fcc32cfd",
              "type": "STRING",
              "creationDate": 1403674761318,
              "value": "remove",
              "status": "ACTIVE"
            },
            {
              "slugifiedPrimary": "parser",
              "condition": "OPTIONAL",
              "array": false,
              "name": "parser",
              "description": "The default parser is libxml as it's the fastest. HTML5-PHP is an HTML5 parser implemented in PHP. It's slower than libxml, but can often produce better results. Site-specific rules may invoke HTML5-PHP parsing to ensure all URLs for the site get parsed with it. Use this parameter to explicitly request HTML5-PHP or libxml parsing.",
              "links": {
                "endpoint": {
                  "parent": true,
                  "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/endpoints/53aa6088e4b051a76d241c6b"
                },
                "self": {
                  "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/endpoints/53aa6088e4b051a76d241c6b/parameters/53aa6089e4b00287471a2c2d"
                }
              },
              "id": "53aa6089e4b00287471a2c2d",
              "type": "STRING",
              "creationDate": 1403674761132,
              "value": "libxml",
              "status": "ACTIVE"
            },
            {
              "slugifiedPrimary": "url",
              "condition": "REQUIRED",
              "array": false,
              "name": "url",
              "description": "The URL to extract content from. It should point to a standard HTML page. You can omit the 'http://' prefix if you like.",
              "links": {
                "endpoint": {
                  "parent": true,
                  "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/endpoints/53aa6088e4b051a76d241c6b"
                },
                "self": {
                  "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/endpoints/53aa6088e4b051a76d241c6b/parameters/53aa6088e4b051a76d241c6c"
                }
              },
              "id": "53aa6088e4b051a76d241c6c",
              "type": "STRING",
              "creationDate": 1403674760719,
              "value": "chomsky.info/articles/20131105.htm",
              "status": "ACTIVE"
            },
            {
              "slugifiedPrimary": "xss",
              "condition": "OPTIONAL",
              "array": false,
              "name": "xss",
              "description": "Use this to enable/disable XSS filtering. It is enabled by default, but if your application/framework/CMS already filters HTML for XSS vulnerabilities, you can disable XSS filtering here. Note: when enabled this will remove certain elements you may want to preserve, such as iframes.",
              "links": {
                "endpoint": {
                  "parent": true,
                  "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/endpoints/53aa6088e4b051a76d241c6b"
                },
                "self": {
                  "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/endpoints/53aa6088e4b051a76d241c6b/parameters/53aa6088e4b051a76d241c6e"
                }
              },
              "id": "53aa6088e4b051a76d241c6e",
              "type": "STRING",
              "creationDate": 1403674760919,
              "value": "1",
              "status": "ACTIVE"
            }
          ]
        },
        "status": "ACTIVE",
        "group": {
          "slugifiedPrimary": "1-article-extraction",
          "took": 11,
          "name": "1. Article Extraction",
          "index": 0,
          "links": {
            "self": {
              "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/groups/53aa6087e4b0f2c97547166a"
            },
            "version": {
              "parent": true,
              "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942"
            }
          },
          "id": "53aa6087e4b0f2c97547166a",
          "creationDate": 1403674759458,
          "status": "ACTIVE"
        }
      }
    ]
  },
  "visibility": "PUBLIC",
  "description": "Full-Text RSS can extract article content from a web page and transform partial web feeds into full-text feeds.\r\n\r\nGet results in RSS or JSON.\r\n\r\nYou can use our hosted service via Mashape (test for free) and you can also visit our site to buy our self-hosted version.",
  "groups": {
    "took": 49,
    "total": 2,
    "data": [
      {
        "slugifiedPrimary": "1-article-extraction",
        "name": "1. Article Extraction",
        "index": 0,
        "links": {
          "self": {
            "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/groups/53aa6087e4b0f2c97547166a"
          },
          "version": {
            "parent": true,
            "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942"
          }
        },
        "id": "53aa6087e4b0f2c97547166a",
        "creationDate": 1403674759458,
        "status": "ACTIVE"
      },
      {
        "slugifiedPrimary": "2-feed-conversion",
        "name": "2. Feed Conversion",
        "index": 1,
        "links": {
          "self": {
            "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/groups/53aa6087e4b0a705fcc32cf8"
          },
          "version": {
            "parent": true,
            "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942"
          }
        },
        "id": "53aa6087e4b0a705fcc32cf8",
        "creationDate": 1403674759512,
        "status": "ACTIVE"
      }
    ]
  },
  "creationDate": "Wed Jun 25 05:39:18 UTC 2014",
  "slugifiedPrimary": "v1",
  "haslogo": true,
  "current": true,
  "name": "v1",
  "links": {
    "models": {
      "total": 3,
      "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/models/"
    },
    "astronode": {
      "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/astronode"
    },
    "endpoints": {
      "total": 2,
      "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/endpoints/"
    },
    "changelogs": {
      "total": 0,
      "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/changelogs/"
    },
    "objects": {
      "total": 1,
      "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/objects/"
    },
    "groups": {
      "total": 2,
      "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/groups/"
    },
    "issues": {
      "total": 2,
      "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/issues/"
    },
    "tags": {
      "total": 2,
      "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/tags/"
    },
    "features": {
      "total": 0,
      "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/features/"
    },
    "plans": {
      "total": 2,
      "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/plans/"
    },
    "self": {
      "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942"
    },
    "tos": {
      "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/tos"
    },
    "api": {
      "parent": true,
      "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665"
    },
    "wikis": {
      "total": 1,
      "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/wikis/"
    },
    "errors": {
      "total": 0,
      "href": "https://market.mashape.com/api/middleware/accounts/53aa2cb0e4b008bb2ef81c3b/apis/53aa6086e4b0f2c975471665/versions/53aa6086e4b008bb2ef87942/errors/"
    }
  },
  "id": "53aa6086e4b008bb2ef87942",
  "status": "ACTIVE"
}