{
  "models": {
    "took": 522,
    "total": 6,
    "data": [
      {
        "slugifiedPrimary": "html-classification-model",
        "headers": {
          "took": 165,
          "total": 8,
          "data": [
            {
              "slugifiedPrimary": "access-control-allow-headers",
              "condition": "OPTIONAL",
              "name": "Access-Control-Allow-Headers",
              "description": "",
              "links": {
                "self": {
                  "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/573b33ade4b0106cac87e58c/headers/573b33ade4b0f0cd8cead3a2"
                },
                "model": {
                  "parent": true,
                  "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/573b33ade4b0106cac87e58c"
                }
              },
              "id": "573b33ade4b0f0cd8cead3a2",
              "type": "STRING",
              "creationDate": 1463497645957,
              "value": "Accept-Language, Origin, Accept-Encoding, Authorization, Content-Type, X-Requested-With, Accept, X-CSRFToken, User-Agent, X-WizeScan-Version, X-WizeNote-Version",
              "status": "ACTIVE"
            },
            {
              "slugifiedPrimary": "access-control-allow-methods",
              "condition": "OPTIONAL",
              "name": "Access-Control-Allow-Methods",
              "description": "",
              "links": {
                "self": {
                  "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/573b33ade4b0106cac87e58c/headers/573b33ade4b0106cac87e58d"
                },
                "model": {
                  "parent": true,
                  "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/573b33ade4b0106cac87e58c"
                }
              },
              "id": "573b33ade4b0106cac87e58d",
              "type": "STRING",
              "creationDate": 1463497645984,
              "value": "GET, POST, PUT, DELETE, OPTIONS",
              "status": "ACTIVE"
            },
            {
              "slugifiedPrimary": "cache-control",
              "condition": "OPTIONAL",
              "name": "Cache-Control",
              "description": "",
              "links": {
                "self": {
                  "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/573b33ade4b0106cac87e58c/headers/573b33aee4b002251bb1bc58"
                },
                "model": {
                  "parent": true,
                  "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/573b33ade4b0106cac87e58c"
                }
              },
              "id": "573b33aee4b002251bb1bc58",
              "type": "STRING",
              "creationDate": 1463497646010,
              "value": "no-cache=\"set-cookie\"",
              "status": "ACTIVE"
            },
            {
              "slugifiedPrimary": "connection",
              "condition": "OPTIONAL",
              "name": "Connection",
              "description": "",
              "links": {
                "self": {
                  "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/573b33ade4b0106cac87e58c/headers/573b33aee4b0d4681d33c148"
                },
                "model": {
                  "parent": true,
                  "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/573b33ade4b0106cac87e58c"
                }
              },
              "id": "573b33aee4b0d4681d33c148",
              "type": "STRING",
              "creationDate": 1463497646081,
              "value": "keep-alive",
              "status": "ACTIVE"
            },
            {
              "slugifiedPrimary": "content-type",
              "condition": "OPTIONAL",
              "name": "Content-Type",
              "description": "",
              "links": {
                "self": {
                  "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/573b33ade4b0106cac87e58c/headers/573b33aee4b0a49fce9d3ca4"
                },
                "model": {
                  "parent": true,
                  "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/573b33ade4b0106cac87e58c"
                }
              },
              "id": "573b33aee4b0a49fce9d3ca4",
              "type": "STRING",
              "creationDate": 1463497646098,
              "value": "application/json;charset=UTF-8",
              "status": "ACTIVE"
            },
            {
              "slugifiedPrimary": "date",
              "condition": "OPTIONAL",
              "name": "Date",
              "description": "",
              "links": {
                "self": {
                  "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/573b33ade4b0106cac87e58c/headers/573b33aee4b0a49fce9d3ca5"
                },
                "model": {
                  "parent": true,
                  "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/573b33ade4b0106cac87e58c"
                }
              },
              "id": "573b33aee4b0a49fce9d3ca5",
              "type": "STRING",
              "creationDate": 1463497646323,
              "value": "Tue, 17 May 2016 15:07:20 GMT",
              "status": "ACTIVE"
            },
            {
              "slugifiedPrimary": "server",
              "condition": "OPTIONAL",
              "name": "Server",
              "description": "",
              "links": {
                "self": {
                  "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/573b33ade4b0106cac87e58c/headers/573b33aee4b0faa3d71287e2"
                },
                "model": {
                  "parent": true,
                  "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/573b33ade4b0106cac87e58c"
                }
              },
              "id": "573b33aee4b0faa3d71287e2",
              "type": "STRING",
              "creationDate": 1463497646327,
              "value": "Mashape/5.0.6",
              "status": "ACTIVE"
            },
            {
              "slugifiedPrimary": "transfer-encoding",
              "condition": "OPTIONAL",
              "name": "Transfer-Encoding",
              "description": "",
              "links": {
                "self": {
                  "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/573b33ade4b0106cac87e58c/headers/573b33aee4b0bd4a7a7380f1"
                },
                "model": {
                  "parent": true,
                  "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/573b33ade4b0106cac87e58c"
                }
              },
              "id": "573b33aee4b0bd4a7a7380f1",
              "type": "STRING",
              "creationDate": 1463497646378,
              "value": "chunked",
              "status": "ACTIVE"
            }
          ]
        },
        "updateDate": 1465562536829,
        "format": "JSON",
        "name": "HTML Classification model",
        "description": "The audience field describes the reading level of the text on the WizeNoze 5 level scale. In the fullText field the result of the HTML content extraction is returned. The language of the document is in the languageCode field.",
        "links": {
          "headers": {
            "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/573b33ade4b0106cac87e58c/headers/"
          },
          "self": {
            "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/573b33ade4b0106cac87e58c"
          },
          "version": {
            "parent": true,
            "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c"
          }
        },
        "id": "573b33ade4b0106cac87e58c",
        "body": "{\n  \"audience\" : {\n    \"id\" : 32,\n    \"label\" : \"EN4\",\n    \"name\" : \"Reading level 4\",\n    \"description\" : \"Reading level 4\",\n    \"level\" : 4\n  },\n  \"fullText\" : \"In-Suite Navigation\\n [DRAFT] How People with Disabilities Use the Web\\nIntroduction\\nThis page explores the wide range of diversity of people and abilities, and highlights some of the types of web accessibility barriers that people commonly encounter from poorly designed websites and web tools.\\nNote: This page is illustrative and is not intended to be an exhaustive listing of all disabilities and barriers.\\nOn this page\\nDiversity of abilities\\nThere are many reasons why people may be experiencing varying degrees of auditory, cognitive, neurological, physical, speech, and visual disabilities. For instance, some may have disabilities from birth, an illness, disease, or accident, or they may develop impairments with age. Some may not consider themselves to have disabilities even if they do experience such functional limitations.\\nMore about diversity of abilities\\nexpand this section\\ncollapse this section\\nEach individual is unique. People have diverse abilities, skills, tools, preferences, and expectations that can impact how they use the Web. For instance, consider the following aspects:\\nAge-related impairments: Many people develop age-related impairments. While they share the same functional requirements as others with disabilities, sometimes there are significant differences in the use of assistive technologies, the level of computer skills, or in the use of the Web in general.\\nMultiple disabilities: Some people have combinations of different kinds of disabilities, which may limit their approaches for interacting with the Web. For instance, someone who is deaf and has low vision might benefit from captions for audio, but only if these captions have adjustable size and color.\\nHealth conditions: Some people have health conditions that may affect their stamina, dexterity, or concentration. For instance, some may experience fatigue, pain, or other symptoms that could affect their physical use of the computer or limit the duration or extent of their use of the Web.\\nChanging abilities: Some people may be experiencing progressive or recurring functional limitations that impact their use of the Web differently at different times. For instance, some may need particular accessibility features on one day, and others or none on another day, depending on their condition.\\nTemporary impairments: Some people may be experiencing temporary impairments such as those that may occur due to an accident, surgery, or medication. They may not know about accessibility solutions, may not know how to use accessibility features, and may be unaware of their own needs.\\nSituational limitations: Some people may be experiencing constraints due to their surrounding or due to other situational aspects. For instance, they may be in a loud environment and unable to hear audio, in bright sunlight and unable to see a screen, or they may not be able to afford some technologies.\\nWebsites and web tools that are designed for people with a broad range of abilities benefit everyone, including people without disabilities. It is therefore important to consider the broad diversity of functional needs rather than to categorize people according to medical classifications.\\nAuditory\\nAuditory disabilities range from mild or moderate hearing impairments in one or both ears (\\\"hard of hearing\\\"), to substantial and uncorrectable impairment of hearing in both ears (\\\"deafness\\\"). Some people with auditory disabilities can hear sounds but sometimes not sufficiently to understand all speech, especially when there is background noise. This includes people using hearing aids or other approaches to improve the sound.\\nMore about auditory disabilities\\nexpand this section\\ncollapse this section\\nWhile the rapid increase of multimedia on the Web provides many new opportunities for people with auditory disabilities, it also poses challenges when content is not designed to be accessible. For instance, while video content can be used to communicate information visually, audio content needs to have alternatives, such as transcripts and captions, so that it is accessible for people with auditory disabilities.\\nTo use the Web effectively, people with auditory disabilities need:\\nTranscripts and captions of audio content, including audio-only content and audio tracks in multimedia\\nMedia players that display captions and provide options to adjust the text size and colors of captions\\nOptions to stop, pause, or adjust the volume of audio content (independently of the system volume)\\nHigh-quality foreground audio that is clearly distinguishable from any background noise\\nFor some people with auditory disabilities, sign language is the first language and they may not read a written language fluently. Providing important information in sign language and using simpler text that is supplemented by images, graphs, and other illustrations help make web content more understandable to many. However, it is important to remember that not all people with auditory disabilities know sign language.\\nCognitive and neurological\\nCognitive and neurological disabilities involve disorders of any part of the nervous system, including the brain and the peripheral nervous system. This can impact how well people hear, move, see, speak, and understand information. Cognitive and neurological disabilities do not necessarily affect the intelligence of a person.\\nMore about cognitive and neurological disabilities\\nexpand this section\\ncollapse this section\\nComputer technologies and the Web provide many opportunities for people with cognitive and neurological disabilities to interact with content and to process information in ways that are more usable to them. For instance, people can navigate web content using different strategies, access information in text, audio, or other formats, and change the presentation of the content according to their individual needs or preferences.\\nDepending on the particular needs of an individual, people with cognitive and neurological disabilities need:\\nClearly structured content that facilitates overview and orientation\\nConsistent labeling of forms, buttons, and other content parts\\nPredictable link targets, functionality, and overall behavior\\nDifferent ways of navigating websites, such as through a hierarchical menu or search option\\nSimpler text that is supplemented by images, graphs, and other illustrations\\nPeople with cognitive and neurological disabilities use different types of web browsing methods, depending on their particular needs. For instance, some people use text-to-speech software to hear the information while reading it visually, or use captions to read the information while hearing it. Some people use tools that resize text and spacing, and customize colors to assist reading, and grammar and spelling tools to assist writing. For these web browsing methods to work, developers need to consider web accessibility requirements which are often shared by people with hearing, physical, speech, or visual disabilities.\\nMore about physical disabilities\\nexpand this section\\ncollapse this section\\nTo use the Web, people with physical disabilities often use specialized hardware and software such as:\\nErgonomic or specially designed keyboard or mouse\\nHead pointer, mouth stick, and other aids to help typing\\nOn-screen keyboard with trackball, joystick, and switches to operate it\\nVoice recognition, eye tracking, and other approaches for hands-free interaction\\nPeople with physical disabilities may be using a mouse or mouse-like device only, or keyboard or keyboard-like device only to operate the computer. People with physical disabilities need full keyboard support for all functionality provided on a web page. They may need more time to type, click, or carry out other interaction, and they may type single keystrokes in sequence rather than typing simultaneous keystrokes (\\\"chording\\\") to activate commands. This includes commands for special characters, shortcut keys, or to active menu items.\\nPeople with physical disabilities often have trouble clicking small areas and are more likely to make mistakes in typing or clicking. Providing large clickable areas, enough time to complete tasks, and error correction options for forms are important design aspects. Other important design aspects include providing visible indicators of the current focus, and mechanisms to skip over blocks, such as over page headers or navigation bars. Many of these requirements are shared by people with cognitive, neurological, and visual disabilities.\\nRheumatism - typically refers to arthritis and other causes for bone or joint pain, and sometimes to fibromyalgia and other causes for muscular and other soft tissue pain\\nReduced dexterity - is a functional term (rather than a medical condition) that describes the ability to control the hand, such as hand-eye coordination of people with cognitive and neurological disabilities\\nMuscular dystrophy - progressive weakness and degeneration of muscles, including in arms and hands\\nSpeech\\nSpeech disabilities include difficulty producing speech that is recognizable by others or by voice recognition software. For instance, the loudness or clarity of someone's voice might be difficult to understand.\\nMore about speech disabilities\\nexpand this section\\ncollapse this section\\nPeople with speech disabilities encounter barriers with voice-based services, such as automated web-based hotlines and web applications that are operated using voice commands. To use services that rely on voice, people with speech disabilities need alternative modes for interaction such as a text-based chat to interact with hotline representatives or keyboard commands to operate web applications. Also, websites that provide telephone numbers as the only means of communicating with an organizations pose barriers for people with speech disabilities. Alternative means of communication include e-mail and feedback forms.\\nExamples of speech disabilities\\nexpand this section\\ncollapse this section\\nApraxia of speech (AOS) - includes inconsistent articulation and production of speech sounds, and errors producing sounds in the correct order so that spoken words or phrases become difficult to understand.\\nCluttering (also called \\\"tachyphemia\\\") - includes increased speaking rate, incorrect rhythm, intonation, and co-articulation of sounds, and other influency in speech that is sometimes similar to stuttering.\\nDysarthria - involves weakness or complete paralysis of muscles that are necessary to produce speech, including lips, lungs, throat, tongue, and others.\\nSpeech sound disorder - involves difficulty or inability to produce certain sounds or patterns of sound and sometimes results in addition, distortion, omission, or substitution of such sounds with others.\\nStuttering - includes influency in speech, repetition of individual sounds or entire words and phrases, and misplacement or prolongation of pauses and sounds during speech that is different from cluttering.\\nMuteness (also called \\\"mutism\\\") - involves inability to speak due to different reasons such as anxiety, brain injuries, or inability to hear and learn speech.\\ncollapse this section\\nVisual\\nVisual disabilities range from mild or moderate vision impairments in one or both eyes (\\\"low vision\\\" or \\\"partial sight\\\"), to substantial and uncorrectable loss of vision in both eyes (\\\"blindness\\\"). Some people have reduced or lack of sensitivity to certain colors (\\\"color blindness\\\"), or increased sensitivity towards excessive brightness in colors. These variations in perception of colors and brightness can be independent of the visual acuity.\\nMore about visual disabilities\\nexpand this section\\ncollapse this section\\nPeople with visual disabilities typically rely on changing the presentation of web content into forms that are more usable for their particular needs. For example by:\\nEnlarging or reducing text size and images\\nCustomizing settings for fonts, colors, and spacing\\nListening to text-to-speech synthesis of the content\\nListening to audio descriptions of video in multimedia\\nReading text using refreshable braille (small dots that are raised and lowered to display characters that are read by scanning over the raised dots using the fingertips)\\nFor these web browsing methods to work, developers need to ensure that the presentation of web content is independent of its underlying structure, and that the structure is correctly coded so that it can processed by software and presented in different ways. For instance, some people do not see the content and need lists, headings, tables, and other page structures to be properly coded so that they can be identified by software.\\nSome people are only seeing small portions of the content at a time or are perceiving the colors and design differently. Some people are using customized fonts, colors, and spacing to make the content more readable, or they are navigating through the content using keyboard only because they cannot see the mouse-pointer. An accessible design supports different presentations of the web content, and different ways for interaction.\\nExamples of visual disabilities\\nexpand this section\\ncollapse this section\\nColor blindness - includes difficulty distinguishing between colors such as between red and green, or between yellow and blue, and sometimes inability to perceive any color\\nLow vision - includes poor acuity (vision that is not sharp), tunnel vision (seeing only the middle of the visual field), central field loss (seeing only the edges of the visual field), and clouded vision\\nEditors' Draft: 1 August 2012This document is an in-progress draft. If you quote anything from this draft, clearly indicate that it is draft wording.References to this material must include the draft status, for example:\",\n  \"languageCode\" : \"en\"\n}",
        "creationDate": 1463497645019,
        "status": "ACTIVE"
      },
      {
        "slugifiedPrimary": "htmlrequest",
        "headers": {
          "took": 17,
          "total": 0,
          "data": []
        },
        "updateDate": 1466588129837,
        "name": "HTMLRequest",
        "format": "JSON",
        "description": "HTML request for classification, containing the html to be classified and a languageCode (either 'en' for English or 'nl' for Dutch). When the languageCode is not provided the API tries to determine it automatically.",
        "links": {
          "headers": {
            "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/573b329ee4b0f0cd8cead39e/headers/"
          },
          "self": {
            "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/573b329ee4b0f0cd8cead39e"
          },
          "version": {
            "parent": true,
            "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c"
          }
        },
        "id": "573b329ee4b0f0cd8cead39e",
        "body": "{\n    \"languageCode\":\"en\",\n    \"html\":\"<!--?xml version=\\\"1.0\\\" encoding=\\\"utf-8\\\"?--><!DOCTYPE html PUBLIC \\\"-//W3C//DTD XHTML 1.0 Transitional//EN\\\" \\\"http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd\\\">\\n<html xmlns=\\\"http://www.w3.org/1999/xhtml\\\" xml:lang=\\\"en-US\\\" lang=\\\"en-US\\\"><head>\\n  <meta http-equiv=\\\"Content-Type\\\" content=\\\"text/html; charset=utf-8\\\">\\n  <title>Diversity of Web Users - How People with Disabilities Use the Web</title>\\n  <link rel=\\\"stylesheet\\\" href=\\\"http://www.w3.org/WAI/wai-main.css\\\" type=\\\"text/css\\\">\\n  <link rel=\\\"stylesheet\\\" href=\\\"http://www.w3.org/WAI/style/hMenu.css\\\" type=\\\"text/css\\\">\\n  <!--[if lte IE 7]><link href=\\\"http://www.w3.org/WAI/style/hMenuIE7.css\\\" rel=\\\"stylesheet\\\" type=\\\"text/css\\\" /><![endif]-->\\n  <link href=\\\"http://www.w3.org/WAI/style/excol.css\\\" rel=\\\"stylesheet\\\" type=\\\"text/css\\\">\\n  <script type=\\\"text/javascript\\\" src=\\\"http://www.w3.org/WAI/scripts/excol/excol.js\\\" xml:space=\\\"preserve\\\"></script><link rel=\\\"stylesheet\\\" type=\\\"text/css\\\" href=\\\"/WAI/scripts/excol/accordionInit.css\\\"><script type=\\\"text/javascript\\\" src=\\\"/WAI/scripts/excol/jquery-1.7.1.min.js\\\"></script><script type=\\\"text/javascript\\\" src=\\\"/WAI/scripts/excol/jquery.metools.min.js\\\"></script><script type=\\\"text/javascript\\\" src=\\\"/WAI/scripts/excol/jquery.ba-hashchange.min.js\\\"></script><script type=\\\"text/javascript\\\" src=\\\"/WAI/scripts/excol/jquery.mewidget.hashcontrol.min.js\\\"></script><script type=\\\"text/javascript\\\" src=\\\"/WAI/scripts/excol/jquery.mewidget.panel.min.js\\\"></script><script type=\\\"text/javascript\\\" src=\\\"/WAI/scripts/excol/jquery.mewidget.panelwrapper.min.js\\\"></script><script type=\\\"text/javascript\\\" src=\\\"/WAI/scripts/excol/jquery.mewidget.accordion.min.js\\\"></script>\\n<style type=\\\"text/css\\\" xml:space=\\\"preserve\\\">\\n<!--\\n.highlight-version {\\n  border: solid 1px #630;\\n  color: #630;\\n  background-color: #FFC;\\n  padding: 0.5em;\\n  font-weight: normal;\\n  margin-top: 1em; margin-bottom: 1.5em;\\n  font-size:85%;\\n}\\n.highlight-version blockquote {line-height:100%; margin-top: 0; margin-bottom: 0; padding-top: 0; padding-bottom: 0;}\\n.highlight-version p {margin-top: 0; margin-bottom: 0; padding-top: 0; padding-bottom: 0;}\\n\\nh2.toc { border: 0em; color: #000000; margin-bottom: 0em; }\\nul.toc { list-style: none; margin-left: 1.5em; margin-top: 0.5em; padding: 0em; }\\nul.toc a {  background: url(http://www.w3.org/Icons/downinpage.png) left no-repeat; color: #930; font-weight: bold; padding-left: 1.5em; }\\np.totop { display: block; text-align: right; }\\np.totop a { background: url(http://www.w3.org/Icons/topofpage.png) left no-repeat; padding-left: 1em; }\\np.catchy { border-left: solid 1px #930; padding-left: 1em; }\\n.subhead { font-size: 0.75em; display: block; }\\n-->\\n</style>\\n<link type=\\\"text/css\\\" href=\\\"/WAI/scripts/excol/accordionLoaded.css?anticache=316682\\\" rel=\\\"stylesheet\\\"></head>\\n<body>\\n\\n<div id=\\\"controls\\\"><ul>\\n      <li><a href=\\\"#skip\\\" shape=\\\"rect\\\"><img src=\\\"/Icons/downinpage.png\\\" alt=\\\"\\\"> Skip to Content </a></li>\\n      <li><a href=\\\"/WAI/changedesign.html\\\" shape=\\\"rect\\\"> | Change \\n         text size or colors </a> </li>\\n   </ul></div>\\n\\n<div id=\\\"masthead\\\"><p id=\\\"logos\\\"><a href=\\\"http://www.w3.org/\\\" title=\\\"W3C Home\\\" shape=\\\"rect\\\"><img alt=\\\"W3C logo\\\" src=\\\"/Icons/w3c_home\\\"></a><a href=\\\"http://www.w3.org/WAI/\\\" title=\\\"WAI Home\\\" shape=\\\"rect\\\"><img alt=\\\"Web Accessibility initiative\\\" src=\\\"/WAI/images/wai-temp\\\"></a></p></div>\\n\\n<div id=\\\"tagline\\\"><p>WAI: Strategies, guidelines, resources to make the\\n      Web accessible to people with disabilities</p></div>\\n\\n<div id=\\\"nav\\\"><h2>Site Navigation</h2><p id=\\\"w3cnav\\\"><a href=\\\"http://www.w3.org/\\\">W3C Home</a></p><p id=\\\"subhomenav\\\"><a href=\\\"/WAI/\\\">Web Accessibility Initiative (WAI) Home</a></p><ol id=\\\"nav1\\\" type=\\\"A\\\"><li><a href=\\\"../../gettingstarted/Overview.html\\\" shape=\\\"rect\\\">Getting Started</a></li><li class=\\\"current-nav \\\"><a href=\\\"../../users/Overview.html\\\" shape=\\\"rect\\\">Designing for Inclusion</a><ol type=\\\"1\\\"><li class=\\\"current-nav \\\"><a href=\\\"Overview.html\\\" shape=\\\"rect\\\"> How People with Disabilities Use the Web</a><ol type=\\\"i\\\"><li><a href=\\\"stories.html\\\" shape=\\\"rect\\\">Stories of Web Users</a></li><li id=\\\"current-node\\\" class=\\\"current-nav \\\"><span class=\\\"label\\\"><span id=\\\"current-icon\\\">»</span>Diversity of Web Users</span></li><li><a href=\\\"browsing.html\\\" shape=\\\"rect\\\">Diversity in Web Use</a></li><li><a href=\\\"principles.html\\\" shape=\\\"rect\\\">Accessibility Principles</a></li></ol></li><li><a href=\\\"../../older-users/Overview.php\\\" shape=\\\"rect\\\">Web and Older Users</a></li><li><a href=\\\"../../mobile/Overview.html\\\" shape=\\\"rect\\\">Mobile</a></li></ol></li><li><a href=\\\"../../guid-tech.html\\\" shape=\\\"rect\\\">Guidelines &amp; \\n            Techniques</a></li><li><a href=\\\"../../managing.html\\\" shape=\\\"rect\\\">Planning &amp; Implementing</a></li><li><a href=\\\"../../eval/Overview.html\\\" shape=\\\"rect\\\">Evaluating Accessibility</a></li><li><a href=\\\"../../train.html\\\" shape=\\\"rect\\\">Presentations &amp; Tutorials</a></li><li><a href=\\\"../../about-links.html\\\" shape=\\\"rect\\\">Getting Involved with WAI</a></li></ol><div id=\\\"nav-static\\\"><div class=\\\"nav-discover\\\">\\n         <p><a href=\\\"http://www.w3.org/WAI/yourWAI\\\" shape=\\\"rect\\\"><strong><u>Discover new resources</u></strong> for people with disabilities, policy makers, managers, and you!</a></p>\\n      </div><p class=\\\"translations\\\"><a href=\\\"http://www.w3.org/WAI/wai-translations\\\" shape=\\\"rect\\\"><img src=\\\"http://www.w3.org/WAI/images/translations-med-1\\\" alt=\\\"characters from different languages\\\"> Translations</a></p></div></div>\\n\\n<div id=\\\"main\\\">\\n  <h2 class=\\\"no-display\\\">In-Suite Navigation</h2>\\n  <ul class=\\\"hmenu5\\\">\\n    <li><a href=\\\"Overview\\\" shape=\\\"rect\\\">Over­view</a></li>\\n    <li><a href=\\\"stories\\\" shape=\\\"rect\\\">Sto­ries of Web Users</a></li>\\n    <li class=\\\"hmenuselection\\\"><a shape=\\\"rect\\\">Di­ver­sity of Web Users</a></li>\\n    <li><a href=\\\"browsing\\\" shape=\\\"rect\\\">Di­ver­sity in Web Use</a></li>\\n    <li><a href=\\\"principles\\\" shape=\\\"rect\\\">Ac­ces­si­bil­ity Prin­ci­ples</a></li>\\n  </ul>\\n\\n  <h1>Diversity of Web Users <span class=\\\"subhead\\\"><br clear=\\\"none\\\">[DRAFT] How People with Disabilities Use the Web</span></h1>\\n  <h2 class=\\\"no-display\\\"><a name=\\\"introduction\\\" id=\\\"introduction\\\" shape=\\\"rect\\\">Introduction</a></h2>\\n  <p>This page explores the wide range of diversity of people and abilities, and highlights some of the types of web accessibility barriers that people commonly encounter from poorly designed websites and web tools.</p>\\n  <p><strong>Note:</strong> This page is illustrative and is not intended to be an exhaustive listing of all disabilities and barriers.</p>\\n\\n  <h2 class=\\\"toc\\\"><a name=\\\"toc\\\" id=\\\"toc\\\" shape=\\\"rect\\\">On this page</a></h2>\\n  <ul class=\\\"toc\\\">\\n    <li><a href=\\\"#diversity\\\" shape=\\\"rect\\\">Diversity of abilities</a></li>\\n    <li><a href=\\\"#auditory\\\" shape=\\\"rect\\\">Auditory</a></li>\\n    <li><a href=\\\"#cognitive\\\" shape=\\\"rect\\\">Cognitive and neurological</a></li>\\n    <li><a href=\\\"#physical\\\" shape=\\\"rect\\\">Physical</a></li>\\n    <li><a href=\\\"#speech\\\" shape=\\\"rect\\\">Speech</a></li>\\n    <li><a href=\\\"#visual\\\" shape=\\\"rect\\\">Visual</a></li>\\n  </ul>\\n\\n  <div class=\\\"applicationNaviWrapper\\\">\\n    <div class=\\\"f_controls_accordion f_fileToLoad_accordionControls\\\"><p>\\n<button class=\\\"xk_button_all f_controlsExpand\\\" value=\\\"expand all sections\\\" type=\\\"button\\\">\\n    <img class=\\\"xk_icon\\\" src=\\\"/WAI/images/excol/plus.png\\\" alt=\\\"\\\">\\n    \\n    expand all sections\\n</button>\\n<button class=\\\"xk_button_all f_controlsCollapse\\\" value=\\\"collapse all sections\\\" type=\\\"button\\\" disabled=\\\"disabled\\\">\\n    <img class=\\\"xk_icon\\\" src=\\\"/WAI/images/excol/minus_dis.png\\\" alt=\\\"\\\">\\n    \\n    collapse all sections\\n</button>\\n</p>\\n</div>\\n    <div id=\\\"accordion\\\" class=\\\"accordionWrapper\\\">\\n\\n  <h2><a name=\\\"diversity\\\" id=\\\"diversity\\\" shape=\\\"rect\\\">Diversity of abilities</a></h2>\\n  <p>There are many reasons why people may be experiencing varying degrees of auditory, cognitive, neurological, physical, speech, and visual disabilities. For instance, some may have disabilities from birth, an illness, disease, or accident, or they may develop impairments with age. Some may not consider themselves to have disabilities even if they do experience such functional limitations.</p>\\n  <h3 class=\\\"f_panelHead\\\" style=\\\"cursor: pointer;\\\">More about diversity of abilities<span class=\\\"f_expanderWrapper\\\">\\n    <button class=\\\"f_expand xk_button\\\" value=\\\"expand this section\\\" type=\\\"button\\\" style=\\\"display: inline-block;\\\">\\n        <img alt=\\\"expand this section\\\" src=\\\"/WAI/images/excol/plus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n    <button class=\\\"f_collapse xk_button\\\" value=\\\"collapse this section\\\" type=\\\"button\\\" style=\\\"display: none;\\\">\\n        <img alt=\\\"collapse this section\\\" src=\\\"/WAI/images/excol/minus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n</span>\\n</h3>\\n  <div style=\\\"display: none;\\\">\\n    <p>Each individual is unique. People have diverse abilities, skills, tools, preferences, and expectations that can impact how they use the Web. For instance, consider the following aspects:</p>\\n    <ul class=\\\"listspaced\\\">\\n      <li><strong><a name=\\\"ageing\\\" id=\\\"ageing\\\" shape=\\\"rect\\\">Age-related impairments:</a></strong> Many people develop age-related impairments. While they share the same functional requirements as others with disabilities, sometimes there are significant differences in the use of assistive technologies, the level of computer skills, or in the use of the Web in general.</li>\\n      <li><strong><a name=\\\"combined\\\" id=\\\"combined\\\" shape=\\\"rect\\\">Multiple disabilities:</a></strong> Some people have combinations of different kinds of disabilities, which may limit their approaches for interacting with the Web. For instance, someone who is deaf and has low vision might benefit from captions for audio, but only if these captions have adjustable size and color.</li>\\n      <li><strong><a name=\\\"health\\\" id=\\\"health\\\" shape=\\\"rect\\\">Health conditions:</a></strong> Some people have health conditions that may affect their stamina, dexterity, or concentration. For instance, some may experience fatigue, pain, or other symptoms that could affect their physical use of the computer or limit the duration or extent of their use of the Web.</li>\\n      <li><strong><a name=\\\"changing\\\" id=\\\"changing\\\" shape=\\\"rect\\\">Changing abilities:</a></strong> Some people may be experiencing progressive or recurring functional limitations that impact their use of the Web differently at different times. For instance, some may need particular accessibility features on one day, and others or none on another day, depending on their condition.</li>\\n      <li><strong><a name=\\\"temporary\\\" id=\\\"temporary\\\" shape=\\\"rect\\\">Temporary impairments:</a></strong> Some people may be experiencing temporary impairments such as those that may occur due to an accident, surgery, or medication. They may not know about accessibility solutions, may not know how to use accessibility features, and may be unaware of their own needs.</li>\\n      <li><strong><a name=\\\"situational\\\" id=\\\"situational\\\" shape=\\\"rect\\\">Situational limitations:</a></strong> Some people may be experiencing constraints due to their surrounding or due to other situational aspects. For instance, they may be in a loud environment and unable to hear audio, in bright sunlight and unable to see a screen, or they may not be able to afford some technologies.</li>\\n    </ul>\\n    <p>Websites and web tools that are designed for people with a broad range of abilities benefit everyone, including people without disabilities. It is therefore important to consider the broad diversity of functional needs rather than to categorize people according to medical classifications.</p>\\n  </div>\\n  <p class=\\\"totop\\\"><a href=\\\"#toc\\\" shape=\\\"rect\\\">back to page contents</a></p>\\n\\n  <h2><a name=\\\"auditory\\\" id=\\\"auditory\\\" shape=\\\"rect\\\">Auditory</a></h2>\\n  <p>Auditory disabilities range from mild or moderate hearing impairments in one or both ears (\\\"hard of hearing\\\"), to substantial and uncorrectable impairment of hearing in both ears (\\\"deafness\\\"). Some people with auditory disabilities can hear sounds but sometimes not sufficiently to understand all speech, especially when there is background noise. This includes people using hearing aids or other approaches to improve the sound.</p>\\n  <h3 class=\\\"f_panelHead\\\" style=\\\"cursor: pointer;\\\">More about auditory disabilities<span class=\\\"f_expanderWrapper\\\">\\n    <button class=\\\"f_expand xk_button\\\" value=\\\"expand this section\\\" type=\\\"button\\\" style=\\\"display: inline-block;\\\">\\n        <img alt=\\\"expand this section\\\" src=\\\"/WAI/images/excol/plus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n    <button class=\\\"f_collapse xk_button\\\" value=\\\"collapse this section\\\" type=\\\"button\\\" style=\\\"display: none;\\\">\\n        <img alt=\\\"collapse this section\\\" src=\\\"/WAI/images/excol/minus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n</span>\\n</h3>\\n  <div style=\\\"display: none;\\\">\\n    <p>While the rapid increase of multimedia on the Web provides many new opportunities for people with auditory disabilities, it also poses challenges when content is not designed to be accessible. For instance, while video content can be used to communicate information visually, audio content needs to have alternatives, such as transcripts and captions, so that it is accessible for people with auditory disabilities.</p>\\n    <p>To use the Web effectively, people with auditory disabilities need:</p>\\n    <ul>\\n      <li>Transcripts and captions of audio content, including audio-only content and audio tracks in multimedia</li>\\n      <li>Media players that display captions and provide options to adjust the text size and colors of captions</li>\\n      <li>Options to stop, pause, or adjust the volume of audio content (independently of the system volume)</li>\\n      <li>High-quality foreground audio that is clearly distinguishable from any background noise</li>\\n    </ul>\\n    <p>For some people with auditory disabilities, sign language is the first language and they may not read a written language fluently. Providing important information in sign language and using simpler text that is supplemented by images, graphs, and other illustrations help make web content more understandable to many. However, it is important to remember that not all people with auditory disabilities know sign language.</p>\\n  </div>\\n  <h3 class=\\\"f_panelHead\\\" style=\\\"cursor: pointer;\\\">Examples of auditory disabilities<span class=\\\"f_expanderWrapper\\\">\\n    <button class=\\\"f_expand xk_button\\\" value=\\\"expand this section\\\" type=\\\"button\\\" style=\\\"display: inline-block;\\\">\\n        <img alt=\\\"expand this section\\\" src=\\\"/WAI/images/excol/plus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n    <button class=\\\"f_collapse xk_button\\\" value=\\\"collapse this section\\\" type=\\\"button\\\" style=\\\"display: none;\\\">\\n        <img alt=\\\"collapse this section\\\" src=\\\"/WAI/images/excol/minus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n</span>\\n</h3>\\n  <div style=\\\"display: none;\\\">\\n    <ul>\\n      <li><strong><a name=\\\"hardofhearing\\\" id=\\\"hardofhearing\\\" shape=\\\"rect\\\">Hard of hearing</a></strong> - mild or moderate hearing impairments in one or both ears</li>\\n      <li><strong><a name=\\\"deafness\\\" id=\\\"deafness\\\" shape=\\\"rect\\\">Deafness</a></strong> - substantial, uncorrectable impairment of hearing in both ears</li>\\n      <li><strong><a name=\\\"deafblindness\\\" id=\\\"deafblindness\\\" shape=\\\"rect\\\">Deaf-blindness</a></strong> - substantial, uncorrectable hearing and visual impairments</li>\\n    </ul>\\n  </div>\\n  <h3 class=\\\"f_panelHead\\\" style=\\\"cursor: pointer;\\\">Examples of barriers for people with auditory disabilities<span class=\\\"f_expanderWrapper\\\">\\n    <button class=\\\"f_expand xk_button\\\" value=\\\"expand this section\\\" type=\\\"button\\\" style=\\\"display: inline-block;\\\">\\n        <img alt=\\\"expand this section\\\" src=\\\"/WAI/images/excol/plus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n    <button class=\\\"f_collapse xk_button\\\" value=\\\"collapse this section\\\" type=\\\"button\\\" style=\\\"display: none;\\\">\\n        <img alt=\\\"collapse this section\\\" src=\\\"/WAI/images/excol/minus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n</span>\\n</h3>\\n  <div style=\\\"display: none;\\\">\\n    <ul>\\n      <li>Audio content, such as videos with voices and sounds, without captions or transcripts</li>\\n      <li>Media players that do not display captions and that do not provide volume controls</li>\\n      <li>Media players that do not provide options to adjust the text size and colors for captions</li>\\n      <li>Web-based services, including web applications, that rely on interaction using voice only</li>\\n      <li>Lack of sign language to supplement important information and text that is difficult to read</li>\\n    </ul>\\n  </div>\\n  <h3 class=\\\"f_panelHead\\\" style=\\\"cursor: pointer;\\\">Sections related to auditory disabilities<span class=\\\"f_expanderWrapper\\\">\\n    <button class=\\\"f_expand xk_button\\\" value=\\\"expand this section\\\" type=\\\"button\\\" style=\\\"display: inline-block;\\\">\\n        <img alt=\\\"expand this section\\\" src=\\\"/WAI/images/excol/plus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n    <button class=\\\"f_collapse xk_button\\\" value=\\\"collapse this section\\\" type=\\\"button\\\" style=\\\"display: none;\\\">\\n        <img alt=\\\"collapse this section\\\" src=\\\"/WAI/images/excol/minus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n</span>\\n</h3>\\n  <div style=\\\"display: none;\\\">\\n    <p class=\\\"listintro\\\"><strong>Stories of web users:</strong></p>\\n    <ul class=\\\"listwithp\\\">\\n      <li><a href=\\\"stories#onlinestudent\\\" shape=\\\"rect\\\">Ms. Martinez, Online student who is hard of hearing</a></li>\\n      <li><a href=\\\"stories#teenager\\\" shape=\\\"rect\\\">Ms. Kaseem, Teenager with deaf-blindness</a></li>\\n    </ul>\\n    <p class=\\\"listintro\\\"><strong>Diversity in web use:</strong></p>\\n    <ul class=\\\"listwithp\\\">\\n      <li><a href=\\\"browsing#format\\\" shape=\\\"rect\\\">Captions (Hearing, feeling, and seeing)</a></li>\\n      <li><a href=\\\"browsing#format\\\" shape=\\\"rect\\\">Transcripts (Hearing, feeling, and seeing)</a></li>\\n      <li><a href=\\\"browsing#presentation\\\" shape=\\\"rect\\\">Sign language (Distinguishing and understanding)</a></li>\\n      <li><a href=\\\"browsing#presentation\\\" shape=\\\"rect\\\">Volume control (Distinguishing and understanding)</a></li>\\n    </ul>\\n    <p class=\\\"listintro\\\"><strong>Accessibility principles:</strong></p>\\n    <ul class=\\\"listwithp\\\">\\n      <li><a href=\\\"principles#alternatives\\\" shape=\\\"rect\\\">Text alternatives for non-text content (Perceivable)</a></li>\\n      <li><a href=\\\"principles#captions\\\" shape=\\\"rect\\\">Captions and other alternatives for multimedia (Perceivable)</a></li>\\n      <li><a href=\\\"principles#distinguishable\\\" shape=\\\"rect\\\">Content is easier to see and hear (Perceivable)</a></li>\\n      <li><a href=\\\"principles#time\\\" shape=\\\"rect\\\">Users have enough time to read and use the content (Operable)</a></li>\\n      <li><a href=\\\"principles#readable\\\" shape=\\\"rect\\\">Content is readable and understandable (Understandable)</a></li>\\n    </ul>\\n  </div>\\n  <p class=\\\"totop\\\"><a href=\\\"#toc\\\" shape=\\\"rect\\\">back to page contents</a></p>\\n\\n  <h2><a name=\\\"cognitive\\\" id=\\\"cognitive\\\" shape=\\\"rect\\\">Cognitive and neurological</a></h2>\\n  <p>Cognitive and neurological disabilities involve disorders of any part of the nervous system, including the brain and the peripheral nervous system. This can impact how well people hear, move, see, speak, and understand information. Cognitive and neurological disabilities do not necessarily affect the intelligence of a person.</p>\\n  <h3 class=\\\"f_panelHead\\\" style=\\\"cursor: pointer;\\\">More about cognitive and neurological disabilities<span class=\\\"f_expanderWrapper\\\">\\n    <button class=\\\"f_expand xk_button\\\" value=\\\"expand this section\\\" type=\\\"button\\\" style=\\\"display: inline-block;\\\">\\n        <img alt=\\\"expand this section\\\" src=\\\"/WAI/images/excol/plus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n    <button class=\\\"f_collapse xk_button\\\" value=\\\"collapse this section\\\" type=\\\"button\\\" style=\\\"display: none;\\\">\\n        <img alt=\\\"collapse this section\\\" src=\\\"/WAI/images/excol/minus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n</span>\\n</h3>\\n  <div style=\\\"display: none;\\\">\\n    <p>Computer technologies and the Web provide many opportunities for people with cognitive and neurological disabilities to interact with content and to process information in ways that are more usable to them. For instance, people can navigate web content using different strategies, access information in text, audio, or other formats, and change the presentation of the content according to their individual needs or preferences.</p>\\n    <p>Depending on the particular needs of an individual, people with cognitive and neurological disabilities need:</p>\\n    <ul>\\n      <li>Clearly structured content that facilitates overview and orientation</li>\\n      <li>Consistent labeling of forms, buttons, and other content parts</li>\\n      <li>Predictable link targets, functionality, and overall behavior</li>\\n      <li>Different ways of navigating websites, such as through a hierarchical menu or search option</li>\\n      <li>Options to suppress blinking, flickering, flashing, or otherwise distracting content</li>\\n      <li>Simpler text that is supplemented by images, graphs, and other illustrations</li>\\n    </ul>\\n    <p>People with cognitive and neurological disabilities use different types of web browsing methods, depending on their particular needs. For instance, some people use text-to-speech software to hear the information while reading it visually, or use captions to read the information while hearing it. Some people use tools that resize text and spacing, and customize colors to assist reading, and grammar and spelling tools to assist writing. For these web browsing methods to work, developers need to consider web accessibility requirements which are often shared by people with hearing, physical, speech, or visual disabilities.</p>\\n  </div>\\n  <h3 class=\\\"f_panelHead\\\" style=\\\"cursor: pointer;\\\">Examples of cognitive and neurological disabilities<span class=\\\"f_expanderWrapper\\\">\\n    <button class=\\\"f_expand xk_button\\\" value=\\\"expand this section\\\" type=\\\"button\\\" style=\\\"display: inline-block;\\\">\\n        <img alt=\\\"expand this section\\\" src=\\\"/WAI/images/excol/plus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n    <button class=\\\"f_collapse xk_button\\\" value=\\\"collapse this section\\\" type=\\\"button\\\" style=\\\"display: none;\\\">\\n        <img alt=\\\"collapse this section\\\" src=\\\"/WAI/images/excol/minus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n</span>\\n</h3>\\n  <div style=\\\"display: none;\\\">\\n    <ul>\\n      <li><strong><a name=\\\"adhd\\\" id=\\\"adhd\\\" shape=\\\"rect\\\">Attention deficit hyperactivity disorder (<acronym>ADHD</acronym>)</a></strong> (formerly \\\"attention deficit disorder (<acronym>ADD</acronym>)\\\") - involves difficulty focusing on a single task, difficulty focusing for longer periods, or may be easily distracted</li>\\n      <li><strong><a name=\\\"asd\\\" id=\\\"asd\\\" shape=\\\"rect\\\">Autism spectrum disorder (<acronym>ASD</acronym>)</a></strong> (includes \\\"autism\\\", \\\"Asperger syndrome\\\", and \\\"pervasive developmental disorder (<acronym>PDD</acronym>)) - involves impairments of social communication and interaction abilities, and sometimes restricted habits and interests</li>\\n      <li><strong><a name=\\\"intellectual\\\" id=\\\"intellectual\\\" shape=\\\"rect\\\">Intellectual disabilities</a></strong> (sometimes called \\\"<a href=\\\"#learning\\\" class=\\\"termref\\\" shape=\\\"rect\\\">learning disabilities</a>\\\" in Europe and some other countries, and \\\"developmental disabilities\\\" in other regions) - involves impairments of intelligence, learning more slowly, or difficulty understanding complex concepts. Down syndrome is one among many different causes of intellectual disabilities</li>\\n      <li><strong><a name=\\\"learning\\\" id=\\\"learning\\\" shape=\\\"rect\\\">Learning disabilities</a></strong> - is a functional term rather than a medical condition, and is not uniformly defined. In Europe and some other countries it refers to <a href=\\\"#intellectual\\\" class=\\\"termref\\\" shape=\\\"rect\\\">intellectual disabilities</a>, while in Australia, Canada, the U.S., and some other countries it refers to <a href=\\\"#perceptual\\\" class=\\\"termref\\\" shape=\\\"rect\\\">perceptual disabilities</a>.</li>\\n      <li><strong><a name=\\\"mhealth\\\" id=\\\"mhealth\\\" shape=\\\"rect\\\">Mental health disabilities</a></strong> - includes anxiety, delirium, depression, paranoia, schizophrenia, and many other disorders. These conditions may cause difficulty focusing on information, processing information, or understanding it. In particular medication for these disorders may have side effects including blurred vision, hand tremors, and other impairments</li>\\n      <li><strong><a name=\\\"memory\\\" id=\\\"memory\\\" shape=\\\"rect\\\">Memory impairments</a></strong> - involves limited short-term memory, missing long-term memory, or limited ability to recall language. Dementia is one among many different causes of memory impairments</li>\\n      <li><strong><a name=\\\"ms\\\" id=\\\"ms\\\" shape=\\\"rect\\\">Multiple sclerosis</a></strong> - causes damage to nerve cells in the brain and spinal cord, and can affect auditory, cognitive, physical, or visual abilities, in particular during relapses</li>\\n      <li><strong><a name=\\\"perceptual\\\" id=\\\"perceptual\\\" shape=\\\"rect\\\">Perceptual disabilities</a></strong> (sometimes called \\\"<a href=\\\"#learning\\\" class=\\\"termref\\\" shape=\\\"rect\\\">learning disabilities</a>\\\" in Australia, Canada, the U.S., and some other countries) - involves difficulty processing auditory, tactile, visual, or other sensory information. This can impact reading (dyslexia), writing (dysgraphia), processing numbers (dyscalculia), or spatial and temporal orientation</li>\\n      <li><strong><a name=\\\"seizure\\\" id=\\\"seizure\\\" shape=\\\"rect\\\">Seizure disorders</a></strong> - includes different types of epilepsy and migraines, which may be in reaction to visual flickering or audio signals at certain frequencies or patterns</li>\\n    </ul>\\n  </div>\\n  <h3 class=\\\"f_panelHead\\\" style=\\\"cursor: pointer;\\\">Examples of barriers for people with cognitive and neurological disabilities<span class=\\\"f_expanderWrapper\\\">\\n    <button class=\\\"f_expand xk_button\\\" value=\\\"expand this section\\\" type=\\\"button\\\" style=\\\"display: inline-block;\\\">\\n        <img alt=\\\"expand this section\\\" src=\\\"/WAI/images/excol/plus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n    <button class=\\\"f_collapse xk_button\\\" value=\\\"collapse this section\\\" type=\\\"button\\\" style=\\\"display: none;\\\">\\n        <img alt=\\\"collapse this section\\\" src=\\\"/WAI/images/excol/minus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n</span>\\n</h3>\\n  <div style=\\\"display: none;\\\">\\n    <ul>\\n      <li>Complex navigation mechanisms and page layouts that are difficult to understand and use</li>\\n      <li>Complex sentences that are difficult to read and unusual words that are difficult to understand</li>\\n      <li>Long passages of text without images, graphs, or other illustrations to highlight the context</li>\\n      <li>Moving, blinking, or flickering content, and background audio that cannot be turned off</li>\\n      <li>Web browsers and media players that do not provide mechanisms to suppress animations and audio</li>\\n      <li>Visual page designs that cannot be adapted using web browser controls or custom style sheets</li>\\n    </ul>\\n  </div>\\n  <h3 class=\\\"f_panelHead\\\" style=\\\"cursor: pointer;\\\">Sections related to cognitive and neurological disabilities<span class=\\\"f_expanderWrapper\\\">\\n    <button class=\\\"f_expand xk_button\\\" value=\\\"expand this section\\\" type=\\\"button\\\" style=\\\"display: inline-block;\\\">\\n        <img alt=\\\"expand this section\\\" src=\\\"/WAI/images/excol/plus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n    <button class=\\\"f_collapse xk_button\\\" value=\\\"collapse this section\\\" type=\\\"button\\\" style=\\\"display: none;\\\">\\n        <img alt=\\\"collapse this section\\\" src=\\\"/WAI/images/excol/minus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n</span>\\n</h3>\\n  <div style=\\\"display: none;\\\">\\n    <p class=\\\"listintro\\\"><strong>Stories of web users:</strong></p>\\n    <ul class=\\\"listwithp\\\">\\n      <li><a href=\\\"stories#classroomstudent\\\" shape=\\\"rect\\\">Ms. Olsen, Classroom student with attention deficit hyperactivity disorder (<acronym>ADHD</acronym>) and dyslexia</a></li>\\n      <li><a href=\\\"stories#retiree\\\" shape=\\\"rect\\\">Mr. Yunus, Retiree with low vision, hand tremor, and mild short-term memory loss</a></li>\\n      <li><a href=\\\"stories#supermarketassistant\\\" shape=\\\"rect\\\">Mr. Sands, Supermarket assistant with Down syndrome</a></li>\\n    </ul>\\n    <p class=\\\"listintro\\\"><strong>Diversity in web use:</strong></p>\\n    <ul class=\\\"listwithp\\\">\\n      <li><a href=\\\"browsing#format\\\" shape=\\\"rect\\\">Captions (Hearing, feeling, and seeing)</a></li>\\n      <li><a href=\\\"browsing#format\\\" shape=\\\"rect\\\">Screen reader (Hearing, feeling, and seeing)</a></li>\\n      <li><a href=\\\"browsing#format\\\" shape=\\\"rect\\\">Text-to-speech (Hearing, feeling, and seeing)</a></li>\\n      <li><a href=\\\"browsing#format\\\" shape=\\\"rect\\\">Voice browser (Hearing, feeling, and seeing)</a></li>\\n      <li><a href=\\\"browsing#presentation\\\" shape=\\\"rect\\\">Document outline (Distinguishing and understanding)</a></li>\\n      <li><a href=\\\"browsing#presentation\\\" shape=\\\"rect\\\">Easy-to-read text (Distinguishing and understanding)</a></li>\\n      <li><a href=\\\"browsing#presentation\\\" shape=\\\"rect\\\">Pop-up and animations blockers (Distinguishing and understanding)</a></li>\\n      <li><a href=\\\"browsing#presentation\\\" shape=\\\"rect\\\">Progressive disclosure (Distinguishing and understanding)</a></li>\\n      <li><a href=\\\"browsing#presentation\\\" shape=\\\"rect\\\">Reading assistants (Distinguishing and understanding)</a></li>\\n      <li><a href=\\\"browsing#presentation\\\" shape=\\\"rect\\\">Reduced interface (Distinguishing and understanding)</a></li>\\n      <li><a href=\\\"browsing#presentation\\\" shape=\\\"rect\\\">Symbols (Distinguishing and understanding)</a></li>\\n      <li><a href=\\\"browsing#interaction\\\" shape=\\\"rect\\\">On-screen keyboard (Typing, writing, and clicking)</a></li>\\n      <li><a href=\\\"browsing#interaction\\\" shape=\\\"rect\\\">Spelling and grammar tools (Typing, writing, and clicking)</a></li>\\n      <li><a href=\\\"browsing#interaction\\\" shape=\\\"rect\\\">Word prediction (Typing, writing, and clicking)</a></li>\\n      <li><a href=\\\"browsing#navigation\\\" shape=\\\"rect\\\">Bookmarks and history (Navigating and finding content)</a></li>\\n      <li><a href=\\\"browsing#navigation\\\" shape=\\\"rect\\\">Consistency and predictability (Navigating and finding content)</a></li>\\n      <li><a href=\\\"browsing#navigation\\\" shape=\\\"rect\\\">Descriptive titles, headings, and labels (Navigating and finding content)</a></li>\\n      <li><a href=\\\"browsing#navigation\\\" shape=\\\"rect\\\">Helpful error and success messages (Navigating and finding content)</a></li>\\n      <li><a href=\\\"browsing#navigation\\\" shape=\\\"rect\\\">Keyword search (Navigating and finding content)</a></li>\\n      <li><a href=\\\"browsing#navigation\\\" shape=\\\"rect\\\">Multiple navigation mechanisms (Navigating and finding content)</a></li>\\n      <li><a href=\\\"browsing#navigation\\\" shape=\\\"rect\\\">Page maps (Navigating and finding content)</a></li>\\n      <li><a href=\\\"browsing#navigation\\\" shape=\\\"rect\\\">Pictorial links (Navigating and finding content)</a></li>\\n    </ul>\\n    <p class=\\\"listintro\\\"><strong>Accessibility principles:</strong></p>\\n    <ul class=\\\"listwithp\\\">\\n      <li><a href=\\\"principles#alternatives\\\" shape=\\\"rect\\\">Text alternatives for non-text content (Perceivable)</a></li>\\n      <li><a href=\\\"principles#captions\\\" shape=\\\"rect\\\">Captions and other alternatives for multimedia (Perceivable)</a></li>\\n      <li><a href=\\\"principles#adaptable\\\" shape=\\\"rect\\\">Content can be presented in different ways (Perceivable)</a></li>\\n      <li><a href=\\\"principles#distinguishable\\\" shape=\\\"rect\\\">Content is easier to see and hear (Perceivable)</a></li>\\n      <li><a href=\\\"principles#time\\\" shape=\\\"rect\\\">Users have enough time to read and use the content (Operable)</a></li>\\n      <li><a href=\\\"principles#safe\\\" shape=\\\"rect\\\">Content does not cause seizures (Operable)</a></li>\\n      <li><a href=\\\"principles#navigable\\\" shape=\\\"rect\\\">Users can easily navigate, find content, and determine where they are (Operable)</a></li>\\n      <li><a href=\\\"principles#readable\\\" shape=\\\"rect\\\">Content is readable and understandable (Understandable)</a></li>\\n      <li><a href=\\\"principles#predictable\\\" shape=\\\"rect\\\">Content appears and operates in predictable ways (Understandable)</a></li>\\n      <li><a href=\\\"principles#tolerant\\\" shape=\\\"rect\\\">Users are helped to avoid and correct mistakes (Understandable)</a></li>\\n      <li><a href=\\\"principles#compatible\\\" shape=\\\"rect\\\">Content is compatible with current and future user tools (Robust)</a></li>\\n    </ul>\\n  </div>\\n  <p class=\\\"totop\\\"><a href=\\\"#toc\\\" shape=\\\"rect\\\">back to page contents</a></p>\\n\\n  <h2><a name=\\\"physical\\\" id=\\\"physical\\\" shape=\\\"rect\\\">Physical</a></h2>\\n  <p>Physical disabilities (sometimes called \\\"motor disabilities\\\") include weakness, limitations of muscular control (such as involuntary movements including tremors, lack of coordination, or paralysis), limitations of sensation, joint problems (such as arthritis), pain that impedes movement, or missing limbs.</p>\\n  <h3 class=\\\"f_panelHead\\\" style=\\\"cursor: pointer;\\\">More about physical disabilities<span class=\\\"f_expanderWrapper\\\">\\n    <button class=\\\"f_expand xk_button\\\" value=\\\"expand this section\\\" type=\\\"button\\\" style=\\\"display: inline-block;\\\">\\n        <img alt=\\\"expand this section\\\" src=\\\"/WAI/images/excol/plus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n    <button class=\\\"f_collapse xk_button\\\" value=\\\"collapse this section\\\" type=\\\"button\\\" style=\\\"display: none;\\\">\\n        <img alt=\\\"collapse this section\\\" src=\\\"/WAI/images/excol/minus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n</span>\\n</h3>\\n  <div style=\\\"display: none;\\\">\\n    <p>To use the Web, people with physical disabilities often use specialized hardware and software such as:</p>\\n    <ul>\\n      <li>Ergonomic or specially designed keyboard or mouse</li>\\n      <li>Head pointer, mouth stick, and other aids to help typing</li>\\n      <li>On-screen keyboard with trackball, joystick, and switches to operate it</li>\\n      <li>Voice recognition, eye tracking, and other approaches for hands-free interaction</li>\\n    </ul>\\n    <p>People with physical disabilities may be using a mouse or mouse-like device only, or keyboard or keyboard-like device only to operate the computer. People with physical disabilities need full keyboard support for all functionality provided on a web page. They may need more time to type, click, or carry out other interaction, and they may type single keystrokes in sequence rather than typing simultaneous keystrokes (\\\"chording\\\") to activate commands. This includes commands for special characters, shortcut keys, or to active menu items.</p>\\n    <p>People with physical disabilities often have trouble clicking small areas and are more likely to make mistakes in typing or clicking. Providing large clickable areas, enough time to complete tasks, and error correction options for forms are important design aspects. Other important design aspects include providing visible indicators of the current focus, and mechanisms to skip over blocks, such as over page headers or navigation bars. Many of these requirements are shared by people with cognitive, neurological, and visual disabilities.</p>\\n  </div>\\n  <h3 class=\\\"f_panelHead\\\" style=\\\"cursor: pointer;\\\">Examples of physical disabilities<span class=\\\"f_expanderWrapper\\\">\\n    <button class=\\\"f_expand xk_button\\\" value=\\\"expand this section\\\" type=\\\"button\\\" style=\\\"display: inline-block;\\\">\\n        <img alt=\\\"expand this section\\\" src=\\\"/WAI/images/excol/plus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n    <button class=\\\"f_collapse xk_button\\\" value=\\\"collapse this section\\\" type=\\\"button\\\" style=\\\"display: none;\\\">\\n        <img alt=\\\"collapse this section\\\" src=\\\"/WAI/images/excol/minus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n</span>\\n</h3>\\n  <div style=\\\"display: none;\\\">\\n    <ul>\\n      <li><strong><a name=\\\"limbs\\\" id=\\\"limbs\\\" shape=\\\"rect\\\">Amputation and deformity</a></strong> - includes missing fingers, limbs, or other parts of the human body</li>\\n      <li><strong><a name=\\\"arthritis\\\" id=\\\"arthritis\\\" shape=\\\"rect\\\">Arthritis</a></strong> (previously called \\\"<a href=\\\"#rheumatism\\\" class=\\\"termref\\\" shape=\\\"rect\\\">rheumatism</a>\\\") - inflammation, degeneration, or damage of the joints</li>\\n      <li><strong><a name=\\\"fibromyalgia\\\" id=\\\"fibromyalgia\\\" shape=\\\"rect\\\">Fibromyalgia</a></strong> (previously called \\\"<a href=\\\"#rheumatism\\\" class=\\\"termref\\\" shape=\\\"rect\\\">rheumatism</a>\\\") - chronic pain of muscle and connective tissues</li>\\n      <li><strong><a name=\\\"rheumatism\\\" id=\\\"rheumatism\\\" shape=\\\"rect\\\">Rheumatism</a></strong> - typically refers to <a href=\\\"#arthritis\\\" class=\\\"termref\\\" shape=\\\"rect\\\">arthritis</a> and other causes for bone or joint pain, and sometimes to <a href=\\\"#fibromyalgia\\\" class=\\\"termref\\\" shape=\\\"rect\\\">fibromyalgia</a> and other causes for muscular and other soft tissue pain</li>\\n      <li><strong><a name=\\\"dexterity\\\" id=\\\"dexterity\\\" shape=\\\"rect\\\">Reduced dexterity</a></strong> - is a functional term (rather than a medical condition) that describes the ability to control the hand, such as hand-eye coordination of people with cognitive and neurological disabilities</li>\\n      <li><strong><a name=\\\"md\\\" id=\\\"md\\\" shape=\\\"rect\\\">Muscular dystrophy</a></strong> - progressive weakness and degeneration of muscles, including in arms and hands</li>\\n      <li><strong><a name=\\\"rsi\\\" id=\\\"rsi\\\" shape=\\\"rect\\\">Repetitive stress injury (<acronym>RSI</acronym>)</a></strong> (also called \\\"repetitive motion disorder\\\" (<acronym>RMD</acronym>) and \\\"cumulative trauma disorder\\\" (<acronym>CT</acronym>)) - involves injuries to the musculoskeletal system (bones, joints, tendons, and other connective tissues) and the nervous system from repetitive tasks and damage</li>\\n      <li><strong><a name=\\\"tremor\\\" id=\\\"tremor\\\" shape=\\\"rect\\\">Tremor and spasms</a></strong> - involuntary movement or muscle contraction, including short twitches, and continual or rhythmic muscle contractions</li>\\n      <li><strong><a name=\\\"quadriplegia\\\" id=\\\"quadriplegia\\\" shape=\\\"rect\\\">Quadriplegia</a></strong> (sometimes called \\\"tetraplegia\\\") - partial or total paralysis (includes motor control and sensation) to all four body limbs (legs and arms) and the torso</li>\\n    </ul>\\n  </div>\\n  <h3 class=\\\"f_panelHead\\\" style=\\\"cursor: pointer;\\\">Examples of barriers for people with physical disabilities<span class=\\\"f_expanderWrapper\\\">\\n    <button class=\\\"f_expand xk_button\\\" value=\\\"expand this section\\\" type=\\\"button\\\" style=\\\"display: inline-block;\\\">\\n        <img alt=\\\"expand this section\\\" src=\\\"/WAI/images/excol/plus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n    <button class=\\\"f_collapse xk_button\\\" value=\\\"collapse this section\\\" type=\\\"button\\\" style=\\\"display: none;\\\">\\n        <img alt=\\\"collapse this section\\\" src=\\\"/WAI/images/excol/minus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n</span>\\n</h3>\\n  <div style=\\\"display: none;\\\">\\n    <ul>\\n      <li>Websites, web browsers, and authoring tools that do not provide full keyboard support</li>\\n      <li>Insufficient time limits to respond or to complete tasks, such as to fill out online forms</li>\\n      <li>Controls, including links with images of text, that do not have equivalent text alternatives</li>\\n      <li>Missing visual and non-visual orientation cues, page structure, and other navigational aids</li>\\n      <li>Inconsistent, unpredictable, and overly complex navigation mechanisms and page functions</li>\\n    </ul>\\n  </div>\\n  <h3 class=\\\"f_panelHead\\\" style=\\\"cursor: pointer;\\\">Sections related to physical disabilities<span class=\\\"f_expanderWrapper\\\">\\n    <button class=\\\"f_expand xk_button\\\" value=\\\"expand this section\\\" type=\\\"button\\\" style=\\\"display: inline-block;\\\">\\n        <img alt=\\\"expand this section\\\" src=\\\"/WAI/images/excol/plus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n    <button class=\\\"f_collapse xk_button\\\" value=\\\"collapse this section\\\" type=\\\"button\\\" style=\\\"display: none;\\\">\\n        <img alt=\\\"collapse this section\\\" src=\\\"/WAI/images/excol/minus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n</span>\\n</h3>\\n  <div style=\\\"display: none;\\\">\\n    <p class=\\\"listintro\\\"><strong>Stories of web users:</strong></p>\\n    <ul class=\\\"listwithp\\\">\\n      <li><a href=\\\"stories#reporter\\\" shape=\\\"rect\\\">Mr. Jones, Reporter with repetitive stress injury</a></li>\\n      <li><a href=\\\"stories#retiree\\\" shape=\\\"rect\\\">Mr. Yunus, Retiree with low vision, hand tremor, and mild short-term memory loss</a></li>\\n    </ul>\\n    <p class=\\\"listintro\\\"><strong>Diversity in web use:</strong></p>\\n    <ul class=\\\"listwithp\\\">\\n      <li><a href=\\\"browsing#format\\\" shape=\\\"rect\\\">Text-to-speech (Hearing, feeling, and seeing)</a></li>\\n      <li><a href=\\\"browsing#format\\\" shape=\\\"rect\\\">Voice browser (Hearing, feeling, and seeing)</a></li>\\n      <li><a href=\\\"browsing#interaction\\\" shape=\\\"rect\\\">Accelerators (Typing, writing, and clicking)</a></li>\\n      <li><a href=\\\"browsing#interaction\\\" shape=\\\"rect\\\">Alternative keyboard and mouse (Typing, writing, and clicking)</a></li>\\n      <li><a href=\\\"browsing#interaction\\\" shape=\\\"rect\\\">Eye tracking (Typing, writing, and clicking)</a></li>\\n      <li><a href=\\\"browsing#interaction\\\" shape=\\\"rect\\\">Keyboard customization (Typing, writing, and clicking)</a></li>\\n      <li><a href=\\\"browsing#interaction\\\" shape=\\\"rect\\\">Keyboard and mouse filters (Typing, writing, and clicking)</a></li>\\n      <li><a href=\\\"browsing#interaction\\\" shape=\\\"rect\\\">Mouse customization (Typing, writing, and clicking)</a></li>\\n      <li><a href=\\\"browsing#interaction\\\" shape=\\\"rect\\\">On-screen keyboard (Typing, writing, and clicking)</a></li>\\n      <li><a href=\\\"browsing#interaction\\\" shape=\\\"rect\\\">Voice recognition (Typing, writing, and clicking)</a></li>\\n      <li><a href=\\\"browsing#interaction\\\" shape=\\\"rect\\\">Word prediction (Typing, writing, and clicking)</a></li>\\n      <li><a href=\\\"browsing#navigation\\\" shape=\\\"rect\\\">Keyboard navigation (Navigating and finding content)</a></li>\\n    </ul>\\n    <p class=\\\"listintro\\\"><strong>Accessibility principles:</strong></p>\\n    <ul class=\\\"listwithp\\\">\\n      <li><a href=\\\"principles#alternatives\\\" shape=\\\"rect\\\">Text alternatives for non-text content (Perceivable)</a></li>\\n      <li><a href=\\\"principles#adaptable\\\" shape=\\\"rect\\\">Content can be presented in different ways (Perceivable)</a></li>\\n      <li><a href=\\\"principles#keyboard\\\" shape=\\\"rect\\\">Functionality is available from a keyboard (Operable)</a></li>\\n      <li><a href=\\\"principles#time\\\" shape=\\\"rect\\\">Users have enough time to read and use the content (Operable)</a></li>\\n      <li><a href=\\\"principles#navigable\\\" shape=\\\"rect\\\">Users can easily navigate, find content, and determine where they are (Operable)</a></li>\\n      <li><a href=\\\"principles#predictable\\\" shape=\\\"rect\\\">Content appears and operates in predictable ways (Understandable)</a></li>\\n      <li><a href=\\\"principles#tolerant\\\" shape=\\\"rect\\\">Users are helped to avoid and correct mistakes (Understandable)</a></li>\\n      <li><a href=\\\"principles#compatible\\\" shape=\\\"rect\\\">Content is compatible with different technologies (Robust)</a></li>\\n      <li><a href=\\\"principles#compatible\\\" shape=\\\"rect\\\">Content is compatible with current and future user tools (Robust)</a></li>\\n    </ul>\\n  </div>\\n  <p class=\\\"totop\\\"><a href=\\\"#toc\\\" shape=\\\"rect\\\">back to page contents</a></p>\\n\\n  <h2><a name=\\\"speech\\\" id=\\\"speech\\\" shape=\\\"rect\\\">Speech</a></h2>\\n  <p>Speech disabilities include difficulty producing speech that is recognizable by others or by voice recognition software. For instance, the loudness or clarity of someone's voice might be difficult to understand.</p>\\n  <h3 class=\\\"f_panelHead\\\" style=\\\"cursor: pointer;\\\">More about speech disabilities<span class=\\\"f_expanderWrapper\\\">\\n    <button class=\\\"f_expand xk_button\\\" value=\\\"expand this section\\\" type=\\\"button\\\" style=\\\"display: inline-block;\\\">\\n        <img alt=\\\"expand this section\\\" src=\\\"/WAI/images/excol/plus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n    <button class=\\\"f_collapse xk_button\\\" value=\\\"collapse this section\\\" type=\\\"button\\\" style=\\\"display: none;\\\">\\n        <img alt=\\\"collapse this section\\\" src=\\\"/WAI/images/excol/minus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n</span>\\n</h3>\\n  <div style=\\\"display: none;\\\">\\n    <p>People with speech disabilities encounter barriers with voice-based services, such as automated web-based hotlines and web applications that are operated using voice commands. To use services that rely on voice, people with speech disabilities need alternative modes for interaction such as a text-based chat to interact with hotline representatives or keyboard commands to operate web applications. Also, websites that provide telephone numbers as the only means of communicating with an organizations pose barriers for people with speech disabilities. Alternative means of communication include e-mail and feedback forms.</p>\\n  </div>\\n  <h3 class=\\\"f_panelHead\\\" style=\\\"cursor: pointer;\\\">Examples of speech disabilities<span class=\\\"f_expanderWrapper\\\">\\n    <button class=\\\"f_expand xk_button\\\" value=\\\"expand this section\\\" type=\\\"button\\\" style=\\\"display: inline-block;\\\">\\n        <img alt=\\\"expand this section\\\" src=\\\"/WAI/images/excol/plus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n    <button class=\\\"f_collapse xk_button\\\" value=\\\"collapse this section\\\" type=\\\"button\\\" style=\\\"display: none;\\\">\\n        <img alt=\\\"collapse this section\\\" src=\\\"/WAI/images/excol/minus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n</span>\\n</h3>\\n  <div style=\\\"display: none;\\\">\\n    <ul>\\n      <li><strong><a name=\\\"apraxia\\\" id=\\\"apraxia\\\" shape=\\\"rect\\\">Apraxia of speech (AOS)</a></strong> - includes inconsistent articulation and production of speech sounds, and errors producing sounds in the correct order so that spoken words or phrases become difficult to understand.</li>\\n      <li><strong><a name=\\\"cluttering\\\" id=\\\"cluttering\\\" shape=\\\"rect\\\">Cluttering</a></strong> (also called \\\"tachyphemia\\\") - includes increased speaking rate, incorrect rhythm, intonation, and co-articulation of sounds, and other influency in speech that is sometimes similar to <a href=\\\"#stuttering\\\" class=\\\"termref\\\" shape=\\\"rect\\\">stuttering</a>.</li>\\n      <li><strong><a name=\\\"dysarthria\\\" id=\\\"dysarthria\\\" shape=\\\"rect\\\">Dysarthria</a></strong> - involves weakness or complete paralysis of muscles that are necessary to produce speech, including lips, lungs, throat, tongue, and others.</li>\\n      <li><strong><a name=\\\"sound\\\" id=\\\"sound\\\" shape=\\\"rect\\\">Speech sound disorder</a></strong> - involves difficulty or inability to produce certain sounds or patterns of sound and sometimes results in addition, distortion, omission, or substitution of such sounds with others.</li>\\n      <li><strong><a name=\\\"stuttering\\\" id=\\\"stuttering\\\" shape=\\\"rect\\\">Stuttering</a></strong> - includes influency in speech, repetition of individual sounds or entire words and phrases, and misplacement or prolongation of pauses and sounds during speech that is different from <a href=\\\"#cluttering\\\" class=\\\"termref\\\" shape=\\\"rect\\\">cluttering</a>.</li>\\n      <li><strong><a name=\\\"muteness\\\" id=\\\"muteness\\\" shape=\\\"rect\\\">Muteness</a></strong> (also called \\\"mutism\\\") - involves inability to speak due to different reasons such as anxiety, brain injuries, or inability to hear and learn speech.</li>\\n    </ul>\\n  </div>\\n  <h3 class=\\\"f_panelHead\\\" style=\\\"cursor: pointer;\\\">Examples of barriers for people with speech disabilities<span class=\\\"f_expanderWrapper\\\">\\n    <button class=\\\"f_expand xk_button\\\" value=\\\"expand this section\\\" type=\\\"button\\\" style=\\\"display: inline-block;\\\">\\n        <img alt=\\\"expand this section\\\" src=\\\"/WAI/images/excol/plus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n    <button class=\\\"f_collapse xk_button\\\" value=\\\"collapse this section\\\" type=\\\"button\\\" style=\\\"display: none;\\\">\\n        <img alt=\\\"collapse this section\\\" src=\\\"/WAI/images/excol/minus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n</span>\\n</h3>\\n  <div style=\\\"display: none;\\\">\\n    <ul>\\n      <li>Web-based services, including web applications, that rely on interaction using voice only</li>\\n      <li>Websites offering phone numbers as the only way to communicate with the organization</li>\\n    </ul>\\n  </div>\\n  <p class=\\\"totop\\\"><a href=\\\"#toc\\\" shape=\\\"rect\\\">back to page contents</a></p>\\n\\n  <h2><a name=\\\"visual\\\" id=\\\"visual\\\" shape=\\\"rect\\\">Visual</a></h2>\\n  <p>Visual disabilities range from mild or moderate vision impairments in one or both eyes (\\\"low vision\\\" or \\\"partial sight\\\"), to substantial and uncorrectable loss of vision in both eyes (\\\"blindness\\\"). Some people have reduced or lack of sensitivity to certain colors (\\\"color blindness\\\"), or increased sensitivity towards excessive brightness in colors. These variations in perception of colors and brightness can be independent of the visual acuity.</p>\\n  <h3 class=\\\"f_panelHead\\\" style=\\\"cursor: pointer;\\\">More about visual disabilities<span class=\\\"f_expanderWrapper\\\">\\n    <button class=\\\"f_expand xk_button\\\" value=\\\"expand this section\\\" type=\\\"button\\\" style=\\\"display: inline-block;\\\">\\n        <img alt=\\\"expand this section\\\" src=\\\"/WAI/images/excol/plus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n    <button class=\\\"f_collapse xk_button\\\" value=\\\"collapse this section\\\" type=\\\"button\\\" style=\\\"display: none;\\\">\\n        <img alt=\\\"collapse this section\\\" src=\\\"/WAI/images/excol/minus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n</span>\\n</h3>\\n  <div style=\\\"display: none;\\\">\\n    <p>People with visual disabilities typically rely on changing the presentation of web content into forms that are more usable for their particular needs. For example by:</p>\\n    <ul>\\n      <li>Enlarging or reducing text size and images</li>\\n      <li>Customizing settings for fonts, colors, and spacing</li>\\n      <li>Listening to text-to-speech synthesis of the content</li>\\n      <li>Listening to audio descriptions of video in multimedia</li>\\n      <li>Reading text using refreshable braille (small dots that are raised and lowered to display characters that are read by scanning over the raised dots using the fingertips)</li>\\n    </ul>\\n    <p>For these web browsing methods to work, developers need to ensure that the presentation of web content is independent of its underlying structure, and that the structure is correctly coded so that it can processed by software and presented in different ways. For instance, some people do not see the content and need lists, headings, tables, and other page structures to be properly coded so that they can be identified by software.</p>\\n    <p>Some people are only seeing small portions of the content at a time or are perceiving the colors and design differently. Some people are using customized fonts, colors, and spacing to make the content more readable, or they are navigating through the content using keyboard only because they cannot see the mouse-pointer. An accessible design supports different presentations of the web content, and different ways for interaction.</p>\\n  </div>\\n  <h3 class=\\\"f_panelHead\\\" style=\\\"cursor: pointer;\\\">Examples of visual disabilities<span class=\\\"f_expanderWrapper\\\">\\n    <button class=\\\"f_expand xk_button\\\" value=\\\"expand this section\\\" type=\\\"button\\\" style=\\\"display: inline-block;\\\">\\n        <img alt=\\\"expand this section\\\" src=\\\"/WAI/images/excol/plus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n    <button class=\\\"f_collapse xk_button\\\" value=\\\"collapse this section\\\" type=\\\"button\\\" style=\\\"display: none;\\\">\\n        <img alt=\\\"collapse this section\\\" src=\\\"/WAI/images/excol/minus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n</span>\\n</h3>\\n  <div style=\\\"display: none;\\\">\\n    <ul>\\n      <li><strong><a name=\\\"colorblindness\\\" id=\\\"colorblindness\\\" shape=\\\"rect\\\">Color blindness</a></strong> - includes difficulty distinguishing between colors such as between red and green, or between yellow and blue, and sometimes inability to perceive any color</li>\\n      <li><strong><a name=\\\"lowvision\\\" id=\\\"lowvision\\\" shape=\\\"rect\\\">Low vision</a></strong> - includes poor acuity (vision that is not sharp), tunnel vision (seeing only the middle of the visual field), central field loss (seeing only the edges of the visual field), and clouded vision</li>\\n      <li><strong><a name=\\\"blindness\\\" id=\\\"blindness\\\" shape=\\\"rect\\\">Blindness</a></strong> - substantial, uncorrectable loss of vision in both eyes</li>\\n      <li><strong><a name=\\\"deafblind\\\" id=\\\"deafblind\\\" shape=\\\"rect\\\">Deaf-blindness</a></strong> - substantial, uncorrectable visual and hearing impairments</li>\\n    </ul>\\n  </div>\\n  <h3 class=\\\"f_panelHead\\\" style=\\\"cursor: pointer;\\\">Examples of barriers for people with visual disabilities<span class=\\\"f_expanderWrapper\\\">\\n    <button class=\\\"f_expand xk_button\\\" value=\\\"expand this section\\\" type=\\\"button\\\" style=\\\"display: inline-block;\\\">\\n        <img alt=\\\"expand this section\\\" src=\\\"/WAI/images/excol/plus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n    <button class=\\\"f_collapse xk_button\\\" value=\\\"collapse this section\\\" type=\\\"button\\\" style=\\\"display: none;\\\">\\n        <img alt=\\\"collapse this section\\\" src=\\\"/WAI/images/excol/minus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n</span>\\n</h3>\\n  <div style=\\\"display: none;\\\">\\n    <ul>\\n      <li>Images, controls, and other structural elements that do not have equivalent text alternatives</li>\\n      <li>Text, images, and page layouts that cannot be resized, or that lose information when resized</li>\\n      <li>Missing visual and non-visual orientation cues, page structure, and other navigational aids</li>\\n      <li>Video content that does not have text or audio alternatives, or an audio-description track</li>\\n      <li>Inconsistent, unpredictable, and overly complex navigation mechanisms and page functions</li>\\n      <li>Text and images with insufficient contrast between foreground and background color combinations</li>\\n      <li>Websites, web browsers, and authoring tools that do not support use of custom color combinations</li>\\n      <li>Websites, web browsers, and authoring tools that do not provide full keyboard support</li>\\n    </ul>\\n  </div>\\n  <h3 class=\\\"f_panelHead\\\" style=\\\"cursor: pointer;\\\">Sections related to visual disabilities<span class=\\\"f_expanderWrapper\\\">\\n    <button class=\\\"f_expand xk_button\\\" value=\\\"expand this section\\\" type=\\\"button\\\" style=\\\"display: inline-block;\\\">\\n        <img alt=\\\"expand this section\\\" src=\\\"/WAI/images/excol/plus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n    <button class=\\\"f_collapse xk_button\\\" value=\\\"collapse this section\\\" type=\\\"button\\\" style=\\\"display: none;\\\">\\n        <img alt=\\\"collapse this section\\\" src=\\\"/WAI/images/excol/minus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n</span>\\n</h3>\\n  <div style=\\\"display: none;\\\">\\n    <p class=\\\"listintro\\\"><strong>Stories of web users:</strong></p>\\n    <ul class=\\\"listwithp\\\">\\n      <li><a href=\\\"stories#shopper\\\" shape=\\\"rect\\\">Mr. Lee, Online shopper with color blindness</a></li>\\n      <li><a href=\\\"stories#accountant\\\" shape=\\\"rect\\\">Ms. Laitinen, Accountant with blindness</a></li>\\n      <li><a href=\\\"stories#retiree\\\" shape=\\\"rect\\\">Mr. Yunus, Retiree with low vision, hand tremor, and mild short-term memory loss</a></li>\\n      <li><a href=\\\"stories#teenager\\\" shape=\\\"rect\\\">Ms. Kaseem, Teenager with deaf-blindness</a></li>\\n    </ul>\\n    <p class=\\\"listintro\\\"><strong>Diversity in web use:</strong></p>\\n    <ul class=\\\"listwithp\\\">\\n      <li><a href=\\\"browsing#format\\\" shape=\\\"rect\\\">Audio descriptions (Hearing, feeling, and seeing)</a></li>\\n      <li><a href=\\\"browsing#format\\\" shape=\\\"rect\\\">Auditory, tactile, and visual notifications (Hearing, feeling, and seeing)</a></li>\\n      <li><a href=\\\"browsing#format\\\" shape=\\\"rect\\\">Braille (Hearing, feeling, and seeing)</a></li>\\n      <li><a href=\\\"browsing#format\\\" shape=\\\"rect\\\">Refreshable braille display (Hearing, feeling, and seeing)</a></li>\\n      <li><a href=\\\"browsing#format\\\" shape=\\\"rect\\\">Screen reader (Hearing, feeling, and seeing)</a></li>\\n      <li><a href=\\\"browsing#format\\\" shape=\\\"rect\\\">Text-to-speech (Hearing, feeling, and seeing)</a></li>\\n      <li><a href=\\\"browsing#format\\\" shape=\\\"rect\\\">Transcripts (Hearing, feeling, and seeing)</a></li>\\n      <li><a href=\\\"browsing#presentation\\\" shape=\\\"rect\\\">Customized fonts and colors (Distinguishing and understanding)</a></li>\\n      <li><a href=\\\"browsing#presentation\\\" shape=\\\"rect\\\">Screen magnification (Distinguishing and understanding)</a></li>\\n      <li><a href=\\\"browsing#presentation\\\" shape=\\\"rect\\\">Screen magnifier (Distinguishing and understanding)</a></li>\\n      <li><a href=\\\"browsing#navigation\\\" shape=\\\"rect\\\">Consistency and predictability (Navigating and finding content)</a></li>\\n      <li><a href=\\\"browsing#navigation\\\" shape=\\\"rect\\\">Descriptive titles, headings, and labels (Navigating and finding content)</a></li>\\n      <li><a href=\\\"browsing#navigation\\\" shape=\\\"rect\\\">Helpful error and success messages (Navigating and finding content)</a></li>\\n      <li><a href=\\\"browsing#navigation\\\" shape=\\\"rect\\\">Keyboard navigation (Navigating and finding content)</a></li>\\n      <li><a href=\\\"browsing#navigation\\\" shape=\\\"rect\\\">Skip links (Navigating and finding content)</a></li>\\n      <li><a href=\\\"browsing#navigation\\\" shape=\\\"rect\\\">Visual orientation cues (Navigating and finding content)</a></li>\\n    </ul>\\n    <p class=\\\"listintro\\\"><strong>Accessibility principles:</strong></p>\\n    <ul class=\\\"listwithp\\\">\\n      <li><a href=\\\"principles#alternatives\\\" shape=\\\"rect\\\">Text alternatives for non-text content (Perceivable)</a></li>\\n      <li><a href=\\\"principles#captions\\\" shape=\\\"rect\\\">Captions and other alternatives for multimedia (Perceivable)</a></li>\\n      <li><a href=\\\"principles#adaptable\\\" shape=\\\"rect\\\">Content can be presented in different ways (Perceivable)</a></li>\\n      <li><a href=\\\"principles#distinguishable\\\" shape=\\\"rect\\\">Content is easier to see and hear (Perceivable)</a></li>\\n      <li><a href=\\\"principles#keyboard\\\" shape=\\\"rect\\\">Functionality is available from a keyboard (Operable)</a></li>\\n      <li><a href=\\\"principles#navigable\\\" shape=\\\"rect\\\">Users can easily navigate, find content, and determine where they are (Operable)</a></li>\\n      <li><a href=\\\"principles#readable\\\" shape=\\\"rect\\\">Content is readable and understandable (Understandable)</a></li>\\n      <li><a href=\\\"principles#predictable\\\" shape=\\\"rect\\\">Content appears and operates in predictable ways (Understandable)</a></li>\\n      <li><a href=\\\"principles#tolerant\\\" shape=\\\"rect\\\">Users are helped to avoid and correct mistakes (Understandable)</a></li>\\n      <li><a href=\\\"principles#compatible\\\" shape=\\\"rect\\\">Content is compatible with current and future user tools (Robust)</a></li>\\n    </ul>\\n  </div>\\n  <p class=\\\"totop\\\"><a href=\\\"#toc\\\" shape=\\\"rect\\\">back to page contents</a></p>\\n\\n    </div><div class=\\\"f_controls_accordion f_fileToLoad_accordionControls\\\"><p>\\n<button class=\\\"xk_button_all f_controlsExpand\\\" value=\\\"expand all sections\\\" type=\\\"button\\\">\\n    <img class=\\\"xk_icon\\\" src=\\\"/WAI/images/excol/plus.png\\\" alt=\\\"\\\">\\n    \\n    expand all sections\\n</button>\\n<button class=\\\"xk_button_all f_controlsCollapse\\\" value=\\\"collapse all sections\\\" type=\\\"button\\\" disabled=\\\"disabled\\\">\\n    <img class=\\\"xk_icon\\\" src=\\\"/WAI/images/excol/minus_dis.png\\\" alt=\\\"\\\">\\n    \\n    collapse all sections\\n</button>\\n</p>\\n</div>\\n  </div>\\n  <p>[<a href=\\\"stories\\\" shape=\\\"rect\\\"><strong>Previous Page</strong> - Stories of Web Users</a> | <a href=\\\"#main\\\" shape=\\\"rect\\\">Top of Page</a> | <a href=\\\"browsing\\\" shape=\\\"rect\\\"><strong>Next Page</strong> - Diversity in Web Use</a>]</p>\\n</div>\\n<div id=\\\"footer\\\">\\n<div class=\\\"highlight-version\\\">\\n<p><strong>Editors' Draft: 1 August 2012</strong>\\n<br clear=\\\"none\\\">\\n<strong>This document is an in-progress draft.</strong> If you quote anything from this draft, clearly indicate that it is draft wording.<br clear=\\\"none\\\">\\n<strong>References to this material must include the draft status</strong>, for example:</p>\\n<blockquote><em>How People with Disabilities Use the Web</em>. Shadi Abou-Zahra, ed. Copyright © 2012 W3C® (MIT, ERCIM, Keio). Status: Draft Updated 1 August 2012. http://www.w3.org/WAI/intro/people-use-web/Overview</blockquote>\\n<p>(For more information, see  <a href=\\\"http://www.w3.org/WAI/about/usingWAImaterial.html\\\" shape=\\\"rect\\\">Using WAI Material</a>.)</p>\\n</div>\\n\\n  <p><strong>Status:</strong> <strong>Draft</strong> Updated 1 August 2012.  [<a href=\\\"http://www.w3.org/WAI/EO/changelogs/cl-PWD-Use-Web\\\" shape=\\\"rect\\\">changelog</a>]<br clear=\\\"none\\\">\\n   Editor: Shadi Abou-Zahra. Previous editor: Judy Brewer. <a href=\\\"acknowledgments\\\" shape=\\\"rect\\\">Acknowledgments</a>. Developed with the <a href=\\\"http://www.w3.org/WAI/EO/2008/wai-age-tf\\\" shape=\\\"rect\\\">WAI-AGE Task Force</a> and the <a href=\\\"http://www.w3.org/WAI/EO/\\\" shape=\\\"rect\\\">Education and Outreach Working Group (EOWG)</a>. Developed as part of the <a href=\\\"http://www.w3.org/WAI/WAI-AGE/\\\" shape=\\\"rect\\\">WAI-AGE Project</a><strong> (IST 035015</strong>) funded by the <strong>European Commission under the 6th Framework</strong></p>\\n  <div class=\\\"footer-nav\\\"><p>[<a href=\\\"http://www.w3.org/WAI/sitemap.html\\\" shape=\\\"rect\\\">WAI Site Map</a>] [<a href=\\\"http://www.w3.org/WAI/sitehelp.html\\\" shape=\\\"rect\\\">Help with WAI Website</a>] [<a href=\\\"http://www.w3.org/WAI/search.php\\\" shape=\\\"rect\\\">Search</a>] [<a href=\\\"/WAI/contacts\\\" shape=\\\"rect\\\">Contacting WAI</a>]<br clear=\\\"none\\\">\\n         <strong>Feedback welcome to <a href=\\\"mailto:wai-eo-editors@w3.org\\\" shape=\\\"rect\\\">wai-eo-editors@w3.org</a></strong> (a publicly archived list) or <a href=\\\"mailto:wai@w3.org\\\" shape=\\\"rect\\\">wai@w3.org</a> (a WAI staff-only list).</p></div><div class=\\\"copyright\\\"><p><a rel=\\\"Copyright\\\" href=\\\"/Consortium/Legal/ipr-notice#Copyright\\\" shape=\\\"rect\\\">Copyright</a> © 1994-2013 <a href=\\\"/\\\" shape=\\\"rect\\\"><acronym title=\\\"World Wide Web Consortium\\\">W3C</acronym></a><sup>®</sup> (<a href=\\\"http://www.csail.mit.edu/\\\" shape=\\\"rect\\\"><acronym title=\\\"Massachusetts Institute of Technology\\\">MIT</acronym></a>, <a href=\\\"http://www.ercim.org/\\\" shape=\\\"rect\\\"><acronym title=\\\"European Research Consortium for Informatics and Mathematics\\\">ERCIM</acronym></a>, <a href=\\\"http://www.keio.ac.jp/\\\" shape=\\\"rect\\\">Keio</a>), All Rights Reserved. W3C <a href=\\\"/Consortium/Legal/ipr-notice#Legal_Disclaimer\\\" shape=\\\"rect\\\">liability</a>, <a href=\\\"/Consortium/Legal/ipr-notice#W3C_Trademarks\\\" shape=\\\"rect\\\">trademark</a>, <a rel=\\\"Copyright\\\" href=\\\"/Consortium/Legal/copyright-documents\\\" shape=\\\"rect\\\">document use</a> and <a rel=\\\"Copyright\\\" href=\\\"/Consortium/Legal/copyright-software\\\" shape=\\\"rect\\\">software\\n         licensing</a> rules apply. Your interactions with this site are in\\n         accordance with our <a href=\\\"/Consortium/Legal/privacy-statement#Public\\\" shape=\\\"rect\\\">public</a> and <a href=\\\"/Consortium/Legal/privacy-statement#Members\\\" shape=\\\"rect\\\">Member</a> privacy\\n         statements.</p></div>\\n</div>\\n\\n\\n<input type=\\\"hidden\\\" value=\\\"1\\\"></body></html>\"}",
        "creationDate": 1463497374938,
        "status": "ACTIVE"
      },
      {
        "slugifiedPrimary": "text-classification-model",
        "headers": {
          "took": 164,
          "total": 8,
          "data": [
            {
              "slugifiedPrimary": "access-control-allow-headers",
              "condition": "OPTIONAL",
              "name": "Access-Control-Allow-Headers",
              "description": "",
              "links": {
                "self": {
                  "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57516973e4b028dd938232f3/headers/57516974e4b0faa3d712ad51"
                },
                "model": {
                  "parent": true,
                  "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57516973e4b028dd938232f3"
                }
              },
              "id": "57516974e4b0faa3d712ad51",
              "type": "STRING",
              "creationDate": 1464953204646,
              "value": "Accept-Language, Origin, Accept-Encoding, Authorization, Content-Type, X-Requested-With, Accept, X-CSRFToken, User-Agent, X-WizeScan-Version, X-WizeNote-Version",
              "status": "ACTIVE"
            },
            {
              "slugifiedPrimary": "access-control-allow-methods",
              "condition": "OPTIONAL",
              "name": "Access-Control-Allow-Methods",
              "description": "",
              "links": {
                "self": {
                  "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57516973e4b028dd938232f3/headers/57516974e4b0bd4af84a4214"
                },
                "model": {
                  "parent": true,
                  "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57516973e4b028dd938232f3"
                }
              },
              "id": "57516974e4b0bd4af84a4214",
              "type": "STRING",
              "creationDate": 1464953204841,
              "value": "GET, POST, PUT, DELETE, OPTIONS",
              "status": "ACTIVE"
            },
            {
              "slugifiedPrimary": "cache-control",
              "condition": "OPTIONAL",
              "name": "Cache-Control",
              "description": "",
              "links": {
                "self": {
                  "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57516973e4b028dd938232f3/headers/57516974e4b0debcf7fe5bbc"
                },
                "model": {
                  "parent": true,
                  "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57516973e4b028dd938232f3"
                }
              },
              "id": "57516974e4b0debcf7fe5bbc",
              "type": "STRING",
              "creationDate": 1464953204878,
              "value": "no-cache=\"set-cookie\"",
              "status": "ACTIVE"
            },
            {
              "slugifiedPrimary": "connection",
              "condition": "OPTIONAL",
              "name": "Connection",
              "description": "",
              "links": {
                "self": {
                  "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57516973e4b028dd938232f3/headers/57516974e4b002251bb1e1d3"
                },
                "model": {
                  "parent": true,
                  "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57516973e4b028dd938232f3"
                }
              },
              "id": "57516974e4b002251bb1e1d3",
              "type": "STRING",
              "creationDate": 1464953204854,
              "value": "keep-alive",
              "status": "ACTIVE"
            },
            {
              "slugifiedPrimary": "content-length",
              "condition": "OPTIONAL",
              "name": "Content-Length",
              "description": "",
              "links": {
                "self": {
                  "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57516973e4b028dd938232f3/headers/57516974e4b028dd938232f4"
                },
                "model": {
                  "parent": true,
                  "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57516973e4b028dd938232f3"
                }
              },
              "id": "57516974e4b028dd938232f4",
              "type": "STRING",
              "creationDate": 1464953204882,
              "value": "0",
              "status": "ACTIVE"
            },
            {
              "slugifiedPrimary": "content-type",
              "condition": "OPTIONAL",
              "name": "Content-Type",
              "description": "",
              "links": {
                "self": {
                  "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57516973e4b028dd938232f3/headers/57516974e4b0bd4af84a4215"
                },
                "model": {
                  "parent": true,
                  "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57516973e4b028dd938232f3"
                }
              },
              "id": "57516974e4b0bd4af84a4215",
              "type": "STRING",
              "creationDate": 1464953204863,
              "value": "text/plain; charset=UTF-8",
              "status": "ACTIVE"
            },
            {
              "slugifiedPrimary": "date",
              "condition": "OPTIONAL",
              "name": "Date",
              "description": "",
              "links": {
                "self": {
                  "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57516973e4b028dd938232f3/headers/57516974e4b0f0cd8ceafa18"
                },
                "model": {
                  "parent": true,
                  "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57516973e4b028dd938232f3"
                }
              },
              "id": "57516974e4b0f0cd8ceafa18",
              "type": "STRING",
              "creationDate": 1464953204806,
              "value": "Fri, 03 Jun 2016 11:26:43 GMT",
              "status": "ACTIVE"
            },
            {
              "slugifiedPrimary": "server",
              "condition": "OPTIONAL",
              "name": "Server",
              "description": "",
              "links": {
                "self": {
                  "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57516973e4b028dd938232f3/headers/57516974e4b0a49fce9d5f90"
                },
                "model": {
                  "parent": true,
                  "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57516973e4b028dd938232f3"
                }
              },
              "id": "57516974e4b0a49fce9d5f90",
              "type": "STRING",
              "creationDate": 1464953204984,
              "value": "Mashape/5.0.6",
              "status": "ACTIVE"
            }
          ]
        },
        "updateDate": 1467128951354,
        "format": "JSON",
        "name": "Text Classification model",
        "description": "The audience field describes the reading level of the text on the WizeNoze 5 level scale. The fullText and languageCode fields are the same as the ones in the request.",
        "links": {
          "headers": {
            "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57516973e4b028dd938232f3/headers/"
          },
          "self": {
            "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57516973e4b028dd938232f3"
          },
          "version": {
            "parent": true,
            "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c"
          }
        },
        "id": "57516973e4b028dd938232f3",
        "creationDate": 1464953203971,
        "body": "{\n  \"audience\" : {\n    \"id\" : 29,\n    \"label\" : \"EN1\",\n    \"name\" : \"Reading level 1\",\n    \"description\" : \"Reading level 1\",\n    \"level\" : 1\n  },\n  \"fullText\" : \"This is a sample document. Short texts will not be classified so we send a slightly longer one.\",\n  \"languageCode\" : \"en\"\n}",
        "status": "ACTIVE"
      },
      {
        "slugifiedPrimary": "textrequest",
        "headers": {
          "took": 5,
          "total": 0,
          "data": []
        },
        "updateDate": 1466588150270,
        "name": "TextRequest",
        "format": "JSON",
        "description": "Text request for classification, containing the plain text to be classified and a languageCode (either 'en' for English or 'nl' for Dutch). When the languageCode is not provided the API tries to determine it automatically.",
        "links": {
          "headers": {
            "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57516960e4b01e9dae57e16e/headers/"
          },
          "self": {
            "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57516960e4b01e9dae57e16e"
          },
          "version": {
            "parent": true,
            "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c"
          }
        },
        "id": "57516960e4b01e9dae57e16e",
        "body": "{ \n    \"languageCode\" : \"en\",\n    \"text\" : \"This is a sample document. Short texts will not be classified so we send a slightly longer one.\"\n}",
        "creationDate": 1464953184341,
        "status": "ACTIVE"
      },
      {
        "slugifiedPrimary": "url-classification-model",
        "headers": {
          "took": 51,
          "total": 8,
          "data": [
            {
              "slugifiedPrimary": "access-control-allow-headers",
              "condition": "OPTIONAL",
              "name": "Access-Control-Allow-Headers",
              "description": "",
              "links": {
                "self": {
                  "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57517c41e4b01e9dae57e180/headers/57517c42e4b0debcf7fe5bce"
                },
                "model": {
                  "parent": true,
                  "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57517c41e4b01e9dae57e180"
                }
              },
              "id": "57517c42e4b0debcf7fe5bce",
              "type": "STRING",
              "creationDate": 1464958018145,
              "value": "Accept-Language, Origin, Accept-Encoding, Authorization, Content-Type, X-Requested-With, Accept, X-CSRFToken, User-Agent, X-WizeScan-Version, X-WizeNote-Version",
              "status": "ACTIVE"
            },
            {
              "slugifiedPrimary": "access-control-allow-methods",
              "condition": "OPTIONAL",
              "name": "Access-Control-Allow-Methods",
              "description": "",
              "links": {
                "self": {
                  "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57517c41e4b01e9dae57e180/headers/57517c42e4b002251bb1e1ea"
                },
                "model": {
                  "parent": true,
                  "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57517c41e4b01e9dae57e180"
                }
              },
              "id": "57517c42e4b002251bb1e1ea",
              "type": "STRING",
              "creationDate": 1464958018145,
              "value": "GET, POST, PUT, DELETE, OPTIONS",
              "status": "ACTIVE"
            },
            {
              "slugifiedPrimary": "cache-control",
              "condition": "OPTIONAL",
              "name": "Cache-Control",
              "description": "",
              "links": {
                "self": {
                  "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57517c41e4b01e9dae57e180/headers/57517c42e4b0bd4a7a73a70f"
                },
                "model": {
                  "parent": true,
                  "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57517c41e4b01e9dae57e180"
                }
              },
              "id": "57517c42e4b0bd4a7a73a70f",
              "type": "STRING",
              "creationDate": 1464958018344,
              "value": "no-cache=\"set-cookie\"",
              "status": "ACTIVE"
            },
            {
              "slugifiedPrimary": "connection",
              "condition": "OPTIONAL",
              "name": "Connection",
              "description": "",
              "links": {
                "self": {
                  "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57517c41e4b01e9dae57e180/headers/57517c42e4b002251bb1e1eb"
                },
                "model": {
                  "parent": true,
                  "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57517c41e4b01e9dae57e180"
                }
              },
              "id": "57517c42e4b002251bb1e1eb",
              "type": "STRING",
              "creationDate": 1464958018366,
              "value": "keep-alive",
              "status": "ACTIVE"
            },
            {
              "slugifiedPrimary": "content-length",
              "condition": "OPTIONAL",
              "name": "Content-Length",
              "description": "",
              "links": {
                "self": {
                  "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57517c41e4b01e9dae57e180/headers/57517c42e4b0f0cd8ceafa2e"
                },
                "model": {
                  "parent": true,
                  "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57517c41e4b01e9dae57e180"
                }
              },
              "id": "57517c42e4b0f0cd8ceafa2e",
              "type": "STRING",
              "creationDate": 1464958018394,
              "value": "4505",
              "status": "ACTIVE"
            },
            {
              "slugifiedPrimary": "content-type",
              "condition": "OPTIONAL",
              "name": "Content-Type",
              "description": "",
              "links": {
                "self": {
                  "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57517c41e4b01e9dae57e180/headers/57517c42e4b0a1d871a247b5"
                },
                "model": {
                  "parent": true,
                  "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57517c41e4b01e9dae57e180"
                }
              },
              "id": "57517c42e4b0a1d871a247b5",
              "type": "STRING",
              "creationDate": 1464958018424,
              "value": "application/json;charset=UTF-8",
              "status": "ACTIVE"
            },
            {
              "slugifiedPrimary": "date",
              "condition": "OPTIONAL",
              "name": "Date",
              "description": "",
              "links": {
                "self": {
                  "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57517c41e4b01e9dae57e180/headers/57517c42e4b0d9aabd9f48c2"
                },
                "model": {
                  "parent": true,
                  "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57517c41e4b01e9dae57e180"
                }
              },
              "id": "57517c42e4b0d9aabd9f48c2",
              "type": "STRING",
              "creationDate": 1464958018299,
              "value": "Fri, 03 Jun 2016 12:46:56 GMT",
              "status": "ACTIVE"
            },
            {
              "slugifiedPrimary": "server",
              "condition": "OPTIONAL",
              "name": "Server",
              "description": "",
              "links": {
                "self": {
                  "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57517c41e4b01e9dae57e180/headers/57517c42e4b01e9dae57e181"
                },
                "model": {
                  "parent": true,
                  "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57517c41e4b01e9dae57e180"
                }
              },
              "id": "57517c42e4b01e9dae57e181",
              "type": "STRING",
              "creationDate": 1464958018347,
              "value": "Mashape/5.0.6",
              "status": "ACTIVE"
            }
          ]
        },
        "updateDate": 1465562558886,
        "format": "JSON",
        "name": "URL Classification model",
        "description": "The audience field describes the reading level of the text on the WizeNoze 5 level scale. In the fullText field the result of the HTML content extraction is returned. The language of the document is in the languageCode field.",
        "links": {
          "headers": {
            "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57517c41e4b01e9dae57e180/headers/"
          },
          "self": {
            "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57517c41e4b01e9dae57e180"
          },
          "version": {
            "parent": true,
            "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c"
          }
        },
        "id": "57517c41e4b01e9dae57e180",
        "body": "{\n  \"audience\" : {\n    \"id\" : 33,\n    \"label\" : \"EN5\",\n    \"name\" : \"Reading level 5\",\n    \"description\" : \"Reading level 5\",\n    \"level\" : 5\n  },\n  \"fullText\" : \"But the ancient origins of an animal that is an honorary member of many human families has remained in doubt: We still don’t know where dogs came from.\\nA group of scientists who are in the middle of a grand examination of canine fossils and modern DNA proposed Thursday to turn the whole conversation on its head.\\nSuppose dogs didn’t evolve in one place, they suggested, but two. What if domestication of ancient wolves happened in both Asia and Europe — different wolves, different people?\\nLaurent Frantz and Greger Larson of Oxford University and an international team of scientists who are all part of a dog domestication project run out of Oxford, made the new argument in a paper published in the journal Science. They make clear that although they think their explanation best suits the available evidence, more evidence is needed to confirm it.\\nMore Reporting on Dogs\\nScientists who were not part of the study agreed on the need for more evidence.\\n“It’s a hypothesis,” was as far as Peter Savolainen, a geneticist at the Royal Institute of Technology in Stockholm, would go. Dr. Savolainen has argued strongly, with limited support from other researchers, that dogs originated in East Asia, which, he noted, fits with at least half of the paper’s conclusion.\\nThe notion of a dual origin of dogs is something new for geneticists, but Dr. Larson said archaeologists have long considered the possibility that dogs were domesticated more than once.\\nSeparate domestications have occurred with other animals. Dr. Larson and Keith Dobney of Liverpool University found that wild boars were domesticated twice, once in China and once in Anatolia, part of modern Turkey.\\nFor the new study, Dr. Larson and Dr. Frantz obtained DNA sequences from 59 ancient dogs and a complete genome from a 4,800-year-old-dog fossil found at Newgrange, a well-known archaeological site in County Meath, Ireland. They also analyzed other DNA evidence.\\nSign Up for the Science Times Newsletter\\nEvery week, we'll bring you stories that capture the wonders of the human body, nature and the cosmos.\\nThey found a deep split between two groups — modern East Asian dogs and those from the Middle East and Europe.\\nThey calculated mutation rates based on the known age of the Irish dog and considered archaeological evidence of migrations as well.\\nThey said the overall picture could be explained two ways — by dogs originating in East Asia and then migrating west, or by dogs originating in Europe and Asia. They said there was a lack of archaeological evidence for an early, steady spread of dogs from an Eastern origin. And, they said, dog fossils from Europe dating to 15,000 years ago predated known migrations.\\nSo they concluded that dogs most likely originated both in Europe and in Asia. The Asian dogs then migrated with humans to Western Europe and the Middle East.\\nA version of this article appears in print on June 3, 2016, on page A8 of the New York edition with the headline: On the Origin of Dogs, Scientists See 2 Ancestral Lines. Order Reprints|Today's Paper|Subscribe\",\n  \"languageCode\" : \"en\"\n}",
        "creationDate": 1464958017351,
        "status": "ACTIVE"
      },
      {
        "slugifiedPrimary": "urlrequest",
        "headers": {
          "took": 5,
          "total": 0,
          "data": []
        },
        "updateDate": 1466588167913,
        "name": "URLRequest",
        "format": "JSON",
        "description": "Url request for classification, containing the url that points to the HTML document to be classified and a languageCode (either 'en' for English or 'nl' for Dutch). When the languageCode is not provided the API tries to determine it automatically.",
        "links": {
          "headers": {
            "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57517c38e4b0faa3d712ad69/headers/"
          },
          "self": {
            "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57517c38e4b0faa3d712ad69"
          },
          "version": {
            "parent": true,
            "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c"
          }
        },
        "id": "57517c38e4b0faa3d712ad69",
        "body": "{\n\"languageCode\" : \"en\",\n\"url\" : \"http://www.nytimes.com/2016/06/03/science/dogs-domestication-dna-study.html\"\n}",
        "creationDate": 1464958008102,
        "status": "ACTIVE"
      }
    ]
  },
  "updateDate": "Wed Jun 22 09:38:35 UTC 2016",
  "website": "http://www.wizenoze.com/api-en/",
  "endpoints": {
    "took": 442,
    "total": 3,
    "data": [
      {
        "headers": {
          "took": 26,
          "total": 1,
          "data": [
            {
              "slugifiedPrimary": "content-type",
              "condition": "REQUIRED",
              "updateDate": 1464957865115,
              "name": "Content-Type",
              "links": {
                "endpoint": {
                  "parent": true,
                  "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/endpoints/573b2e40e4b0bd4a7a7380e9"
                },
                "self": {
                  "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/endpoints/573b2e40e4b0bd4a7a7380e9/headers/573b32ede4b0bd4af84a1b75"
                }
              },
              "id": "573b32ede4b0bd4af84a1b75",
              "type": "STRING",
              "creationDate": 1463497453254,
              "value": "application/json",
              "status": "ACTIVE"
            }
          ]
        },
        "routeparameters": {
          "took": 6,
          "total": 0,
          "data": []
        },
        "updateDate": 1466588129679,
        "code": 200,
        "method": "POST",
        "description": "Extract the textual content from an HTML document and classify this into one of 5 reading levels.",
        "creationDate": 1463496256534,
        "slugifiedPrimary": "html-classification",
        "routeregex": "/v1/classify/html",
        "route": "/v1/classify/html",
        "payload": {
          "slugifiedPrimary": "htmlrequest",
          "headers": {
            "took": 6,
            "total": 0,
            "data": []
          },
          "took": 17,
          "updateDate": 1466588129837,
          "name": "HTMLRequest",
          "format": "JSON",
          "description": "HTML request for classification, containing the html to be classified and a languageCode (either 'en' for English or 'nl' for Dutch). When the languageCode is not provided the API tries to determine it automatically.",
          "links": {
            "headers": {
              "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/573b329ee4b0f0cd8cead39e/headers/"
            },
            "self": {
              "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/573b329ee4b0f0cd8cead39e"
            },
            "version": {
              "parent": true,
              "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c"
            }
          },
          "id": "573b329ee4b0f0cd8cead39e",
          "body": "{\n    \"languageCode\":\"en\",\n    \"html\":\"<!--?xml version=\\\"1.0\\\" encoding=\\\"utf-8\\\"?--><!DOCTYPE html PUBLIC \\\"-//W3C//DTD XHTML 1.0 Transitional//EN\\\" \\\"http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd\\\">\\n<html xmlns=\\\"http://www.w3.org/1999/xhtml\\\" xml:lang=\\\"en-US\\\" lang=\\\"en-US\\\"><head>\\n  <meta http-equiv=\\\"Content-Type\\\" content=\\\"text/html; charset=utf-8\\\">\\n  <title>Diversity of Web Users - How People with Disabilities Use the Web</title>\\n  <link rel=\\\"stylesheet\\\" href=\\\"http://www.w3.org/WAI/wai-main.css\\\" type=\\\"text/css\\\">\\n  <link rel=\\\"stylesheet\\\" href=\\\"http://www.w3.org/WAI/style/hMenu.css\\\" type=\\\"text/css\\\">\\n  <!--[if lte IE 7]><link href=\\\"http://www.w3.org/WAI/style/hMenuIE7.css\\\" rel=\\\"stylesheet\\\" type=\\\"text/css\\\" /><![endif]-->\\n  <link href=\\\"http://www.w3.org/WAI/style/excol.css\\\" rel=\\\"stylesheet\\\" type=\\\"text/css\\\">\\n  <script type=\\\"text/javascript\\\" src=\\\"http://www.w3.org/WAI/scripts/excol/excol.js\\\" xml:space=\\\"preserve\\\"></script><link rel=\\\"stylesheet\\\" type=\\\"text/css\\\" href=\\\"/WAI/scripts/excol/accordionInit.css\\\"><script type=\\\"text/javascript\\\" src=\\\"/WAI/scripts/excol/jquery-1.7.1.min.js\\\"></script><script type=\\\"text/javascript\\\" src=\\\"/WAI/scripts/excol/jquery.metools.min.js\\\"></script><script type=\\\"text/javascript\\\" src=\\\"/WAI/scripts/excol/jquery.ba-hashchange.min.js\\\"></script><script type=\\\"text/javascript\\\" src=\\\"/WAI/scripts/excol/jquery.mewidget.hashcontrol.min.js\\\"></script><script type=\\\"text/javascript\\\" src=\\\"/WAI/scripts/excol/jquery.mewidget.panel.min.js\\\"></script><script type=\\\"text/javascript\\\" src=\\\"/WAI/scripts/excol/jquery.mewidget.panelwrapper.min.js\\\"></script><script type=\\\"text/javascript\\\" src=\\\"/WAI/scripts/excol/jquery.mewidget.accordion.min.js\\\"></script>\\n<style type=\\\"text/css\\\" xml:space=\\\"preserve\\\">\\n<!--\\n.highlight-version {\\n  border: solid 1px #630;\\n  color: #630;\\n  background-color: #FFC;\\n  padding: 0.5em;\\n  font-weight: normal;\\n  margin-top: 1em; margin-bottom: 1.5em;\\n  font-size:85%;\\n}\\n.highlight-version blockquote {line-height:100%; margin-top: 0; margin-bottom: 0; padding-top: 0; padding-bottom: 0;}\\n.highlight-version p {margin-top: 0; margin-bottom: 0; padding-top: 0; padding-bottom: 0;}\\n\\nh2.toc { border: 0em; color: #000000; margin-bottom: 0em; }\\nul.toc { list-style: none; margin-left: 1.5em; margin-top: 0.5em; padding: 0em; }\\nul.toc a {  background: url(http://www.w3.org/Icons/downinpage.png) left no-repeat; color: #930; font-weight: bold; padding-left: 1.5em; }\\np.totop { display: block; text-align: right; }\\np.totop a { background: url(http://www.w3.org/Icons/topofpage.png) left no-repeat; padding-left: 1em; }\\np.catchy { border-left: solid 1px #930; padding-left: 1em; }\\n.subhead { font-size: 0.75em; display: block; }\\n-->\\n</style>\\n<link type=\\\"text/css\\\" href=\\\"/WAI/scripts/excol/accordionLoaded.css?anticache=316682\\\" rel=\\\"stylesheet\\\"></head>\\n<body>\\n\\n<div id=\\\"controls\\\"><ul>\\n      <li><a href=\\\"#skip\\\" shape=\\\"rect\\\"><img src=\\\"/Icons/downinpage.png\\\" alt=\\\"\\\"> Skip to Content </a></li>\\n      <li><a href=\\\"/WAI/changedesign.html\\\" shape=\\\"rect\\\"> | Change \\n         text size or colors </a> </li>\\n   </ul></div>\\n\\n<div id=\\\"masthead\\\"><p id=\\\"logos\\\"><a href=\\\"http://www.w3.org/\\\" title=\\\"W3C Home\\\" shape=\\\"rect\\\"><img alt=\\\"W3C logo\\\" src=\\\"/Icons/w3c_home\\\"></a><a href=\\\"http://www.w3.org/WAI/\\\" title=\\\"WAI Home\\\" shape=\\\"rect\\\"><img alt=\\\"Web Accessibility initiative\\\" src=\\\"/WAI/images/wai-temp\\\"></a></p></div>\\n\\n<div id=\\\"tagline\\\"><p>WAI: Strategies, guidelines, resources to make the\\n      Web accessible to people with disabilities</p></div>\\n\\n<div id=\\\"nav\\\"><h2>Site Navigation</h2><p id=\\\"w3cnav\\\"><a href=\\\"http://www.w3.org/\\\">W3C Home</a></p><p id=\\\"subhomenav\\\"><a href=\\\"/WAI/\\\">Web Accessibility Initiative (WAI) Home</a></p><ol id=\\\"nav1\\\" type=\\\"A\\\"><li><a href=\\\"../../gettingstarted/Overview.html\\\" shape=\\\"rect\\\">Getting Started</a></li><li class=\\\"current-nav \\\"><a href=\\\"../../users/Overview.html\\\" shape=\\\"rect\\\">Designing for Inclusion</a><ol type=\\\"1\\\"><li class=\\\"current-nav \\\"><a href=\\\"Overview.html\\\" shape=\\\"rect\\\"> How People with Disabilities Use the Web</a><ol type=\\\"i\\\"><li><a href=\\\"stories.html\\\" shape=\\\"rect\\\">Stories of Web Users</a></li><li id=\\\"current-node\\\" class=\\\"current-nav \\\"><span class=\\\"label\\\"><span id=\\\"current-icon\\\">»</span>Diversity of Web Users</span></li><li><a href=\\\"browsing.html\\\" shape=\\\"rect\\\">Diversity in Web Use</a></li><li><a href=\\\"principles.html\\\" shape=\\\"rect\\\">Accessibility Principles</a></li></ol></li><li><a href=\\\"../../older-users/Overview.php\\\" shape=\\\"rect\\\">Web and Older Users</a></li><li><a href=\\\"../../mobile/Overview.html\\\" shape=\\\"rect\\\">Mobile</a></li></ol></li><li><a href=\\\"../../guid-tech.html\\\" shape=\\\"rect\\\">Guidelines &amp; \\n            Techniques</a></li><li><a href=\\\"../../managing.html\\\" shape=\\\"rect\\\">Planning &amp; Implementing</a></li><li><a href=\\\"../../eval/Overview.html\\\" shape=\\\"rect\\\">Evaluating Accessibility</a></li><li><a href=\\\"../../train.html\\\" shape=\\\"rect\\\">Presentations &amp; Tutorials</a></li><li><a href=\\\"../../about-links.html\\\" shape=\\\"rect\\\">Getting Involved with WAI</a></li></ol><div id=\\\"nav-static\\\"><div class=\\\"nav-discover\\\">\\n         <p><a href=\\\"http://www.w3.org/WAI/yourWAI\\\" shape=\\\"rect\\\"><strong><u>Discover new resources</u></strong> for people with disabilities, policy makers, managers, and you!</a></p>\\n      </div><p class=\\\"translations\\\"><a href=\\\"http://www.w3.org/WAI/wai-translations\\\" shape=\\\"rect\\\"><img src=\\\"http://www.w3.org/WAI/images/translations-med-1\\\" alt=\\\"characters from different languages\\\"> Translations</a></p></div></div>\\n\\n<div id=\\\"main\\\">\\n  <h2 class=\\\"no-display\\\">In-Suite Navigation</h2>\\n  <ul class=\\\"hmenu5\\\">\\n    <li><a href=\\\"Overview\\\" shape=\\\"rect\\\">Over­view</a></li>\\n    <li><a href=\\\"stories\\\" shape=\\\"rect\\\">Sto­ries of Web Users</a></li>\\n    <li class=\\\"hmenuselection\\\"><a shape=\\\"rect\\\">Di­ver­sity of Web Users</a></li>\\n    <li><a href=\\\"browsing\\\" shape=\\\"rect\\\">Di­ver­sity in Web Use</a></li>\\n    <li><a href=\\\"principles\\\" shape=\\\"rect\\\">Ac­ces­si­bil­ity Prin­ci­ples</a></li>\\n  </ul>\\n\\n  <h1>Diversity of Web Users <span class=\\\"subhead\\\"><br clear=\\\"none\\\">[DRAFT] How People with Disabilities Use the Web</span></h1>\\n  <h2 class=\\\"no-display\\\"><a name=\\\"introduction\\\" id=\\\"introduction\\\" shape=\\\"rect\\\">Introduction</a></h2>\\n  <p>This page explores the wide range of diversity of people and abilities, and highlights some of the types of web accessibility barriers that people commonly encounter from poorly designed websites and web tools.</p>\\n  <p><strong>Note:</strong> This page is illustrative and is not intended to be an exhaustive listing of all disabilities and barriers.</p>\\n\\n  <h2 class=\\\"toc\\\"><a name=\\\"toc\\\" id=\\\"toc\\\" shape=\\\"rect\\\">On this page</a></h2>\\n  <ul class=\\\"toc\\\">\\n    <li><a href=\\\"#diversity\\\" shape=\\\"rect\\\">Diversity of abilities</a></li>\\n    <li><a href=\\\"#auditory\\\" shape=\\\"rect\\\">Auditory</a></li>\\n    <li><a href=\\\"#cognitive\\\" shape=\\\"rect\\\">Cognitive and neurological</a></li>\\n    <li><a href=\\\"#physical\\\" shape=\\\"rect\\\">Physical</a></li>\\n    <li><a href=\\\"#speech\\\" shape=\\\"rect\\\">Speech</a></li>\\n    <li><a href=\\\"#visual\\\" shape=\\\"rect\\\">Visual</a></li>\\n  </ul>\\n\\n  <div class=\\\"applicationNaviWrapper\\\">\\n    <div class=\\\"f_controls_accordion f_fileToLoad_accordionControls\\\"><p>\\n<button class=\\\"xk_button_all f_controlsExpand\\\" value=\\\"expand all sections\\\" type=\\\"button\\\">\\n    <img class=\\\"xk_icon\\\" src=\\\"/WAI/images/excol/plus.png\\\" alt=\\\"\\\">\\n    \\n    expand all sections\\n</button>\\n<button class=\\\"xk_button_all f_controlsCollapse\\\" value=\\\"collapse all sections\\\" type=\\\"button\\\" disabled=\\\"disabled\\\">\\n    <img class=\\\"xk_icon\\\" src=\\\"/WAI/images/excol/minus_dis.png\\\" alt=\\\"\\\">\\n    \\n    collapse all sections\\n</button>\\n</p>\\n</div>\\n    <div id=\\\"accordion\\\" class=\\\"accordionWrapper\\\">\\n\\n  <h2><a name=\\\"diversity\\\" id=\\\"diversity\\\" shape=\\\"rect\\\">Diversity of abilities</a></h2>\\n  <p>There are many reasons why people may be experiencing varying degrees of auditory, cognitive, neurological, physical, speech, and visual disabilities. For instance, some may have disabilities from birth, an illness, disease, or accident, or they may develop impairments with age. Some may not consider themselves to have disabilities even if they do experience such functional limitations.</p>\\n  <h3 class=\\\"f_panelHead\\\" style=\\\"cursor: pointer;\\\">More about diversity of abilities<span class=\\\"f_expanderWrapper\\\">\\n    <button class=\\\"f_expand xk_button\\\" value=\\\"expand this section\\\" type=\\\"button\\\" style=\\\"display: inline-block;\\\">\\n        <img alt=\\\"expand this section\\\" src=\\\"/WAI/images/excol/plus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n    <button class=\\\"f_collapse xk_button\\\" value=\\\"collapse this section\\\" type=\\\"button\\\" style=\\\"display: none;\\\">\\n        <img alt=\\\"collapse this section\\\" src=\\\"/WAI/images/excol/minus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n</span>\\n</h3>\\n  <div style=\\\"display: none;\\\">\\n    <p>Each individual is unique. People have diverse abilities, skills, tools, preferences, and expectations that can impact how they use the Web. For instance, consider the following aspects:</p>\\n    <ul class=\\\"listspaced\\\">\\n      <li><strong><a name=\\\"ageing\\\" id=\\\"ageing\\\" shape=\\\"rect\\\">Age-related impairments:</a></strong> Many people develop age-related impairments. While they share the same functional requirements as others with disabilities, sometimes there are significant differences in the use of assistive technologies, the level of computer skills, or in the use of the Web in general.</li>\\n      <li><strong><a name=\\\"combined\\\" id=\\\"combined\\\" shape=\\\"rect\\\">Multiple disabilities:</a></strong> Some people have combinations of different kinds of disabilities, which may limit their approaches for interacting with the Web. For instance, someone who is deaf and has low vision might benefit from captions for audio, but only if these captions have adjustable size and color.</li>\\n      <li><strong><a name=\\\"health\\\" id=\\\"health\\\" shape=\\\"rect\\\">Health conditions:</a></strong> Some people have health conditions that may affect their stamina, dexterity, or concentration. For instance, some may experience fatigue, pain, or other symptoms that could affect their physical use of the computer or limit the duration or extent of their use of the Web.</li>\\n      <li><strong><a name=\\\"changing\\\" id=\\\"changing\\\" shape=\\\"rect\\\">Changing abilities:</a></strong> Some people may be experiencing progressive or recurring functional limitations that impact their use of the Web differently at different times. For instance, some may need particular accessibility features on one day, and others or none on another day, depending on their condition.</li>\\n      <li><strong><a name=\\\"temporary\\\" id=\\\"temporary\\\" shape=\\\"rect\\\">Temporary impairments:</a></strong> Some people may be experiencing temporary impairments such as those that may occur due to an accident, surgery, or medication. They may not know about accessibility solutions, may not know how to use accessibility features, and may be unaware of their own needs.</li>\\n      <li><strong><a name=\\\"situational\\\" id=\\\"situational\\\" shape=\\\"rect\\\">Situational limitations:</a></strong> Some people may be experiencing constraints due to their surrounding or due to other situational aspects. For instance, they may be in a loud environment and unable to hear audio, in bright sunlight and unable to see a screen, or they may not be able to afford some technologies.</li>\\n    </ul>\\n    <p>Websites and web tools that are designed for people with a broad range of abilities benefit everyone, including people without disabilities. It is therefore important to consider the broad diversity of functional needs rather than to categorize people according to medical classifications.</p>\\n  </div>\\n  <p class=\\\"totop\\\"><a href=\\\"#toc\\\" shape=\\\"rect\\\">back to page contents</a></p>\\n\\n  <h2><a name=\\\"auditory\\\" id=\\\"auditory\\\" shape=\\\"rect\\\">Auditory</a></h2>\\n  <p>Auditory disabilities range from mild or moderate hearing impairments in one or both ears (\\\"hard of hearing\\\"), to substantial and uncorrectable impairment of hearing in both ears (\\\"deafness\\\"). Some people with auditory disabilities can hear sounds but sometimes not sufficiently to understand all speech, especially when there is background noise. This includes people using hearing aids or other approaches to improve the sound.</p>\\n  <h3 class=\\\"f_panelHead\\\" style=\\\"cursor: pointer;\\\">More about auditory disabilities<span class=\\\"f_expanderWrapper\\\">\\n    <button class=\\\"f_expand xk_button\\\" value=\\\"expand this section\\\" type=\\\"button\\\" style=\\\"display: inline-block;\\\">\\n        <img alt=\\\"expand this section\\\" src=\\\"/WAI/images/excol/plus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n    <button class=\\\"f_collapse xk_button\\\" value=\\\"collapse this section\\\" type=\\\"button\\\" style=\\\"display: none;\\\">\\n        <img alt=\\\"collapse this section\\\" src=\\\"/WAI/images/excol/minus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n</span>\\n</h3>\\n  <div style=\\\"display: none;\\\">\\n    <p>While the rapid increase of multimedia on the Web provides many new opportunities for people with auditory disabilities, it also poses challenges when content is not designed to be accessible. For instance, while video content can be used to communicate information visually, audio content needs to have alternatives, such as transcripts and captions, so that it is accessible for people with auditory disabilities.</p>\\n    <p>To use the Web effectively, people with auditory disabilities need:</p>\\n    <ul>\\n      <li>Transcripts and captions of audio content, including audio-only content and audio tracks in multimedia</li>\\n      <li>Media players that display captions and provide options to adjust the text size and colors of captions</li>\\n      <li>Options to stop, pause, or adjust the volume of audio content (independently of the system volume)</li>\\n      <li>High-quality foreground audio that is clearly distinguishable from any background noise</li>\\n    </ul>\\n    <p>For some people with auditory disabilities, sign language is the first language and they may not read a written language fluently. Providing important information in sign language and using simpler text that is supplemented by images, graphs, and other illustrations help make web content more understandable to many. However, it is important to remember that not all people with auditory disabilities know sign language.</p>\\n  </div>\\n  <h3 class=\\\"f_panelHead\\\" style=\\\"cursor: pointer;\\\">Examples of auditory disabilities<span class=\\\"f_expanderWrapper\\\">\\n    <button class=\\\"f_expand xk_button\\\" value=\\\"expand this section\\\" type=\\\"button\\\" style=\\\"display: inline-block;\\\">\\n        <img alt=\\\"expand this section\\\" src=\\\"/WAI/images/excol/plus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n    <button class=\\\"f_collapse xk_button\\\" value=\\\"collapse this section\\\" type=\\\"button\\\" style=\\\"display: none;\\\">\\n        <img alt=\\\"collapse this section\\\" src=\\\"/WAI/images/excol/minus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n</span>\\n</h3>\\n  <div style=\\\"display: none;\\\">\\n    <ul>\\n      <li><strong><a name=\\\"hardofhearing\\\" id=\\\"hardofhearing\\\" shape=\\\"rect\\\">Hard of hearing</a></strong> - mild or moderate hearing impairments in one or both ears</li>\\n      <li><strong><a name=\\\"deafness\\\" id=\\\"deafness\\\" shape=\\\"rect\\\">Deafness</a></strong> - substantial, uncorrectable impairment of hearing in both ears</li>\\n      <li><strong><a name=\\\"deafblindness\\\" id=\\\"deafblindness\\\" shape=\\\"rect\\\">Deaf-blindness</a></strong> - substantial, uncorrectable hearing and visual impairments</li>\\n    </ul>\\n  </div>\\n  <h3 class=\\\"f_panelHead\\\" style=\\\"cursor: pointer;\\\">Examples of barriers for people with auditory disabilities<span class=\\\"f_expanderWrapper\\\">\\n    <button class=\\\"f_expand xk_button\\\" value=\\\"expand this section\\\" type=\\\"button\\\" style=\\\"display: inline-block;\\\">\\n        <img alt=\\\"expand this section\\\" src=\\\"/WAI/images/excol/plus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n    <button class=\\\"f_collapse xk_button\\\" value=\\\"collapse this section\\\" type=\\\"button\\\" style=\\\"display: none;\\\">\\n        <img alt=\\\"collapse this section\\\" src=\\\"/WAI/images/excol/minus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n</span>\\n</h3>\\n  <div style=\\\"display: none;\\\">\\n    <ul>\\n      <li>Audio content, such as videos with voices and sounds, without captions or transcripts</li>\\n      <li>Media players that do not display captions and that do not provide volume controls</li>\\n      <li>Media players that do not provide options to adjust the text size and colors for captions</li>\\n      <li>Web-based services, including web applications, that rely on interaction using voice only</li>\\n      <li>Lack of sign language to supplement important information and text that is difficult to read</li>\\n    </ul>\\n  </div>\\n  <h3 class=\\\"f_panelHead\\\" style=\\\"cursor: pointer;\\\">Sections related to auditory disabilities<span class=\\\"f_expanderWrapper\\\">\\n    <button class=\\\"f_expand xk_button\\\" value=\\\"expand this section\\\" type=\\\"button\\\" style=\\\"display: inline-block;\\\">\\n        <img alt=\\\"expand this section\\\" src=\\\"/WAI/images/excol/plus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n    <button class=\\\"f_collapse xk_button\\\" value=\\\"collapse this section\\\" type=\\\"button\\\" style=\\\"display: none;\\\">\\n        <img alt=\\\"collapse this section\\\" src=\\\"/WAI/images/excol/minus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n</span>\\n</h3>\\n  <div style=\\\"display: none;\\\">\\n    <p class=\\\"listintro\\\"><strong>Stories of web users:</strong></p>\\n    <ul class=\\\"listwithp\\\">\\n      <li><a href=\\\"stories#onlinestudent\\\" shape=\\\"rect\\\">Ms. Martinez, Online student who is hard of hearing</a></li>\\n      <li><a href=\\\"stories#teenager\\\" shape=\\\"rect\\\">Ms. Kaseem, Teenager with deaf-blindness</a></li>\\n    </ul>\\n    <p class=\\\"listintro\\\"><strong>Diversity in web use:</strong></p>\\n    <ul class=\\\"listwithp\\\">\\n      <li><a href=\\\"browsing#format\\\" shape=\\\"rect\\\">Captions (Hearing, feeling, and seeing)</a></li>\\n      <li><a href=\\\"browsing#format\\\" shape=\\\"rect\\\">Transcripts (Hearing, feeling, and seeing)</a></li>\\n      <li><a href=\\\"browsing#presentation\\\" shape=\\\"rect\\\">Sign language (Distinguishing and understanding)</a></li>\\n      <li><a href=\\\"browsing#presentation\\\" shape=\\\"rect\\\">Volume control (Distinguishing and understanding)</a></li>\\n    </ul>\\n    <p class=\\\"listintro\\\"><strong>Accessibility principles:</strong></p>\\n    <ul class=\\\"listwithp\\\">\\n      <li><a href=\\\"principles#alternatives\\\" shape=\\\"rect\\\">Text alternatives for non-text content (Perceivable)</a></li>\\n      <li><a href=\\\"principles#captions\\\" shape=\\\"rect\\\">Captions and other alternatives for multimedia (Perceivable)</a></li>\\n      <li><a href=\\\"principles#distinguishable\\\" shape=\\\"rect\\\">Content is easier to see and hear (Perceivable)</a></li>\\n      <li><a href=\\\"principles#time\\\" shape=\\\"rect\\\">Users have enough time to read and use the content (Operable)</a></li>\\n      <li><a href=\\\"principles#readable\\\" shape=\\\"rect\\\">Content is readable and understandable (Understandable)</a></li>\\n    </ul>\\n  </div>\\n  <p class=\\\"totop\\\"><a href=\\\"#toc\\\" shape=\\\"rect\\\">back to page contents</a></p>\\n\\n  <h2><a name=\\\"cognitive\\\" id=\\\"cognitive\\\" shape=\\\"rect\\\">Cognitive and neurological</a></h2>\\n  <p>Cognitive and neurological disabilities involve disorders of any part of the nervous system, including the brain and the peripheral nervous system. This can impact how well people hear, move, see, speak, and understand information. Cognitive and neurological disabilities do not necessarily affect the intelligence of a person.</p>\\n  <h3 class=\\\"f_panelHead\\\" style=\\\"cursor: pointer;\\\">More about cognitive and neurological disabilities<span class=\\\"f_expanderWrapper\\\">\\n    <button class=\\\"f_expand xk_button\\\" value=\\\"expand this section\\\" type=\\\"button\\\" style=\\\"display: inline-block;\\\">\\n        <img alt=\\\"expand this section\\\" src=\\\"/WAI/images/excol/plus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n    <button class=\\\"f_collapse xk_button\\\" value=\\\"collapse this section\\\" type=\\\"button\\\" style=\\\"display: none;\\\">\\n        <img alt=\\\"collapse this section\\\" src=\\\"/WAI/images/excol/minus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n</span>\\n</h3>\\n  <div style=\\\"display: none;\\\">\\n    <p>Computer technologies and the Web provide many opportunities for people with cognitive and neurological disabilities to interact with content and to process information in ways that are more usable to them. For instance, people can navigate web content using different strategies, access information in text, audio, or other formats, and change the presentation of the content according to their individual needs or preferences.</p>\\n    <p>Depending on the particular needs of an individual, people with cognitive and neurological disabilities need:</p>\\n    <ul>\\n      <li>Clearly structured content that facilitates overview and orientation</li>\\n      <li>Consistent labeling of forms, buttons, and other content parts</li>\\n      <li>Predictable link targets, functionality, and overall behavior</li>\\n      <li>Different ways of navigating websites, such as through a hierarchical menu or search option</li>\\n      <li>Options to suppress blinking, flickering, flashing, or otherwise distracting content</li>\\n      <li>Simpler text that is supplemented by images, graphs, and other illustrations</li>\\n    </ul>\\n    <p>People with cognitive and neurological disabilities use different types of web browsing methods, depending on their particular needs. For instance, some people use text-to-speech software to hear the information while reading it visually, or use captions to read the information while hearing it. Some people use tools that resize text and spacing, and customize colors to assist reading, and grammar and spelling tools to assist writing. For these web browsing methods to work, developers need to consider web accessibility requirements which are often shared by people with hearing, physical, speech, or visual disabilities.</p>\\n  </div>\\n  <h3 class=\\\"f_panelHead\\\" style=\\\"cursor: pointer;\\\">Examples of cognitive and neurological disabilities<span class=\\\"f_expanderWrapper\\\">\\n    <button class=\\\"f_expand xk_button\\\" value=\\\"expand this section\\\" type=\\\"button\\\" style=\\\"display: inline-block;\\\">\\n        <img alt=\\\"expand this section\\\" src=\\\"/WAI/images/excol/plus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n    <button class=\\\"f_collapse xk_button\\\" value=\\\"collapse this section\\\" type=\\\"button\\\" style=\\\"display: none;\\\">\\n        <img alt=\\\"collapse this section\\\" src=\\\"/WAI/images/excol/minus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n</span>\\n</h3>\\n  <div style=\\\"display: none;\\\">\\n    <ul>\\n      <li><strong><a name=\\\"adhd\\\" id=\\\"adhd\\\" shape=\\\"rect\\\">Attention deficit hyperactivity disorder (<acronym>ADHD</acronym>)</a></strong> (formerly \\\"attention deficit disorder (<acronym>ADD</acronym>)\\\") - involves difficulty focusing on a single task, difficulty focusing for longer periods, or may be easily distracted</li>\\n      <li><strong><a name=\\\"asd\\\" id=\\\"asd\\\" shape=\\\"rect\\\">Autism spectrum disorder (<acronym>ASD</acronym>)</a></strong> (includes \\\"autism\\\", \\\"Asperger syndrome\\\", and \\\"pervasive developmental disorder (<acronym>PDD</acronym>)) - involves impairments of social communication and interaction abilities, and sometimes restricted habits and interests</li>\\n      <li><strong><a name=\\\"intellectual\\\" id=\\\"intellectual\\\" shape=\\\"rect\\\">Intellectual disabilities</a></strong> (sometimes called \\\"<a href=\\\"#learning\\\" class=\\\"termref\\\" shape=\\\"rect\\\">learning disabilities</a>\\\" in Europe and some other countries, and \\\"developmental disabilities\\\" in other regions) - involves impairments of intelligence, learning more slowly, or difficulty understanding complex concepts. Down syndrome is one among many different causes of intellectual disabilities</li>\\n      <li><strong><a name=\\\"learning\\\" id=\\\"learning\\\" shape=\\\"rect\\\">Learning disabilities</a></strong> - is a functional term rather than a medical condition, and is not uniformly defined. In Europe and some other countries it refers to <a href=\\\"#intellectual\\\" class=\\\"termref\\\" shape=\\\"rect\\\">intellectual disabilities</a>, while in Australia, Canada, the U.S., and some other countries it refers to <a href=\\\"#perceptual\\\" class=\\\"termref\\\" shape=\\\"rect\\\">perceptual disabilities</a>.</li>\\n      <li><strong><a name=\\\"mhealth\\\" id=\\\"mhealth\\\" shape=\\\"rect\\\">Mental health disabilities</a></strong> - includes anxiety, delirium, depression, paranoia, schizophrenia, and many other disorders. These conditions may cause difficulty focusing on information, processing information, or understanding it. In particular medication for these disorders may have side effects including blurred vision, hand tremors, and other impairments</li>\\n      <li><strong><a name=\\\"memory\\\" id=\\\"memory\\\" shape=\\\"rect\\\">Memory impairments</a></strong> - involves limited short-term memory, missing long-term memory, or limited ability to recall language. Dementia is one among many different causes of memory impairments</li>\\n      <li><strong><a name=\\\"ms\\\" id=\\\"ms\\\" shape=\\\"rect\\\">Multiple sclerosis</a></strong> - causes damage to nerve cells in the brain and spinal cord, and can affect auditory, cognitive, physical, or visual abilities, in particular during relapses</li>\\n      <li><strong><a name=\\\"perceptual\\\" id=\\\"perceptual\\\" shape=\\\"rect\\\">Perceptual disabilities</a></strong> (sometimes called \\\"<a href=\\\"#learning\\\" class=\\\"termref\\\" shape=\\\"rect\\\">learning disabilities</a>\\\" in Australia, Canada, the U.S., and some other countries) - involves difficulty processing auditory, tactile, visual, or other sensory information. This can impact reading (dyslexia), writing (dysgraphia), processing numbers (dyscalculia), or spatial and temporal orientation</li>\\n      <li><strong><a name=\\\"seizure\\\" id=\\\"seizure\\\" shape=\\\"rect\\\">Seizure disorders</a></strong> - includes different types of epilepsy and migraines, which may be in reaction to visual flickering or audio signals at certain frequencies or patterns</li>\\n    </ul>\\n  </div>\\n  <h3 class=\\\"f_panelHead\\\" style=\\\"cursor: pointer;\\\">Examples of barriers for people with cognitive and neurological disabilities<span class=\\\"f_expanderWrapper\\\">\\n    <button class=\\\"f_expand xk_button\\\" value=\\\"expand this section\\\" type=\\\"button\\\" style=\\\"display: inline-block;\\\">\\n        <img alt=\\\"expand this section\\\" src=\\\"/WAI/images/excol/plus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n    <button class=\\\"f_collapse xk_button\\\" value=\\\"collapse this section\\\" type=\\\"button\\\" style=\\\"display: none;\\\">\\n        <img alt=\\\"collapse this section\\\" src=\\\"/WAI/images/excol/minus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n</span>\\n</h3>\\n  <div style=\\\"display: none;\\\">\\n    <ul>\\n      <li>Complex navigation mechanisms and page layouts that are difficult to understand and use</li>\\n      <li>Complex sentences that are difficult to read and unusual words that are difficult to understand</li>\\n      <li>Long passages of text without images, graphs, or other illustrations to highlight the context</li>\\n      <li>Moving, blinking, or flickering content, and background audio that cannot be turned off</li>\\n      <li>Web browsers and media players that do not provide mechanisms to suppress animations and audio</li>\\n      <li>Visual page designs that cannot be adapted using web browser controls or custom style sheets</li>\\n    </ul>\\n  </div>\\n  <h3 class=\\\"f_panelHead\\\" style=\\\"cursor: pointer;\\\">Sections related to cognitive and neurological disabilities<span class=\\\"f_expanderWrapper\\\">\\n    <button class=\\\"f_expand xk_button\\\" value=\\\"expand this section\\\" type=\\\"button\\\" style=\\\"display: inline-block;\\\">\\n        <img alt=\\\"expand this section\\\" src=\\\"/WAI/images/excol/plus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n    <button class=\\\"f_collapse xk_button\\\" value=\\\"collapse this section\\\" type=\\\"button\\\" style=\\\"display: none;\\\">\\n        <img alt=\\\"collapse this section\\\" src=\\\"/WAI/images/excol/minus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n</span>\\n</h3>\\n  <div style=\\\"display: none;\\\">\\n    <p class=\\\"listintro\\\"><strong>Stories of web users:</strong></p>\\n    <ul class=\\\"listwithp\\\">\\n      <li><a href=\\\"stories#classroomstudent\\\" shape=\\\"rect\\\">Ms. Olsen, Classroom student with attention deficit hyperactivity disorder (<acronym>ADHD</acronym>) and dyslexia</a></li>\\n      <li><a href=\\\"stories#retiree\\\" shape=\\\"rect\\\">Mr. Yunus, Retiree with low vision, hand tremor, and mild short-term memory loss</a></li>\\n      <li><a href=\\\"stories#supermarketassistant\\\" shape=\\\"rect\\\">Mr. Sands, Supermarket assistant with Down syndrome</a></li>\\n    </ul>\\n    <p class=\\\"listintro\\\"><strong>Diversity in web use:</strong></p>\\n    <ul class=\\\"listwithp\\\">\\n      <li><a href=\\\"browsing#format\\\" shape=\\\"rect\\\">Captions (Hearing, feeling, and seeing)</a></li>\\n      <li><a href=\\\"browsing#format\\\" shape=\\\"rect\\\">Screen reader (Hearing, feeling, and seeing)</a></li>\\n      <li><a href=\\\"browsing#format\\\" shape=\\\"rect\\\">Text-to-speech (Hearing, feeling, and seeing)</a></li>\\n      <li><a href=\\\"browsing#format\\\" shape=\\\"rect\\\">Voice browser (Hearing, feeling, and seeing)</a></li>\\n      <li><a href=\\\"browsing#presentation\\\" shape=\\\"rect\\\">Document outline (Distinguishing and understanding)</a></li>\\n      <li><a href=\\\"browsing#presentation\\\" shape=\\\"rect\\\">Easy-to-read text (Distinguishing and understanding)</a></li>\\n      <li><a href=\\\"browsing#presentation\\\" shape=\\\"rect\\\">Pop-up and animations blockers (Distinguishing and understanding)</a></li>\\n      <li><a href=\\\"browsing#presentation\\\" shape=\\\"rect\\\">Progressive disclosure (Distinguishing and understanding)</a></li>\\n      <li><a href=\\\"browsing#presentation\\\" shape=\\\"rect\\\">Reading assistants (Distinguishing and understanding)</a></li>\\n      <li><a href=\\\"browsing#presentation\\\" shape=\\\"rect\\\">Reduced interface (Distinguishing and understanding)</a></li>\\n      <li><a href=\\\"browsing#presentation\\\" shape=\\\"rect\\\">Symbols (Distinguishing and understanding)</a></li>\\n      <li><a href=\\\"browsing#interaction\\\" shape=\\\"rect\\\">On-screen keyboard (Typing, writing, and clicking)</a></li>\\n      <li><a href=\\\"browsing#interaction\\\" shape=\\\"rect\\\">Spelling and grammar tools (Typing, writing, and clicking)</a></li>\\n      <li><a href=\\\"browsing#interaction\\\" shape=\\\"rect\\\">Word prediction (Typing, writing, and clicking)</a></li>\\n      <li><a href=\\\"browsing#navigation\\\" shape=\\\"rect\\\">Bookmarks and history (Navigating and finding content)</a></li>\\n      <li><a href=\\\"browsing#navigation\\\" shape=\\\"rect\\\">Consistency and predictability (Navigating and finding content)</a></li>\\n      <li><a href=\\\"browsing#navigation\\\" shape=\\\"rect\\\">Descriptive titles, headings, and labels (Navigating and finding content)</a></li>\\n      <li><a href=\\\"browsing#navigation\\\" shape=\\\"rect\\\">Helpful error and success messages (Navigating and finding content)</a></li>\\n      <li><a href=\\\"browsing#navigation\\\" shape=\\\"rect\\\">Keyword search (Navigating and finding content)</a></li>\\n      <li><a href=\\\"browsing#navigation\\\" shape=\\\"rect\\\">Multiple navigation mechanisms (Navigating and finding content)</a></li>\\n      <li><a href=\\\"browsing#navigation\\\" shape=\\\"rect\\\">Page maps (Navigating and finding content)</a></li>\\n      <li><a href=\\\"browsing#navigation\\\" shape=\\\"rect\\\">Pictorial links (Navigating and finding content)</a></li>\\n    </ul>\\n    <p class=\\\"listintro\\\"><strong>Accessibility principles:</strong></p>\\n    <ul class=\\\"listwithp\\\">\\n      <li><a href=\\\"principles#alternatives\\\" shape=\\\"rect\\\">Text alternatives for non-text content (Perceivable)</a></li>\\n      <li><a href=\\\"principles#captions\\\" shape=\\\"rect\\\">Captions and other alternatives for multimedia (Perceivable)</a></li>\\n      <li><a href=\\\"principles#adaptable\\\" shape=\\\"rect\\\">Content can be presented in different ways (Perceivable)</a></li>\\n      <li><a href=\\\"principles#distinguishable\\\" shape=\\\"rect\\\">Content is easier to see and hear (Perceivable)</a></li>\\n      <li><a href=\\\"principles#time\\\" shape=\\\"rect\\\">Users have enough time to read and use the content (Operable)</a></li>\\n      <li><a href=\\\"principles#safe\\\" shape=\\\"rect\\\">Content does not cause seizures (Operable)</a></li>\\n      <li><a href=\\\"principles#navigable\\\" shape=\\\"rect\\\">Users can easily navigate, find content, and determine where they are (Operable)</a></li>\\n      <li><a href=\\\"principles#readable\\\" shape=\\\"rect\\\">Content is readable and understandable (Understandable)</a></li>\\n      <li><a href=\\\"principles#predictable\\\" shape=\\\"rect\\\">Content appears and operates in predictable ways (Understandable)</a></li>\\n      <li><a href=\\\"principles#tolerant\\\" shape=\\\"rect\\\">Users are helped to avoid and correct mistakes (Understandable)</a></li>\\n      <li><a href=\\\"principles#compatible\\\" shape=\\\"rect\\\">Content is compatible with current and future user tools (Robust)</a></li>\\n    </ul>\\n  </div>\\n  <p class=\\\"totop\\\"><a href=\\\"#toc\\\" shape=\\\"rect\\\">back to page contents</a></p>\\n\\n  <h2><a name=\\\"physical\\\" id=\\\"physical\\\" shape=\\\"rect\\\">Physical</a></h2>\\n  <p>Physical disabilities (sometimes called \\\"motor disabilities\\\") include weakness, limitations of muscular control (such as involuntary movements including tremors, lack of coordination, or paralysis), limitations of sensation, joint problems (such as arthritis), pain that impedes movement, or missing limbs.</p>\\n  <h3 class=\\\"f_panelHead\\\" style=\\\"cursor: pointer;\\\">More about physical disabilities<span class=\\\"f_expanderWrapper\\\">\\n    <button class=\\\"f_expand xk_button\\\" value=\\\"expand this section\\\" type=\\\"button\\\" style=\\\"display: inline-block;\\\">\\n        <img alt=\\\"expand this section\\\" src=\\\"/WAI/images/excol/plus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n    <button class=\\\"f_collapse xk_button\\\" value=\\\"collapse this section\\\" type=\\\"button\\\" style=\\\"display: none;\\\">\\n        <img alt=\\\"collapse this section\\\" src=\\\"/WAI/images/excol/minus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n</span>\\n</h3>\\n  <div style=\\\"display: none;\\\">\\n    <p>To use the Web, people with physical disabilities often use specialized hardware and software such as:</p>\\n    <ul>\\n      <li>Ergonomic or specially designed keyboard or mouse</li>\\n      <li>Head pointer, mouth stick, and other aids to help typing</li>\\n      <li>On-screen keyboard with trackball, joystick, and switches to operate it</li>\\n      <li>Voice recognition, eye tracking, and other approaches for hands-free interaction</li>\\n    </ul>\\n    <p>People with physical disabilities may be using a mouse or mouse-like device only, or keyboard or keyboard-like device only to operate the computer. People with physical disabilities need full keyboard support for all functionality provided on a web page. They may need more time to type, click, or carry out other interaction, and they may type single keystrokes in sequence rather than typing simultaneous keystrokes (\\\"chording\\\") to activate commands. This includes commands for special characters, shortcut keys, or to active menu items.</p>\\n    <p>People with physical disabilities often have trouble clicking small areas and are more likely to make mistakes in typing or clicking. Providing large clickable areas, enough time to complete tasks, and error correction options for forms are important design aspects. Other important design aspects include providing visible indicators of the current focus, and mechanisms to skip over blocks, such as over page headers or navigation bars. Many of these requirements are shared by people with cognitive, neurological, and visual disabilities.</p>\\n  </div>\\n  <h3 class=\\\"f_panelHead\\\" style=\\\"cursor: pointer;\\\">Examples of physical disabilities<span class=\\\"f_expanderWrapper\\\">\\n    <button class=\\\"f_expand xk_button\\\" value=\\\"expand this section\\\" type=\\\"button\\\" style=\\\"display: inline-block;\\\">\\n        <img alt=\\\"expand this section\\\" src=\\\"/WAI/images/excol/plus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n    <button class=\\\"f_collapse xk_button\\\" value=\\\"collapse this section\\\" type=\\\"button\\\" style=\\\"display: none;\\\">\\n        <img alt=\\\"collapse this section\\\" src=\\\"/WAI/images/excol/minus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n</span>\\n</h3>\\n  <div style=\\\"display: none;\\\">\\n    <ul>\\n      <li><strong><a name=\\\"limbs\\\" id=\\\"limbs\\\" shape=\\\"rect\\\">Amputation and deformity</a></strong> - includes missing fingers, limbs, or other parts of the human body</li>\\n      <li><strong><a name=\\\"arthritis\\\" id=\\\"arthritis\\\" shape=\\\"rect\\\">Arthritis</a></strong> (previously called \\\"<a href=\\\"#rheumatism\\\" class=\\\"termref\\\" shape=\\\"rect\\\">rheumatism</a>\\\") - inflammation, degeneration, or damage of the joints</li>\\n      <li><strong><a name=\\\"fibromyalgia\\\" id=\\\"fibromyalgia\\\" shape=\\\"rect\\\">Fibromyalgia</a></strong> (previously called \\\"<a href=\\\"#rheumatism\\\" class=\\\"termref\\\" shape=\\\"rect\\\">rheumatism</a>\\\") - chronic pain of muscle and connective tissues</li>\\n      <li><strong><a name=\\\"rheumatism\\\" id=\\\"rheumatism\\\" shape=\\\"rect\\\">Rheumatism</a></strong> - typically refers to <a href=\\\"#arthritis\\\" class=\\\"termref\\\" shape=\\\"rect\\\">arthritis</a> and other causes for bone or joint pain, and sometimes to <a href=\\\"#fibromyalgia\\\" class=\\\"termref\\\" shape=\\\"rect\\\">fibromyalgia</a> and other causes for muscular and other soft tissue pain</li>\\n      <li><strong><a name=\\\"dexterity\\\" id=\\\"dexterity\\\" shape=\\\"rect\\\">Reduced dexterity</a></strong> - is a functional term (rather than a medical condition) that describes the ability to control the hand, such as hand-eye coordination of people with cognitive and neurological disabilities</li>\\n      <li><strong><a name=\\\"md\\\" id=\\\"md\\\" shape=\\\"rect\\\">Muscular dystrophy</a></strong> - progressive weakness and degeneration of muscles, including in arms and hands</li>\\n      <li><strong><a name=\\\"rsi\\\" id=\\\"rsi\\\" shape=\\\"rect\\\">Repetitive stress injury (<acronym>RSI</acronym>)</a></strong> (also called \\\"repetitive motion disorder\\\" (<acronym>RMD</acronym>) and \\\"cumulative trauma disorder\\\" (<acronym>CT</acronym>)) - involves injuries to the musculoskeletal system (bones, joints, tendons, and other connective tissues) and the nervous system from repetitive tasks and damage</li>\\n      <li><strong><a name=\\\"tremor\\\" id=\\\"tremor\\\" shape=\\\"rect\\\">Tremor and spasms</a></strong> - involuntary movement or muscle contraction, including short twitches, and continual or rhythmic muscle contractions</li>\\n      <li><strong><a name=\\\"quadriplegia\\\" id=\\\"quadriplegia\\\" shape=\\\"rect\\\">Quadriplegia</a></strong> (sometimes called \\\"tetraplegia\\\") - partial or total paralysis (includes motor control and sensation) to all four body limbs (legs and arms) and the torso</li>\\n    </ul>\\n  </div>\\n  <h3 class=\\\"f_panelHead\\\" style=\\\"cursor: pointer;\\\">Examples of barriers for people with physical disabilities<span class=\\\"f_expanderWrapper\\\">\\n    <button class=\\\"f_expand xk_button\\\" value=\\\"expand this section\\\" type=\\\"button\\\" style=\\\"display: inline-block;\\\">\\n        <img alt=\\\"expand this section\\\" src=\\\"/WAI/images/excol/plus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n    <button class=\\\"f_collapse xk_button\\\" value=\\\"collapse this section\\\" type=\\\"button\\\" style=\\\"display: none;\\\">\\n        <img alt=\\\"collapse this section\\\" src=\\\"/WAI/images/excol/minus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n</span>\\n</h3>\\n  <div style=\\\"display: none;\\\">\\n    <ul>\\n      <li>Websites, web browsers, and authoring tools that do not provide full keyboard support</li>\\n      <li>Insufficient time limits to respond or to complete tasks, such as to fill out online forms</li>\\n      <li>Controls, including links with images of text, that do not have equivalent text alternatives</li>\\n      <li>Missing visual and non-visual orientation cues, page structure, and other navigational aids</li>\\n      <li>Inconsistent, unpredictable, and overly complex navigation mechanisms and page functions</li>\\n    </ul>\\n  </div>\\n  <h3 class=\\\"f_panelHead\\\" style=\\\"cursor: pointer;\\\">Sections related to physical disabilities<span class=\\\"f_expanderWrapper\\\">\\n    <button class=\\\"f_expand xk_button\\\" value=\\\"expand this section\\\" type=\\\"button\\\" style=\\\"display: inline-block;\\\">\\n        <img alt=\\\"expand this section\\\" src=\\\"/WAI/images/excol/plus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n    <button class=\\\"f_collapse xk_button\\\" value=\\\"collapse this section\\\" type=\\\"button\\\" style=\\\"display: none;\\\">\\n        <img alt=\\\"collapse this section\\\" src=\\\"/WAI/images/excol/minus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n</span>\\n</h3>\\n  <div style=\\\"display: none;\\\">\\n    <p class=\\\"listintro\\\"><strong>Stories of web users:</strong></p>\\n    <ul class=\\\"listwithp\\\">\\n      <li><a href=\\\"stories#reporter\\\" shape=\\\"rect\\\">Mr. Jones, Reporter with repetitive stress injury</a></li>\\n      <li><a href=\\\"stories#retiree\\\" shape=\\\"rect\\\">Mr. Yunus, Retiree with low vision, hand tremor, and mild short-term memory loss</a></li>\\n    </ul>\\n    <p class=\\\"listintro\\\"><strong>Diversity in web use:</strong></p>\\n    <ul class=\\\"listwithp\\\">\\n      <li><a href=\\\"browsing#format\\\" shape=\\\"rect\\\">Text-to-speech (Hearing, feeling, and seeing)</a></li>\\n      <li><a href=\\\"browsing#format\\\" shape=\\\"rect\\\">Voice browser (Hearing, feeling, and seeing)</a></li>\\n      <li><a href=\\\"browsing#interaction\\\" shape=\\\"rect\\\">Accelerators (Typing, writing, and clicking)</a></li>\\n      <li><a href=\\\"browsing#interaction\\\" shape=\\\"rect\\\">Alternative keyboard and mouse (Typing, writing, and clicking)</a></li>\\n      <li><a href=\\\"browsing#interaction\\\" shape=\\\"rect\\\">Eye tracking (Typing, writing, and clicking)</a></li>\\n      <li><a href=\\\"browsing#interaction\\\" shape=\\\"rect\\\">Keyboard customization (Typing, writing, and clicking)</a></li>\\n      <li><a href=\\\"browsing#interaction\\\" shape=\\\"rect\\\">Keyboard and mouse filters (Typing, writing, and clicking)</a></li>\\n      <li><a href=\\\"browsing#interaction\\\" shape=\\\"rect\\\">Mouse customization (Typing, writing, and clicking)</a></li>\\n      <li><a href=\\\"browsing#interaction\\\" shape=\\\"rect\\\">On-screen keyboard (Typing, writing, and clicking)</a></li>\\n      <li><a href=\\\"browsing#interaction\\\" shape=\\\"rect\\\">Voice recognition (Typing, writing, and clicking)</a></li>\\n      <li><a href=\\\"browsing#interaction\\\" shape=\\\"rect\\\">Word prediction (Typing, writing, and clicking)</a></li>\\n      <li><a href=\\\"browsing#navigation\\\" shape=\\\"rect\\\">Keyboard navigation (Navigating and finding content)</a></li>\\n    </ul>\\n    <p class=\\\"listintro\\\"><strong>Accessibility principles:</strong></p>\\n    <ul class=\\\"listwithp\\\">\\n      <li><a href=\\\"principles#alternatives\\\" shape=\\\"rect\\\">Text alternatives for non-text content (Perceivable)</a></li>\\n      <li><a href=\\\"principles#adaptable\\\" shape=\\\"rect\\\">Content can be presented in different ways (Perceivable)</a></li>\\n      <li><a href=\\\"principles#keyboard\\\" shape=\\\"rect\\\">Functionality is available from a keyboard (Operable)</a></li>\\n      <li><a href=\\\"principles#time\\\" shape=\\\"rect\\\">Users have enough time to read and use the content (Operable)</a></li>\\n      <li><a href=\\\"principles#navigable\\\" shape=\\\"rect\\\">Users can easily navigate, find content, and determine where they are (Operable)</a></li>\\n      <li><a href=\\\"principles#predictable\\\" shape=\\\"rect\\\">Content appears and operates in predictable ways (Understandable)</a></li>\\n      <li><a href=\\\"principles#tolerant\\\" shape=\\\"rect\\\">Users are helped to avoid and correct mistakes (Understandable)</a></li>\\n      <li><a href=\\\"principles#compatible\\\" shape=\\\"rect\\\">Content is compatible with different technologies (Robust)</a></li>\\n      <li><a href=\\\"principles#compatible\\\" shape=\\\"rect\\\">Content is compatible with current and future user tools (Robust)</a></li>\\n    </ul>\\n  </div>\\n  <p class=\\\"totop\\\"><a href=\\\"#toc\\\" shape=\\\"rect\\\">back to page contents</a></p>\\n\\n  <h2><a name=\\\"speech\\\" id=\\\"speech\\\" shape=\\\"rect\\\">Speech</a></h2>\\n  <p>Speech disabilities include difficulty producing speech that is recognizable by others or by voice recognition software. For instance, the loudness or clarity of someone's voice might be difficult to understand.</p>\\n  <h3 class=\\\"f_panelHead\\\" style=\\\"cursor: pointer;\\\">More about speech disabilities<span class=\\\"f_expanderWrapper\\\">\\n    <button class=\\\"f_expand xk_button\\\" value=\\\"expand this section\\\" type=\\\"button\\\" style=\\\"display: inline-block;\\\">\\n        <img alt=\\\"expand this section\\\" src=\\\"/WAI/images/excol/plus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n    <button class=\\\"f_collapse xk_button\\\" value=\\\"collapse this section\\\" type=\\\"button\\\" style=\\\"display: none;\\\">\\n        <img alt=\\\"collapse this section\\\" src=\\\"/WAI/images/excol/minus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n</span>\\n</h3>\\n  <div style=\\\"display: none;\\\">\\n    <p>People with speech disabilities encounter barriers with voice-based services, such as automated web-based hotlines and web applications that are operated using voice commands. To use services that rely on voice, people with speech disabilities need alternative modes for interaction such as a text-based chat to interact with hotline representatives or keyboard commands to operate web applications. Also, websites that provide telephone numbers as the only means of communicating with an organizations pose barriers for people with speech disabilities. Alternative means of communication include e-mail and feedback forms.</p>\\n  </div>\\n  <h3 class=\\\"f_panelHead\\\" style=\\\"cursor: pointer;\\\">Examples of speech disabilities<span class=\\\"f_expanderWrapper\\\">\\n    <button class=\\\"f_expand xk_button\\\" value=\\\"expand this section\\\" type=\\\"button\\\" style=\\\"display: inline-block;\\\">\\n        <img alt=\\\"expand this section\\\" src=\\\"/WAI/images/excol/plus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n    <button class=\\\"f_collapse xk_button\\\" value=\\\"collapse this section\\\" type=\\\"button\\\" style=\\\"display: none;\\\">\\n        <img alt=\\\"collapse this section\\\" src=\\\"/WAI/images/excol/minus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n</span>\\n</h3>\\n  <div style=\\\"display: none;\\\">\\n    <ul>\\n      <li><strong><a name=\\\"apraxia\\\" id=\\\"apraxia\\\" shape=\\\"rect\\\">Apraxia of speech (AOS)</a></strong> - includes inconsistent articulation and production of speech sounds, and errors producing sounds in the correct order so that spoken words or phrases become difficult to understand.</li>\\n      <li><strong><a name=\\\"cluttering\\\" id=\\\"cluttering\\\" shape=\\\"rect\\\">Cluttering</a></strong> (also called \\\"tachyphemia\\\") - includes increased speaking rate, incorrect rhythm, intonation, and co-articulation of sounds, and other influency in speech that is sometimes similar to <a href=\\\"#stuttering\\\" class=\\\"termref\\\" shape=\\\"rect\\\">stuttering</a>.</li>\\n      <li><strong><a name=\\\"dysarthria\\\" id=\\\"dysarthria\\\" shape=\\\"rect\\\">Dysarthria</a></strong> - involves weakness or complete paralysis of muscles that are necessary to produce speech, including lips, lungs, throat, tongue, and others.</li>\\n      <li><strong><a name=\\\"sound\\\" id=\\\"sound\\\" shape=\\\"rect\\\">Speech sound disorder</a></strong> - involves difficulty or inability to produce certain sounds or patterns of sound and sometimes results in addition, distortion, omission, or substitution of such sounds with others.</li>\\n      <li><strong><a name=\\\"stuttering\\\" id=\\\"stuttering\\\" shape=\\\"rect\\\">Stuttering</a></strong> - includes influency in speech, repetition of individual sounds or entire words and phrases, and misplacement or prolongation of pauses and sounds during speech that is different from <a href=\\\"#cluttering\\\" class=\\\"termref\\\" shape=\\\"rect\\\">cluttering</a>.</li>\\n      <li><strong><a name=\\\"muteness\\\" id=\\\"muteness\\\" shape=\\\"rect\\\">Muteness</a></strong> (also called \\\"mutism\\\") - involves inability to speak due to different reasons such as anxiety, brain injuries, or inability to hear and learn speech.</li>\\n    </ul>\\n  </div>\\n  <h3 class=\\\"f_panelHead\\\" style=\\\"cursor: pointer;\\\">Examples of barriers for people with speech disabilities<span class=\\\"f_expanderWrapper\\\">\\n    <button class=\\\"f_expand xk_button\\\" value=\\\"expand this section\\\" type=\\\"button\\\" style=\\\"display: inline-block;\\\">\\n        <img alt=\\\"expand this section\\\" src=\\\"/WAI/images/excol/plus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n    <button class=\\\"f_collapse xk_button\\\" value=\\\"collapse this section\\\" type=\\\"button\\\" style=\\\"display: none;\\\">\\n        <img alt=\\\"collapse this section\\\" src=\\\"/WAI/images/excol/minus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n</span>\\n</h3>\\n  <div style=\\\"display: none;\\\">\\n    <ul>\\n      <li>Web-based services, including web applications, that rely on interaction using voice only</li>\\n      <li>Websites offering phone numbers as the only way to communicate with the organization</li>\\n    </ul>\\n  </div>\\n  <p class=\\\"totop\\\"><a href=\\\"#toc\\\" shape=\\\"rect\\\">back to page contents</a></p>\\n\\n  <h2><a name=\\\"visual\\\" id=\\\"visual\\\" shape=\\\"rect\\\">Visual</a></h2>\\n  <p>Visual disabilities range from mild or moderate vision impairments in one or both eyes (\\\"low vision\\\" or \\\"partial sight\\\"), to substantial and uncorrectable loss of vision in both eyes (\\\"blindness\\\"). Some people have reduced or lack of sensitivity to certain colors (\\\"color blindness\\\"), or increased sensitivity towards excessive brightness in colors. These variations in perception of colors and brightness can be independent of the visual acuity.</p>\\n  <h3 class=\\\"f_panelHead\\\" style=\\\"cursor: pointer;\\\">More about visual disabilities<span class=\\\"f_expanderWrapper\\\">\\n    <button class=\\\"f_expand xk_button\\\" value=\\\"expand this section\\\" type=\\\"button\\\" style=\\\"display: inline-block;\\\">\\n        <img alt=\\\"expand this section\\\" src=\\\"/WAI/images/excol/plus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n    <button class=\\\"f_collapse xk_button\\\" value=\\\"collapse this section\\\" type=\\\"button\\\" style=\\\"display: none;\\\">\\n        <img alt=\\\"collapse this section\\\" src=\\\"/WAI/images/excol/minus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n</span>\\n</h3>\\n  <div style=\\\"display: none;\\\">\\n    <p>People with visual disabilities typically rely on changing the presentation of web content into forms that are more usable for their particular needs. For example by:</p>\\n    <ul>\\n      <li>Enlarging or reducing text size and images</li>\\n      <li>Customizing settings for fonts, colors, and spacing</li>\\n      <li>Listening to text-to-speech synthesis of the content</li>\\n      <li>Listening to audio descriptions of video in multimedia</li>\\n      <li>Reading text using refreshable braille (small dots that are raised and lowered to display characters that are read by scanning over the raised dots using the fingertips)</li>\\n    </ul>\\n    <p>For these web browsing methods to work, developers need to ensure that the presentation of web content is independent of its underlying structure, and that the structure is correctly coded so that it can processed by software and presented in different ways. For instance, some people do not see the content and need lists, headings, tables, and other page structures to be properly coded so that they can be identified by software.</p>\\n    <p>Some people are only seeing small portions of the content at a time or are perceiving the colors and design differently. Some people are using customized fonts, colors, and spacing to make the content more readable, or they are navigating through the content using keyboard only because they cannot see the mouse-pointer. An accessible design supports different presentations of the web content, and different ways for interaction.</p>\\n  </div>\\n  <h3 class=\\\"f_panelHead\\\" style=\\\"cursor: pointer;\\\">Examples of visual disabilities<span class=\\\"f_expanderWrapper\\\">\\n    <button class=\\\"f_expand xk_button\\\" value=\\\"expand this section\\\" type=\\\"button\\\" style=\\\"display: inline-block;\\\">\\n        <img alt=\\\"expand this section\\\" src=\\\"/WAI/images/excol/plus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n    <button class=\\\"f_collapse xk_button\\\" value=\\\"collapse this section\\\" type=\\\"button\\\" style=\\\"display: none;\\\">\\n        <img alt=\\\"collapse this section\\\" src=\\\"/WAI/images/excol/minus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n</span>\\n</h3>\\n  <div style=\\\"display: none;\\\">\\n    <ul>\\n      <li><strong><a name=\\\"colorblindness\\\" id=\\\"colorblindness\\\" shape=\\\"rect\\\">Color blindness</a></strong> - includes difficulty distinguishing between colors such as between red and green, or between yellow and blue, and sometimes inability to perceive any color</li>\\n      <li><strong><a name=\\\"lowvision\\\" id=\\\"lowvision\\\" shape=\\\"rect\\\">Low vision</a></strong> - includes poor acuity (vision that is not sharp), tunnel vision (seeing only the middle of the visual field), central field loss (seeing only the edges of the visual field), and clouded vision</li>\\n      <li><strong><a name=\\\"blindness\\\" id=\\\"blindness\\\" shape=\\\"rect\\\">Blindness</a></strong> - substantial, uncorrectable loss of vision in both eyes</li>\\n      <li><strong><a name=\\\"deafblind\\\" id=\\\"deafblind\\\" shape=\\\"rect\\\">Deaf-blindness</a></strong> - substantial, uncorrectable visual and hearing impairments</li>\\n    </ul>\\n  </div>\\n  <h3 class=\\\"f_panelHead\\\" style=\\\"cursor: pointer;\\\">Examples of barriers for people with visual disabilities<span class=\\\"f_expanderWrapper\\\">\\n    <button class=\\\"f_expand xk_button\\\" value=\\\"expand this section\\\" type=\\\"button\\\" style=\\\"display: inline-block;\\\">\\n        <img alt=\\\"expand this section\\\" src=\\\"/WAI/images/excol/plus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n    <button class=\\\"f_collapse xk_button\\\" value=\\\"collapse this section\\\" type=\\\"button\\\" style=\\\"display: none;\\\">\\n        <img alt=\\\"collapse this section\\\" src=\\\"/WAI/images/excol/minus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n</span>\\n</h3>\\n  <div style=\\\"display: none;\\\">\\n    <ul>\\n      <li>Images, controls, and other structural elements that do not have equivalent text alternatives</li>\\n      <li>Text, images, and page layouts that cannot be resized, or that lose information when resized</li>\\n      <li>Missing visual and non-visual orientation cues, page structure, and other navigational aids</li>\\n      <li>Video content that does not have text or audio alternatives, or an audio-description track</li>\\n      <li>Inconsistent, unpredictable, and overly complex navigation mechanisms and page functions</li>\\n      <li>Text and images with insufficient contrast between foreground and background color combinations</li>\\n      <li>Websites, web browsers, and authoring tools that do not support use of custom color combinations</li>\\n      <li>Websites, web browsers, and authoring tools that do not provide full keyboard support</li>\\n    </ul>\\n  </div>\\n  <h3 class=\\\"f_panelHead\\\" style=\\\"cursor: pointer;\\\">Sections related to visual disabilities<span class=\\\"f_expanderWrapper\\\">\\n    <button class=\\\"f_expand xk_button\\\" value=\\\"expand this section\\\" type=\\\"button\\\" style=\\\"display: inline-block;\\\">\\n        <img alt=\\\"expand this section\\\" src=\\\"/WAI/images/excol/plus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n    <button class=\\\"f_collapse xk_button\\\" value=\\\"collapse this section\\\" type=\\\"button\\\" style=\\\"display: none;\\\">\\n        <img alt=\\\"collapse this section\\\" src=\\\"/WAI/images/excol/minus.png\\\" class=\\\"xk_icon\\\">\\n        \\n        \\n    </button>\\n</span>\\n</h3>\\n  <div style=\\\"display: none;\\\">\\n    <p class=\\\"listintro\\\"><strong>Stories of web users:</strong></p>\\n    <ul class=\\\"listwithp\\\">\\n      <li><a href=\\\"stories#shopper\\\" shape=\\\"rect\\\">Mr. Lee, Online shopper with color blindness</a></li>\\n      <li><a href=\\\"stories#accountant\\\" shape=\\\"rect\\\">Ms. Laitinen, Accountant with blindness</a></li>\\n      <li><a href=\\\"stories#retiree\\\" shape=\\\"rect\\\">Mr. Yunus, Retiree with low vision, hand tremor, and mild short-term memory loss</a></li>\\n      <li><a href=\\\"stories#teenager\\\" shape=\\\"rect\\\">Ms. Kaseem, Teenager with deaf-blindness</a></li>\\n    </ul>\\n    <p class=\\\"listintro\\\"><strong>Diversity in web use:</strong></p>\\n    <ul class=\\\"listwithp\\\">\\n      <li><a href=\\\"browsing#format\\\" shape=\\\"rect\\\">Audio descriptions (Hearing, feeling, and seeing)</a></li>\\n      <li><a href=\\\"browsing#format\\\" shape=\\\"rect\\\">Auditory, tactile, and visual notifications (Hearing, feeling, and seeing)</a></li>\\n      <li><a href=\\\"browsing#format\\\" shape=\\\"rect\\\">Braille (Hearing, feeling, and seeing)</a></li>\\n      <li><a href=\\\"browsing#format\\\" shape=\\\"rect\\\">Refreshable braille display (Hearing, feeling, and seeing)</a></li>\\n      <li><a href=\\\"browsing#format\\\" shape=\\\"rect\\\">Screen reader (Hearing, feeling, and seeing)</a></li>\\n      <li><a href=\\\"browsing#format\\\" shape=\\\"rect\\\">Text-to-speech (Hearing, feeling, and seeing)</a></li>\\n      <li><a href=\\\"browsing#format\\\" shape=\\\"rect\\\">Transcripts (Hearing, feeling, and seeing)</a></li>\\n      <li><a href=\\\"browsing#presentation\\\" shape=\\\"rect\\\">Customized fonts and colors (Distinguishing and understanding)</a></li>\\n      <li><a href=\\\"browsing#presentation\\\" shape=\\\"rect\\\">Screen magnification (Distinguishing and understanding)</a></li>\\n      <li><a href=\\\"browsing#presentation\\\" shape=\\\"rect\\\">Screen magnifier (Distinguishing and understanding)</a></li>\\n      <li><a href=\\\"browsing#navigation\\\" shape=\\\"rect\\\">Consistency and predictability (Navigating and finding content)</a></li>\\n      <li><a href=\\\"browsing#navigation\\\" shape=\\\"rect\\\">Descriptive titles, headings, and labels (Navigating and finding content)</a></li>\\n      <li><a href=\\\"browsing#navigation\\\" shape=\\\"rect\\\">Helpful error and success messages (Navigating and finding content)</a></li>\\n      <li><a href=\\\"browsing#navigation\\\" shape=\\\"rect\\\">Keyboard navigation (Navigating and finding content)</a></li>\\n      <li><a href=\\\"browsing#navigation\\\" shape=\\\"rect\\\">Skip links (Navigating and finding content)</a></li>\\n      <li><a href=\\\"browsing#navigation\\\" shape=\\\"rect\\\">Visual orientation cues (Navigating and finding content)</a></li>\\n    </ul>\\n    <p class=\\\"listintro\\\"><strong>Accessibility principles:</strong></p>\\n    <ul class=\\\"listwithp\\\">\\n      <li><a href=\\\"principles#alternatives\\\" shape=\\\"rect\\\">Text alternatives for non-text content (Perceivable)</a></li>\\n      <li><a href=\\\"principles#captions\\\" shape=\\\"rect\\\">Captions and other alternatives for multimedia (Perceivable)</a></li>\\n      <li><a href=\\\"principles#adaptable\\\" shape=\\\"rect\\\">Content can be presented in different ways (Perceivable)</a></li>\\n      <li><a href=\\\"principles#distinguishable\\\" shape=\\\"rect\\\">Content is easier to see and hear (Perceivable)</a></li>\\n      <li><a href=\\\"principles#keyboard\\\" shape=\\\"rect\\\">Functionality is available from a keyboard (Operable)</a></li>\\n      <li><a href=\\\"principles#navigable\\\" shape=\\\"rect\\\">Users can easily navigate, find content, and determine where they are (Operable)</a></li>\\n      <li><a href=\\\"principles#readable\\\" shape=\\\"rect\\\">Content is readable and understandable (Understandable)</a></li>\\n      <li><a href=\\\"principles#predictable\\\" shape=\\\"rect\\\">Content appears and operates in predictable ways (Understandable)</a></li>\\n      <li><a href=\\\"principles#tolerant\\\" shape=\\\"rect\\\">Users are helped to avoid and correct mistakes (Understandable)</a></li>\\n      <li><a href=\\\"principles#compatible\\\" shape=\\\"rect\\\">Content is compatible with current and future user tools (Robust)</a></li>\\n    </ul>\\n  </div>\\n  <p class=\\\"totop\\\"><a href=\\\"#toc\\\" shape=\\\"rect\\\">back to page contents</a></p>\\n\\n    </div><div class=\\\"f_controls_accordion f_fileToLoad_accordionControls\\\"><p>\\n<button class=\\\"xk_button_all f_controlsExpand\\\" value=\\\"expand all sections\\\" type=\\\"button\\\">\\n    <img class=\\\"xk_icon\\\" src=\\\"/WAI/images/excol/plus.png\\\" alt=\\\"\\\">\\n    \\n    expand all sections\\n</button>\\n<button class=\\\"xk_button_all f_controlsCollapse\\\" value=\\\"collapse all sections\\\" type=\\\"button\\\" disabled=\\\"disabled\\\">\\n    <img class=\\\"xk_icon\\\" src=\\\"/WAI/images/excol/minus_dis.png\\\" alt=\\\"\\\">\\n    \\n    collapse all sections\\n</button>\\n</p>\\n</div>\\n  </div>\\n  <p>[<a href=\\\"stories\\\" shape=\\\"rect\\\"><strong>Previous Page</strong> - Stories of Web Users</a> | <a href=\\\"#main\\\" shape=\\\"rect\\\">Top of Page</a> | <a href=\\\"browsing\\\" shape=\\\"rect\\\"><strong>Next Page</strong> - Diversity in Web Use</a>]</p>\\n</div>\\n<div id=\\\"footer\\\">\\n<div class=\\\"highlight-version\\\">\\n<p><strong>Editors' Draft: 1 August 2012</strong>\\n<br clear=\\\"none\\\">\\n<strong>This document is an in-progress draft.</strong> If you quote anything from this draft, clearly indicate that it is draft wording.<br clear=\\\"none\\\">\\n<strong>References to this material must include the draft status</strong>, for example:</p>\\n<blockquote><em>How People with Disabilities Use the Web</em>. Shadi Abou-Zahra, ed. Copyright © 2012 W3C® (MIT, ERCIM, Keio). Status: Draft Updated 1 August 2012. http://www.w3.org/WAI/intro/people-use-web/Overview</blockquote>\\n<p>(For more information, see  <a href=\\\"http://www.w3.org/WAI/about/usingWAImaterial.html\\\" shape=\\\"rect\\\">Using WAI Material</a>.)</p>\\n</div>\\n\\n  <p><strong>Status:</strong> <strong>Draft</strong> Updated 1 August 2012.  [<a href=\\\"http://www.w3.org/WAI/EO/changelogs/cl-PWD-Use-Web\\\" shape=\\\"rect\\\">changelog</a>]<br clear=\\\"none\\\">\\n   Editor: Shadi Abou-Zahra. Previous editor: Judy Brewer. <a href=\\\"acknowledgments\\\" shape=\\\"rect\\\">Acknowledgments</a>. Developed with the <a href=\\\"http://www.w3.org/WAI/EO/2008/wai-age-tf\\\" shape=\\\"rect\\\">WAI-AGE Task Force</a> and the <a href=\\\"http://www.w3.org/WAI/EO/\\\" shape=\\\"rect\\\">Education and Outreach Working Group (EOWG)</a>. Developed as part of the <a href=\\\"http://www.w3.org/WAI/WAI-AGE/\\\" shape=\\\"rect\\\">WAI-AGE Project</a><strong> (IST 035015</strong>) funded by the <strong>European Commission under the 6th Framework</strong></p>\\n  <div class=\\\"footer-nav\\\"><p>[<a href=\\\"http://www.w3.org/WAI/sitemap.html\\\" shape=\\\"rect\\\">WAI Site Map</a>] [<a href=\\\"http://www.w3.org/WAI/sitehelp.html\\\" shape=\\\"rect\\\">Help with WAI Website</a>] [<a href=\\\"http://www.w3.org/WAI/search.php\\\" shape=\\\"rect\\\">Search</a>] [<a href=\\\"/WAI/contacts\\\" shape=\\\"rect\\\">Contacting WAI</a>]<br clear=\\\"none\\\">\\n         <strong>Feedback welcome to <a href=\\\"mailto:wai-eo-editors@w3.org\\\" shape=\\\"rect\\\">wai-eo-editors@w3.org</a></strong> (a publicly archived list) or <a href=\\\"mailto:wai@w3.org\\\" shape=\\\"rect\\\">wai@w3.org</a> (a WAI staff-only list).</p></div><div class=\\\"copyright\\\"><p><a rel=\\\"Copyright\\\" href=\\\"/Consortium/Legal/ipr-notice#Copyright\\\" shape=\\\"rect\\\">Copyright</a> © 1994-2013 <a href=\\\"/\\\" shape=\\\"rect\\\"><acronym title=\\\"World Wide Web Consortium\\\">W3C</acronym></a><sup>®</sup> (<a href=\\\"http://www.csail.mit.edu/\\\" shape=\\\"rect\\\"><acronym title=\\\"Massachusetts Institute of Technology\\\">MIT</acronym></a>, <a href=\\\"http://www.ercim.org/\\\" shape=\\\"rect\\\"><acronym title=\\\"European Research Consortium for Informatics and Mathematics\\\">ERCIM</acronym></a>, <a href=\\\"http://www.keio.ac.jp/\\\" shape=\\\"rect\\\">Keio</a>), All Rights Reserved. W3C <a href=\\\"/Consortium/Legal/ipr-notice#Legal_Disclaimer\\\" shape=\\\"rect\\\">liability</a>, <a href=\\\"/Consortium/Legal/ipr-notice#W3C_Trademarks\\\" shape=\\\"rect\\\">trademark</a>, <a rel=\\\"Copyright\\\" href=\\\"/Consortium/Legal/copyright-documents\\\" shape=\\\"rect\\\">document use</a> and <a rel=\\\"Copyright\\\" href=\\\"/Consortium/Legal/copyright-software\\\" shape=\\\"rect\\\">software\\n         licensing</a> rules apply. Your interactions with this site are in\\n         accordance with our <a href=\\\"/Consortium/Legal/privacy-statement#Public\\\" shape=\\\"rect\\\">public</a> and <a href=\\\"/Consortium/Legal/privacy-statement#Members\\\" shape=\\\"rect\\\">Member</a> privacy\\n         statements.</p></div>\\n</div>\\n\\n\\n<input type=\\\"hidden\\\" value=\\\"1\\\"></body></html>\"}",
          "creationDate": 1463497374938,
          "status": "ACTIVE"
        },
        "response": {
          "slugifiedPrimary": "html-classification-model",
          "headers": {
            "took": 42,
            "total": 8,
            "data": [
              {
                "slugifiedPrimary": "access-control-allow-headers",
                "condition": "OPTIONAL",
                "name": "Access-Control-Allow-Headers",
                "description": "",
                "links": {
                  "self": {
                    "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/573b33ade4b0106cac87e58c/headers/573b33ade4b0f0cd8cead3a2"
                  },
                  "model": {
                    "parent": true,
                    "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/573b33ade4b0106cac87e58c"
                  }
                },
                "id": "573b33ade4b0f0cd8cead3a2",
                "type": "STRING",
                "creationDate": 1463497645957,
                "value": "Accept-Language, Origin, Accept-Encoding, Authorization, Content-Type, X-Requested-With, Accept, X-CSRFToken, User-Agent, X-WizeScan-Version, X-WizeNote-Version",
                "status": "ACTIVE"
              },
              {
                "slugifiedPrimary": "access-control-allow-methods",
                "condition": "OPTIONAL",
                "name": "Access-Control-Allow-Methods",
                "description": "",
                "links": {
                  "self": {
                    "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/573b33ade4b0106cac87e58c/headers/573b33ade4b0106cac87e58d"
                  },
                  "model": {
                    "parent": true,
                    "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/573b33ade4b0106cac87e58c"
                  }
                },
                "id": "573b33ade4b0106cac87e58d",
                "type": "STRING",
                "creationDate": 1463497645984,
                "value": "GET, POST, PUT, DELETE, OPTIONS",
                "status": "ACTIVE"
              },
              {
                "slugifiedPrimary": "cache-control",
                "condition": "OPTIONAL",
                "name": "Cache-Control",
                "description": "",
                "links": {
                  "self": {
                    "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/573b33ade4b0106cac87e58c/headers/573b33aee4b002251bb1bc58"
                  },
                  "model": {
                    "parent": true,
                    "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/573b33ade4b0106cac87e58c"
                  }
                },
                "id": "573b33aee4b002251bb1bc58",
                "type": "STRING",
                "creationDate": 1463497646010,
                "value": "no-cache=\"set-cookie\"",
                "status": "ACTIVE"
              },
              {
                "slugifiedPrimary": "connection",
                "condition": "OPTIONAL",
                "name": "Connection",
                "description": "",
                "links": {
                  "self": {
                    "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/573b33ade4b0106cac87e58c/headers/573b33aee4b0d4681d33c148"
                  },
                  "model": {
                    "parent": true,
                    "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/573b33ade4b0106cac87e58c"
                  }
                },
                "id": "573b33aee4b0d4681d33c148",
                "type": "STRING",
                "creationDate": 1463497646081,
                "value": "keep-alive",
                "status": "ACTIVE"
              },
              {
                "slugifiedPrimary": "content-type",
                "condition": "OPTIONAL",
                "name": "Content-Type",
                "description": "",
                "links": {
                  "self": {
                    "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/573b33ade4b0106cac87e58c/headers/573b33aee4b0a49fce9d3ca4"
                  },
                  "model": {
                    "parent": true,
                    "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/573b33ade4b0106cac87e58c"
                  }
                },
                "id": "573b33aee4b0a49fce9d3ca4",
                "type": "STRING",
                "creationDate": 1463497646098,
                "value": "application/json;charset=UTF-8",
                "status": "ACTIVE"
              },
              {
                "slugifiedPrimary": "date",
                "condition": "OPTIONAL",
                "name": "Date",
                "description": "",
                "links": {
                  "self": {
                    "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/573b33ade4b0106cac87e58c/headers/573b33aee4b0a49fce9d3ca5"
                  },
                  "model": {
                    "parent": true,
                    "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/573b33ade4b0106cac87e58c"
                  }
                },
                "id": "573b33aee4b0a49fce9d3ca5",
                "type": "STRING",
                "creationDate": 1463497646323,
                "value": "Tue, 17 May 2016 15:07:20 GMT",
                "status": "ACTIVE"
              },
              {
                "slugifiedPrimary": "server",
                "condition": "OPTIONAL",
                "name": "Server",
                "description": "",
                "links": {
                  "self": {
                    "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/573b33ade4b0106cac87e58c/headers/573b33aee4b0faa3d71287e2"
                  },
                  "model": {
                    "parent": true,
                    "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/573b33ade4b0106cac87e58c"
                  }
                },
                "id": "573b33aee4b0faa3d71287e2",
                "type": "STRING",
                "creationDate": 1463497646327,
                "value": "Mashape/5.0.6",
                "status": "ACTIVE"
              },
              {
                "slugifiedPrimary": "transfer-encoding",
                "condition": "OPTIONAL",
                "name": "Transfer-Encoding",
                "description": "",
                "links": {
                  "self": {
                    "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/573b33ade4b0106cac87e58c/headers/573b33aee4b0bd4a7a7380f1"
                  },
                  "model": {
                    "parent": true,
                    "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/573b33ade4b0106cac87e58c"
                  }
                },
                "id": "573b33aee4b0bd4a7a7380f1",
                "type": "STRING",
                "creationDate": 1463497646378,
                "value": "chunked",
                "status": "ACTIVE"
              }
            ]
          },
          "took": 74,
          "updateDate": 1465562536829,
          "format": "JSON",
          "name": "HTML Classification model",
          "description": "The audience field describes the reading level of the text on the WizeNoze 5 level scale. In the fullText field the result of the HTML content extraction is returned. The language of the document is in the languageCode field.",
          "links": {
            "headers": {
              "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/573b33ade4b0106cac87e58c/headers/"
            },
            "self": {
              "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/573b33ade4b0106cac87e58c"
            },
            "version": {
              "parent": true,
              "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c"
            }
          },
          "id": "573b33ade4b0106cac87e58c",
          "body": "{\n  \"audience\" : {\n    \"id\" : 32,\n    \"label\" : \"EN4\",\n    \"name\" : \"Reading level 4\",\n    \"description\" : \"Reading level 4\",\n    \"level\" : 4\n  },\n  \"fullText\" : \"In-Suite Navigation\\n [DRAFT] How People with Disabilities Use the Web\\nIntroduction\\nThis page explores the wide range of diversity of people and abilities, and highlights some of the types of web accessibility barriers that people commonly encounter from poorly designed websites and web tools.\\nNote: This page is illustrative and is not intended to be an exhaustive listing of all disabilities and barriers.\\nOn this page\\nDiversity of abilities\\nThere are many reasons why people may be experiencing varying degrees of auditory, cognitive, neurological, physical, speech, and visual disabilities. For instance, some may have disabilities from birth, an illness, disease, or accident, or they may develop impairments with age. Some may not consider themselves to have disabilities even if they do experience such functional limitations.\\nMore about diversity of abilities\\nexpand this section\\ncollapse this section\\nEach individual is unique. People have diverse abilities, skills, tools, preferences, and expectations that can impact how they use the Web. For instance, consider the following aspects:\\nAge-related impairments: Many people develop age-related impairments. While they share the same functional requirements as others with disabilities, sometimes there are significant differences in the use of assistive technologies, the level of computer skills, or in the use of the Web in general.\\nMultiple disabilities: Some people have combinations of different kinds of disabilities, which may limit their approaches for interacting with the Web. For instance, someone who is deaf and has low vision might benefit from captions for audio, but only if these captions have adjustable size and color.\\nHealth conditions: Some people have health conditions that may affect their stamina, dexterity, or concentration. For instance, some may experience fatigue, pain, or other symptoms that could affect their physical use of the computer or limit the duration or extent of their use of the Web.\\nChanging abilities: Some people may be experiencing progressive or recurring functional limitations that impact their use of the Web differently at different times. For instance, some may need particular accessibility features on one day, and others or none on another day, depending on their condition.\\nTemporary impairments: Some people may be experiencing temporary impairments such as those that may occur due to an accident, surgery, or medication. They may not know about accessibility solutions, may not know how to use accessibility features, and may be unaware of their own needs.\\nSituational limitations: Some people may be experiencing constraints due to their surrounding or due to other situational aspects. For instance, they may be in a loud environment and unable to hear audio, in bright sunlight and unable to see a screen, or they may not be able to afford some technologies.\\nWebsites and web tools that are designed for people with a broad range of abilities benefit everyone, including people without disabilities. It is therefore important to consider the broad diversity of functional needs rather than to categorize people according to medical classifications.\\nAuditory\\nAuditory disabilities range from mild or moderate hearing impairments in one or both ears (\\\"hard of hearing\\\"), to substantial and uncorrectable impairment of hearing in both ears (\\\"deafness\\\"). Some people with auditory disabilities can hear sounds but sometimes not sufficiently to understand all speech, especially when there is background noise. This includes people using hearing aids or other approaches to improve the sound.\\nMore about auditory disabilities\\nexpand this section\\ncollapse this section\\nWhile the rapid increase of multimedia on the Web provides many new opportunities for people with auditory disabilities, it also poses challenges when content is not designed to be accessible. For instance, while video content can be used to communicate information visually, audio content needs to have alternatives, such as transcripts and captions, so that it is accessible for people with auditory disabilities.\\nTo use the Web effectively, people with auditory disabilities need:\\nTranscripts and captions of audio content, including audio-only content and audio tracks in multimedia\\nMedia players that display captions and provide options to adjust the text size and colors of captions\\nOptions to stop, pause, or adjust the volume of audio content (independently of the system volume)\\nHigh-quality foreground audio that is clearly distinguishable from any background noise\\nFor some people with auditory disabilities, sign language is the first language and they may not read a written language fluently. Providing important information in sign language and using simpler text that is supplemented by images, graphs, and other illustrations help make web content more understandable to many. However, it is important to remember that not all people with auditory disabilities know sign language.\\nCognitive and neurological\\nCognitive and neurological disabilities involve disorders of any part of the nervous system, including the brain and the peripheral nervous system. This can impact how well people hear, move, see, speak, and understand information. Cognitive and neurological disabilities do not necessarily affect the intelligence of a person.\\nMore about cognitive and neurological disabilities\\nexpand this section\\ncollapse this section\\nComputer technologies and the Web provide many opportunities for people with cognitive and neurological disabilities to interact with content and to process information in ways that are more usable to them. For instance, people can navigate web content using different strategies, access information in text, audio, or other formats, and change the presentation of the content according to their individual needs or preferences.\\nDepending on the particular needs of an individual, people with cognitive and neurological disabilities need:\\nClearly structured content that facilitates overview and orientation\\nConsistent labeling of forms, buttons, and other content parts\\nPredictable link targets, functionality, and overall behavior\\nDifferent ways of navigating websites, such as through a hierarchical menu or search option\\nSimpler text that is supplemented by images, graphs, and other illustrations\\nPeople with cognitive and neurological disabilities use different types of web browsing methods, depending on their particular needs. For instance, some people use text-to-speech software to hear the information while reading it visually, or use captions to read the information while hearing it. Some people use tools that resize text and spacing, and customize colors to assist reading, and grammar and spelling tools to assist writing. For these web browsing methods to work, developers need to consider web accessibility requirements which are often shared by people with hearing, physical, speech, or visual disabilities.\\nMore about physical disabilities\\nexpand this section\\ncollapse this section\\nTo use the Web, people with physical disabilities often use specialized hardware and software such as:\\nErgonomic or specially designed keyboard or mouse\\nHead pointer, mouth stick, and other aids to help typing\\nOn-screen keyboard with trackball, joystick, and switches to operate it\\nVoice recognition, eye tracking, and other approaches for hands-free interaction\\nPeople with physical disabilities may be using a mouse or mouse-like device only, or keyboard or keyboard-like device only to operate the computer. People with physical disabilities need full keyboard support for all functionality provided on a web page. They may need more time to type, click, or carry out other interaction, and they may type single keystrokes in sequence rather than typing simultaneous keystrokes (\\\"chording\\\") to activate commands. This includes commands for special characters, shortcut keys, or to active menu items.\\nPeople with physical disabilities often have trouble clicking small areas and are more likely to make mistakes in typing or clicking. Providing large clickable areas, enough time to complete tasks, and error correction options for forms are important design aspects. Other important design aspects include providing visible indicators of the current focus, and mechanisms to skip over blocks, such as over page headers or navigation bars. Many of these requirements are shared by people with cognitive, neurological, and visual disabilities.\\nRheumatism - typically refers to arthritis and other causes for bone or joint pain, and sometimes to fibromyalgia and other causes for muscular and other soft tissue pain\\nReduced dexterity - is a functional term (rather than a medical condition) that describes the ability to control the hand, such as hand-eye coordination of people with cognitive and neurological disabilities\\nMuscular dystrophy - progressive weakness and degeneration of muscles, including in arms and hands\\nSpeech\\nSpeech disabilities include difficulty producing speech that is recognizable by others or by voice recognition software. For instance, the loudness or clarity of someone's voice might be difficult to understand.\\nMore about speech disabilities\\nexpand this section\\ncollapse this section\\nPeople with speech disabilities encounter barriers with voice-based services, such as automated web-based hotlines and web applications that are operated using voice commands. To use services that rely on voice, people with speech disabilities need alternative modes for interaction such as a text-based chat to interact with hotline representatives or keyboard commands to operate web applications. Also, websites that provide telephone numbers as the only means of communicating with an organizations pose barriers for people with speech disabilities. Alternative means of communication include e-mail and feedback forms.\\nExamples of speech disabilities\\nexpand this section\\ncollapse this section\\nApraxia of speech (AOS) - includes inconsistent articulation and production of speech sounds, and errors producing sounds in the correct order so that spoken words or phrases become difficult to understand.\\nCluttering (also called \\\"tachyphemia\\\") - includes increased speaking rate, incorrect rhythm, intonation, and co-articulation of sounds, and other influency in speech that is sometimes similar to stuttering.\\nDysarthria - involves weakness or complete paralysis of muscles that are necessary to produce speech, including lips, lungs, throat, tongue, and others.\\nSpeech sound disorder - involves difficulty or inability to produce certain sounds or patterns of sound and sometimes results in addition, distortion, omission, or substitution of such sounds with others.\\nStuttering - includes influency in speech, repetition of individual sounds or entire words and phrases, and misplacement or prolongation of pauses and sounds during speech that is different from cluttering.\\nMuteness (also called \\\"mutism\\\") - involves inability to speak due to different reasons such as anxiety, brain injuries, or inability to hear and learn speech.\\ncollapse this section\\nVisual\\nVisual disabilities range from mild or moderate vision impairments in one or both eyes (\\\"low vision\\\" or \\\"partial sight\\\"), to substantial and uncorrectable loss of vision in both eyes (\\\"blindness\\\"). Some people have reduced or lack of sensitivity to certain colors (\\\"color blindness\\\"), or increased sensitivity towards excessive brightness in colors. These variations in perception of colors and brightness can be independent of the visual acuity.\\nMore about visual disabilities\\nexpand this section\\ncollapse this section\\nPeople with visual disabilities typically rely on changing the presentation of web content into forms that are more usable for their particular needs. For example by:\\nEnlarging or reducing text size and images\\nCustomizing settings for fonts, colors, and spacing\\nListening to text-to-speech synthesis of the content\\nListening to audio descriptions of video in multimedia\\nReading text using refreshable braille (small dots that are raised and lowered to display characters that are read by scanning over the raised dots using the fingertips)\\nFor these web browsing methods to work, developers need to ensure that the presentation of web content is independent of its underlying structure, and that the structure is correctly coded so that it can processed by software and presented in different ways. For instance, some people do not see the content and need lists, headings, tables, and other page structures to be properly coded so that they can be identified by software.\\nSome people are only seeing small portions of the content at a time or are perceiving the colors and design differently. Some people are using customized fonts, colors, and spacing to make the content more readable, or they are navigating through the content using keyboard only because they cannot see the mouse-pointer. An accessible design supports different presentations of the web content, and different ways for interaction.\\nExamples of visual disabilities\\nexpand this section\\ncollapse this section\\nColor blindness - includes difficulty distinguishing between colors such as between red and green, or between yellow and blue, and sometimes inability to perceive any color\\nLow vision - includes poor acuity (vision that is not sharp), tunnel vision (seeing only the middle of the visual field), central field loss (seeing only the edges of the visual field), and clouded vision\\nEditors' Draft: 1 August 2012This document is an in-progress draft. If you quote anything from this draft, clearly indicate that it is draft wording.References to this material must include the draft status, for example:\",\n  \"languageCode\" : \"en\"\n}",
          "creationDate": 1463497645019,
          "status": "ACTIVE"
        },
        "name": "HTML Classification",
        "links": {
          "headers": {
            "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/endpoints/573b2e40e4b0bd4a7a7380e9/headers/"
          },
          "routeparameters": {
            "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/endpoints/573b2e40e4b0bd4a7a7380e9/routeparameters/"
          },
          "payload": {
            "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/573b329ee4b0f0cd8cead39e"
          },
          "response": {
            "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/573b33ade4b0106cac87e58c"
          },
          "self": {
            "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/endpoints/573b2e40e4b0bd4a7a7380e9"
          },
          "version": {
            "parent": true,
            "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c"
          },
          "parameters": {
            "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/endpoints/573b2e40e4b0bd4a7a7380e9/parameters/"
          },
          "group": {
            "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/groups/575a8db8e4b0faa3d712b8d3"
          }
        },
        "id": "573b2e40e4b0bd4a7a7380e9",
        "parameters": {
          "took": 6,
          "total": 0,
          "data": []
        },
        "status": "ACTIVE",
        "group": {
          "slugifiedPrimary": "classify",
          "took": 11,
          "updateDate": 1465552497270,
          "name": "Classify",
          "index": 1,
          "links": {
            "self": {
              "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/groups/575a8db8e4b0faa3d712b8d3"
            },
            "version": {
              "parent": true,
              "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c"
            }
          },
          "id": "575a8db8e4b0faa3d712b8d3",
          "creationDate": 1465552312503,
          "status": "ACTIVE"
        }
      },
      {
        "headers": {
          "took": 10,
          "total": 1,
          "data": [
            {
              "slugifiedPrimary": "content-type",
              "condition": "REQUIRED",
              "updateDate": 1464957858446,
              "name": "Content-Type",
              "links": {
                "endpoint": {
                  "parent": true,
                  "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/endpoints/57515f9ee4b028dd938232e8"
                },
                "self": {
                  "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/endpoints/57515f9ee4b028dd938232e8/headers/57516885e4b0bd4a7a73a6f1"
                }
              },
              "id": "57516885e4b0bd4a7a73a6f1",
              "type": "STRING",
              "creationDate": 1464952965715,
              "value": "application/json",
              "status": "ACTIVE"
            }
          ]
        },
        "routeparameters": {
          "took": 6,
          "total": 0,
          "data": []
        },
        "updateDate": 1467128951452,
        "code": 200,
        "method": "POST",
        "description": "Classify a plain text document into one of 5 reading levels.",
        "creationDate": 1464950686585,
        "slugifiedPrimary": "text-classification",
        "routeregex": "/v1/classify/text",
        "route": "/v1/classify/text",
        "payload": {
          "slugifiedPrimary": "textrequest",
          "headers": {
            "took": 19,
            "total": 0,
            "data": []
          },
          "took": 29,
          "updateDate": 1466588150270,
          "name": "TextRequest",
          "format": "JSON",
          "description": "Text request for classification, containing the plain text to be classified and a languageCode (either 'en' for English or 'nl' for Dutch). When the languageCode is not provided the API tries to determine it automatically.",
          "links": {
            "headers": {
              "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57516960e4b01e9dae57e16e/headers/"
            },
            "self": {
              "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57516960e4b01e9dae57e16e"
            },
            "version": {
              "parent": true,
              "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c"
            }
          },
          "id": "57516960e4b01e9dae57e16e",
          "body": "{ \n    \"languageCode\" : \"en\",\n    \"text\" : \"This is a sample document. Short texts will not be classified so we send a slightly longer one.\"\n}",
          "creationDate": 1464953184341,
          "status": "ACTIVE"
        },
        "response": {
          "slugifiedPrimary": "text-classification-model",
          "headers": {
            "took": 43,
            "total": 8,
            "data": [
              {
                "slugifiedPrimary": "access-control-allow-headers",
                "condition": "OPTIONAL",
                "name": "Access-Control-Allow-Headers",
                "description": "",
                "links": {
                  "self": {
                    "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57516973e4b028dd938232f3/headers/57516974e4b0faa3d712ad51"
                  },
                  "model": {
                    "parent": true,
                    "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57516973e4b028dd938232f3"
                  }
                },
                "id": "57516974e4b0faa3d712ad51",
                "type": "STRING",
                "creationDate": 1464953204646,
                "value": "Accept-Language, Origin, Accept-Encoding, Authorization, Content-Type, X-Requested-With, Accept, X-CSRFToken, User-Agent, X-WizeScan-Version, X-WizeNote-Version",
                "status": "ACTIVE"
              },
              {
                "slugifiedPrimary": "access-control-allow-methods",
                "condition": "OPTIONAL",
                "name": "Access-Control-Allow-Methods",
                "description": "",
                "links": {
                  "self": {
                    "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57516973e4b028dd938232f3/headers/57516974e4b0bd4af84a4214"
                  },
                  "model": {
                    "parent": true,
                    "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57516973e4b028dd938232f3"
                  }
                },
                "id": "57516974e4b0bd4af84a4214",
                "type": "STRING",
                "creationDate": 1464953204841,
                "value": "GET, POST, PUT, DELETE, OPTIONS",
                "status": "ACTIVE"
              },
              {
                "slugifiedPrimary": "cache-control",
                "condition": "OPTIONAL",
                "name": "Cache-Control",
                "description": "",
                "links": {
                  "self": {
                    "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57516973e4b028dd938232f3/headers/57516974e4b0debcf7fe5bbc"
                  },
                  "model": {
                    "parent": true,
                    "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57516973e4b028dd938232f3"
                  }
                },
                "id": "57516974e4b0debcf7fe5bbc",
                "type": "STRING",
                "creationDate": 1464953204878,
                "value": "no-cache=\"set-cookie\"",
                "status": "ACTIVE"
              },
              {
                "slugifiedPrimary": "connection",
                "condition": "OPTIONAL",
                "name": "Connection",
                "description": "",
                "links": {
                  "self": {
                    "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57516973e4b028dd938232f3/headers/57516974e4b002251bb1e1d3"
                  },
                  "model": {
                    "parent": true,
                    "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57516973e4b028dd938232f3"
                  }
                },
                "id": "57516974e4b002251bb1e1d3",
                "type": "STRING",
                "creationDate": 1464953204854,
                "value": "keep-alive",
                "status": "ACTIVE"
              },
              {
                "slugifiedPrimary": "content-length",
                "condition": "OPTIONAL",
                "name": "Content-Length",
                "description": "",
                "links": {
                  "self": {
                    "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57516973e4b028dd938232f3/headers/57516974e4b028dd938232f4"
                  },
                  "model": {
                    "parent": true,
                    "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57516973e4b028dd938232f3"
                  }
                },
                "id": "57516974e4b028dd938232f4",
                "type": "STRING",
                "creationDate": 1464953204882,
                "value": "0",
                "status": "ACTIVE"
              },
              {
                "slugifiedPrimary": "content-type",
                "condition": "OPTIONAL",
                "name": "Content-Type",
                "description": "",
                "links": {
                  "self": {
                    "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57516973e4b028dd938232f3/headers/57516974e4b0bd4af84a4215"
                  },
                  "model": {
                    "parent": true,
                    "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57516973e4b028dd938232f3"
                  }
                },
                "id": "57516974e4b0bd4af84a4215",
                "type": "STRING",
                "creationDate": 1464953204863,
                "value": "text/plain; charset=UTF-8",
                "status": "ACTIVE"
              },
              {
                "slugifiedPrimary": "date",
                "condition": "OPTIONAL",
                "name": "Date",
                "description": "",
                "links": {
                  "self": {
                    "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57516973e4b028dd938232f3/headers/57516974e4b0f0cd8ceafa18"
                  },
                  "model": {
                    "parent": true,
                    "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57516973e4b028dd938232f3"
                  }
                },
                "id": "57516974e4b0f0cd8ceafa18",
                "type": "STRING",
                "creationDate": 1464953204806,
                "value": "Fri, 03 Jun 2016 11:26:43 GMT",
                "status": "ACTIVE"
              },
              {
                "slugifiedPrimary": "server",
                "condition": "OPTIONAL",
                "name": "Server",
                "description": "",
                "links": {
                  "self": {
                    "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57516973e4b028dd938232f3/headers/57516974e4b0a49fce9d5f90"
                  },
                  "model": {
                    "parent": true,
                    "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57516973e4b028dd938232f3"
                  }
                },
                "id": "57516974e4b0a49fce9d5f90",
                "type": "STRING",
                "creationDate": 1464953204984,
                "value": "Mashape/5.0.6",
                "status": "ACTIVE"
              }
            ]
          },
          "took": 53,
          "updateDate": 1467128951354,
          "format": "JSON",
          "name": "Text Classification model",
          "description": "The audience field describes the reading level of the text on the WizeNoze 5 level scale. The fullText and languageCode fields are the same as the ones in the request.",
          "links": {
            "headers": {
              "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57516973e4b028dd938232f3/headers/"
            },
            "self": {
              "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57516973e4b028dd938232f3"
            },
            "version": {
              "parent": true,
              "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c"
            }
          },
          "id": "57516973e4b028dd938232f3",
          "creationDate": 1464953203971,
          "body": "{\n  \"audience\" : {\n    \"id\" : 29,\n    \"label\" : \"EN1\",\n    \"name\" : \"Reading level 1\",\n    \"description\" : \"Reading level 1\",\n    \"level\" : 1\n  },\n  \"fullText\" : \"This is a sample document. Short texts will not be classified so we send a slightly longer one.\",\n  \"languageCode\" : \"en\"\n}",
          "status": "ACTIVE"
        },
        "name": "Text Classification",
        "links": {
          "headers": {
            "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/endpoints/57515f9ee4b028dd938232e8/headers/"
          },
          "routeparameters": {
            "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/endpoints/57515f9ee4b028dd938232e8/routeparameters/"
          },
          "payload": {
            "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57516960e4b01e9dae57e16e"
          },
          "response": {
            "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57516973e4b028dd938232f3"
          },
          "self": {
            "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/endpoints/57515f9ee4b028dd938232e8"
          },
          "version": {
            "parent": true,
            "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c"
          },
          "parameters": {
            "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/endpoints/57515f9ee4b028dd938232e8/parameters/"
          },
          "group": {
            "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/groups/575a8db8e4b0faa3d712b8d3"
          }
        },
        "id": "57515f9ee4b028dd938232e8",
        "parameters": {
          "took": 19,
          "total": 0,
          "data": []
        },
        "status": "ACTIVE",
        "group": {
          "slugifiedPrimary": "classify",
          "took": 10,
          "updateDate": 1465552497270,
          "name": "Classify",
          "index": 1,
          "links": {
            "self": {
              "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/groups/575a8db8e4b0faa3d712b8d3"
            },
            "version": {
              "parent": true,
              "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c"
            }
          },
          "id": "575a8db8e4b0faa3d712b8d3",
          "creationDate": 1465552312503,
          "status": "ACTIVE"
        }
      },
      {
        "headers": {
          "took": 10,
          "total": 1,
          "data": [
            {
              "slugifiedPrimary": "content-type",
              "condition": "REQUIRED",
              "name": "Content-Type",
              "description": "",
              "links": {
                "endpoint": {
                  "parent": true,
                  "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/endpoints/57517b81e4b0d9aabd9f48bf"
                },
                "self": {
                  "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/endpoints/57517b81e4b0d9aabd9f48bf/headers/57517b95e4b0a1d871a247b3"
                }
              },
              "id": "57517b95e4b0a1d871a247b3",
              "type": "STRING",
              "creationDate": 1464957845618,
              "value": "application/json",
              "status": "ACTIVE"
            }
          ]
        },
        "routeparameters": {
          "took": 5,
          "total": 0,
          "data": []
        },
        "updateDate": 1466588167987,
        "code": 200,
        "method": "POST",
        "description": "Extract the text from an HTML document at a given URL and classify it into one of 5 reading levels.",
        "creationDate": 1464957825320,
        "slugifiedPrimary": "url-classification",
        "routeregex": "/v1/classify/url",
        "route": "/v1/classify/url",
        "payload": {
          "slugifiedPrimary": "urlrequest",
          "headers": {
            "took": 6,
            "total": 0,
            "data": []
          },
          "took": 14,
          "updateDate": 1466588167913,
          "name": "URLRequest",
          "format": "JSON",
          "description": "Url request for classification, containing the url that points to the HTML document to be classified and a languageCode (either 'en' for English or 'nl' for Dutch). When the languageCode is not provided the API tries to determine it automatically.",
          "links": {
            "headers": {
              "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57517c38e4b0faa3d712ad69/headers/"
            },
            "self": {
              "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57517c38e4b0faa3d712ad69"
            },
            "version": {
              "parent": true,
              "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c"
            }
          },
          "id": "57517c38e4b0faa3d712ad69",
          "body": "{\n\"languageCode\" : \"en\",\n\"url\" : \"http://www.nytimes.com/2016/06/03/science/dogs-domestication-dna-study.html\"\n}",
          "creationDate": 1464958008102,
          "status": "ACTIVE"
        },
        "response": {
          "slugifiedPrimary": "url-classification-model",
          "headers": {
            "took": 186,
            "total": 8,
            "data": [
              {
                "slugifiedPrimary": "access-control-allow-headers",
                "condition": "OPTIONAL",
                "name": "Access-Control-Allow-Headers",
                "description": "",
                "links": {
                  "self": {
                    "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57517c41e4b01e9dae57e180/headers/57517c42e4b0debcf7fe5bce"
                  },
                  "model": {
                    "parent": true,
                    "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57517c41e4b01e9dae57e180"
                  }
                },
                "id": "57517c42e4b0debcf7fe5bce",
                "type": "STRING",
                "creationDate": 1464958018145,
                "value": "Accept-Language, Origin, Accept-Encoding, Authorization, Content-Type, X-Requested-With, Accept, X-CSRFToken, User-Agent, X-WizeScan-Version, X-WizeNote-Version",
                "status": "ACTIVE"
              },
              {
                "slugifiedPrimary": "access-control-allow-methods",
                "condition": "OPTIONAL",
                "name": "Access-Control-Allow-Methods",
                "description": "",
                "links": {
                  "self": {
                    "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57517c41e4b01e9dae57e180/headers/57517c42e4b002251bb1e1ea"
                  },
                  "model": {
                    "parent": true,
                    "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57517c41e4b01e9dae57e180"
                  }
                },
                "id": "57517c42e4b002251bb1e1ea",
                "type": "STRING",
                "creationDate": 1464958018145,
                "value": "GET, POST, PUT, DELETE, OPTIONS",
                "status": "ACTIVE"
              },
              {
                "slugifiedPrimary": "cache-control",
                "condition": "OPTIONAL",
                "name": "Cache-Control",
                "description": "",
                "links": {
                  "self": {
                    "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57517c41e4b01e9dae57e180/headers/57517c42e4b0bd4a7a73a70f"
                  },
                  "model": {
                    "parent": true,
                    "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57517c41e4b01e9dae57e180"
                  }
                },
                "id": "57517c42e4b0bd4a7a73a70f",
                "type": "STRING",
                "creationDate": 1464958018344,
                "value": "no-cache=\"set-cookie\"",
                "status": "ACTIVE"
              },
              {
                "slugifiedPrimary": "connection",
                "condition": "OPTIONAL",
                "name": "Connection",
                "description": "",
                "links": {
                  "self": {
                    "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57517c41e4b01e9dae57e180/headers/57517c42e4b002251bb1e1eb"
                  },
                  "model": {
                    "parent": true,
                    "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57517c41e4b01e9dae57e180"
                  }
                },
                "id": "57517c42e4b002251bb1e1eb",
                "type": "STRING",
                "creationDate": 1464958018366,
                "value": "keep-alive",
                "status": "ACTIVE"
              },
              {
                "slugifiedPrimary": "content-length",
                "condition": "OPTIONAL",
                "name": "Content-Length",
                "description": "",
                "links": {
                  "self": {
                    "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57517c41e4b01e9dae57e180/headers/57517c42e4b0f0cd8ceafa2e"
                  },
                  "model": {
                    "parent": true,
                    "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57517c41e4b01e9dae57e180"
                  }
                },
                "id": "57517c42e4b0f0cd8ceafa2e",
                "type": "STRING",
                "creationDate": 1464958018394,
                "value": "4505",
                "status": "ACTIVE"
              },
              {
                "slugifiedPrimary": "content-type",
                "condition": "OPTIONAL",
                "name": "Content-Type",
                "description": "",
                "links": {
                  "self": {
                    "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57517c41e4b01e9dae57e180/headers/57517c42e4b0a1d871a247b5"
                  },
                  "model": {
                    "parent": true,
                    "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57517c41e4b01e9dae57e180"
                  }
                },
                "id": "57517c42e4b0a1d871a247b5",
                "type": "STRING",
                "creationDate": 1464958018424,
                "value": "application/json;charset=UTF-8",
                "status": "ACTIVE"
              },
              {
                "slugifiedPrimary": "date",
                "condition": "OPTIONAL",
                "name": "Date",
                "description": "",
                "links": {
                  "self": {
                    "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57517c41e4b01e9dae57e180/headers/57517c42e4b0d9aabd9f48c2"
                  },
                  "model": {
                    "parent": true,
                    "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57517c41e4b01e9dae57e180"
                  }
                },
                "id": "57517c42e4b0d9aabd9f48c2",
                "type": "STRING",
                "creationDate": 1464958018299,
                "value": "Fri, 03 Jun 2016 12:46:56 GMT",
                "status": "ACTIVE"
              },
              {
                "slugifiedPrimary": "server",
                "condition": "OPTIONAL",
                "name": "Server",
                "description": "",
                "links": {
                  "self": {
                    "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57517c41e4b01e9dae57e180/headers/57517c42e4b01e9dae57e181"
                  },
                  "model": {
                    "parent": true,
                    "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57517c41e4b01e9dae57e180"
                  }
                },
                "id": "57517c42e4b01e9dae57e181",
                "type": "STRING",
                "creationDate": 1464958018347,
                "value": "Mashape/5.0.6",
                "status": "ACTIVE"
              }
            ]
          },
          "took": 198,
          "updateDate": 1465562558886,
          "format": "JSON",
          "name": "URL Classification model",
          "description": "The audience field describes the reading level of the text on the WizeNoze 5 level scale. In the fullText field the result of the HTML content extraction is returned. The language of the document is in the languageCode field.",
          "links": {
            "headers": {
              "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57517c41e4b01e9dae57e180/headers/"
            },
            "self": {
              "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57517c41e4b01e9dae57e180"
            },
            "version": {
              "parent": true,
              "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c"
            }
          },
          "id": "57517c41e4b01e9dae57e180",
          "body": "{\n  \"audience\" : {\n    \"id\" : 33,\n    \"label\" : \"EN5\",\n    \"name\" : \"Reading level 5\",\n    \"description\" : \"Reading level 5\",\n    \"level\" : 5\n  },\n  \"fullText\" : \"But the ancient origins of an animal that is an honorary member of many human families has remained in doubt: We still don’t know where dogs came from.\\nA group of scientists who are in the middle of a grand examination of canine fossils and modern DNA proposed Thursday to turn the whole conversation on its head.\\nSuppose dogs didn’t evolve in one place, they suggested, but two. What if domestication of ancient wolves happened in both Asia and Europe — different wolves, different people?\\nLaurent Frantz and Greger Larson of Oxford University and an international team of scientists who are all part of a dog domestication project run out of Oxford, made the new argument in a paper published in the journal Science. They make clear that although they think their explanation best suits the available evidence, more evidence is needed to confirm it.\\nMore Reporting on Dogs\\nScientists who were not part of the study agreed on the need for more evidence.\\n“It’s a hypothesis,” was as far as Peter Savolainen, a geneticist at the Royal Institute of Technology in Stockholm, would go. Dr. Savolainen has argued strongly, with limited support from other researchers, that dogs originated in East Asia, which, he noted, fits with at least half of the paper’s conclusion.\\nThe notion of a dual origin of dogs is something new for geneticists, but Dr. Larson said archaeologists have long considered the possibility that dogs were domesticated more than once.\\nSeparate domestications have occurred with other animals. Dr. Larson and Keith Dobney of Liverpool University found that wild boars were domesticated twice, once in China and once in Anatolia, part of modern Turkey.\\nFor the new study, Dr. Larson and Dr. Frantz obtained DNA sequences from 59 ancient dogs and a complete genome from a 4,800-year-old-dog fossil found at Newgrange, a well-known archaeological site in County Meath, Ireland. They also analyzed other DNA evidence.\\nSign Up for the Science Times Newsletter\\nEvery week, we'll bring you stories that capture the wonders of the human body, nature and the cosmos.\\nThey found a deep split between two groups — modern East Asian dogs and those from the Middle East and Europe.\\nThey calculated mutation rates based on the known age of the Irish dog and considered archaeological evidence of migrations as well.\\nThey said the overall picture could be explained two ways — by dogs originating in East Asia and then migrating west, or by dogs originating in Europe and Asia. They said there was a lack of archaeological evidence for an early, steady spread of dogs from an Eastern origin. And, they said, dog fossils from Europe dating to 15,000 years ago predated known migrations.\\nSo they concluded that dogs most likely originated both in Europe and in Asia. The Asian dogs then migrated with humans to Western Europe and the Middle East.\\nA version of this article appears in print on June 3, 2016, on page A8 of the New York edition with the headline: On the Origin of Dogs, Scientists See 2 Ancestral Lines. Order Reprints|Today's Paper|Subscribe\",\n  \"languageCode\" : \"en\"\n}",
          "creationDate": 1464958017351,
          "status": "ACTIVE"
        },
        "name": "URL Classification",
        "links": {
          "headers": {
            "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/endpoints/57517b81e4b0d9aabd9f48bf/headers/"
          },
          "routeparameters": {
            "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/endpoints/57517b81e4b0d9aabd9f48bf/routeparameters/"
          },
          "payload": {
            "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57517c38e4b0faa3d712ad69"
          },
          "response": {
            "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/57517c41e4b01e9dae57e180"
          },
          "self": {
            "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/endpoints/57517b81e4b0d9aabd9f48bf"
          },
          "version": {
            "parent": true,
            "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c"
          },
          "parameters": {
            "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/endpoints/57517b81e4b0d9aabd9f48bf/parameters/"
          },
          "group": {
            "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/groups/575a8db8e4b0faa3d712b8d3"
          }
        },
        "id": "57517b81e4b0d9aabd9f48bf",
        "parameters": {
          "took": 13,
          "total": 0,
          "data": []
        },
        "status": "ACTIVE",
        "group": {
          "slugifiedPrimary": "classify",
          "took": 34,
          "updateDate": 1465552497270,
          "name": "Classify",
          "index": 1,
          "links": {
            "self": {
              "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/groups/575a8db8e4b0faa3d712b8d3"
            },
            "version": {
              "parent": true,
              "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c"
            }
          },
          "id": "575a8db8e4b0faa3d712b8d3",
          "creationDate": 1465552312503,
          "status": "ACTIVE"
        }
      }
    ]
  },
  "visibility": "PUBLIC",
  "description": "The WizeNoze Readability API provides readability classification for plain text, raw HTML and URLs, in English and Dutch, predicting one of 5 reading levels, from easy to hard. The classification is based on state-of-the-art machine learning and natural language processing technology. To predict the readability for HTML documents we use a smart content extraction algorithm to get to the plain text, which is also included in the response.",
  "groups": {
    "took": 31,
    "total": 1,
    "data": [
      {
        "slugifiedPrimary": "classify",
        "updateDate": 1465552497270,
        "name": "Classify",
        "index": 1,
        "links": {
          "self": {
            "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/groups/575a8db8e4b0faa3d712b8d3"
          },
          "version": {
            "parent": true,
            "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c"
          }
        },
        "id": "575a8db8e4b0faa3d712b8d3",
        "creationDate": 1465552312503,
        "status": "ACTIVE"
      }
    ]
  },
  "creationDate": "Tue May 17 14:34:35 UTC 2016",
  "slugifiedPrimary": "v1",
  "haslogo": true,
  "current": true,
  "name": "v1",
  "links": {
    "models": {
      "total": 6,
      "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/models/"
    },
    "astronode": {
      "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/astronode"
    },
    "endpoints": {
      "total": 3,
      "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/endpoints/"
    },
    "changelogs": {
      "total": 0,
      "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/changelogs/"
    },
    "objects": {
      "total": 1,
      "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/objects/"
    },
    "groups": {
      "total": 1,
      "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/groups/"
    },
    "issues": {
      "total": 0,
      "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/issues/"
    },
    "tags": {
      "total": 2,
      "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/tags/"
    },
    "features": {
      "total": 2,
      "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/features/"
    },
    "plans": {
      "total": 4,
      "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/plans/"
    },
    "self": {
      "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c"
    },
    "tos": {
      "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/tos"
    },
    "api": {
      "parent": true,
      "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78"
    },
    "wikis": {
      "total": 1,
      "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/wikis/"
    },
    "errors": {
      "total": 0,
      "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/errors/"
    },
    "authentication": {
      "href": "https://market.mashape.com/api/middleware/accounts/573b2bf8e4b0106cac87e57c/apis/573b2bfae4b01e9dae57bd78/versions/573b2bfbe4b0bd4af84a1b6c/authentication"
    }
  },
  "id": "573b2bfbe4b0bd4af84a1b6c",
  "status": "ACTIVE"
}